{
    "grade": "Grade 8",
    "subject": "English",
    "education_level": "Junior Secondary",
    "strands": [
        {
            "strand_number": "1.0",
            "strand_name": "Listening and Speaking",
            "substrands": [
                {
                    "substrand_number": "1.1.1",
                    "substrand_name": "Polite Language: Telephone Etiquette",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify polite words and phrases in telephone conversations",
                        "conduct a telephone conversation using polite words and expressions",
                        "acknowledge the significance of etiquette in telephone conversations"
                    ],
                    "suggested_learning_experiences": [
                        " listen and identify words and phrases that indicate polite language in a telephone conversation from a digital device",
                        " role-play a telephone dialogue on human rights using polite language",
                        " match polite telephone conversation expressions with appropriate responses from the cards provided",
                        " practise leaving and taking telephone messages over the phone using polite language on a caller card"
                    ],
                    "key_inquiry_questions": [
                        "Why should one be polite when speaking over telephone?",
                        "How do we ensure politeness in a telephone conversation?"
                    ],
                    "core_competencies": [
                        "Communication: It is enhanced as the learner speaks with clarity while carrying out telephone conversations.",
                        "Digital literacy: It is enhanced as the learner uses the telephone to make calls under the guidance of the teacher."
                    ],
                    "values": [
                        "Respect: It is inculcated as the learner appreciates diverse opinions while taking turns during telephone conversations."
                    ],
                    "pcis": [
                        "Social cohesion: This is developed as the learner uses polite language when communicating over the phone."
                    ],
                    "links_to_other_subjects": [
                        "Use of polite language is taught in other languages like Kiswahili and it is also emphasized",
                        "in Religious Education."
                    ]
                },
                {
                    "substrand_number": "2.1.1",
                    "substrand_name": "Oral Presentations: Songs",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify features of songs in the locality",
                        "use performance techniques when singing",
                        "write songs on a scientific innovation",
                        "appreciate the role of songs in the society"
                    ],
                    "suggested_learning_experiences": [
                        " watch recordings of songs from the Kenya drama and music festivals",
                        " discuss the performance techniques that make the presentations appealing and make notes",
                        " identify songs of their choice and present them to the rest of the class",
                        " write songs on scientific innovations",
                        " collaborate to recite and record the songs or poems",
                        " watch the recordings and discuss the non- verbal aspects of the performance"
                    ],
                    "key_inquiry_questions": [
                        "How can one improve the presentation of a song to make it interesting?"
                    ],
                    "core_competencies": [
                        "Creativity and imagination: This is enhanced as the learner writes songs on scientific innovations.",
                        "Digital literacy: It is enhanced as the learner uses digital devices to record and watch performances then discuss non-verbal aspects of performances."
                    ],
                    "values": [
                        "Patriotism: It is fostered as the learner appreciates their culture while singing the different uniting songs."
                    ],
                    "pcis": [
                        "Citizenship: It is fostered as the learner watches Drama and Music Festival performances from different communities fostering social cohesion and patriotism."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to apply the skills acquired in drama performance techniques to Creative arts and sports."
                    ]
                },
                {
                    "substrand_number": "3.1.1",
                    "substrand_name": "Listening Comprehension",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify the main idea from a cause and effect text",
                        "pinpoint specific information from a cause and effect text",
                        "infer the meanings of unfamiliar words using context clues",
                        "acknowledge the importance of listening for detail"
                    ],
                    "suggested_learning_experiences": [
                        " listen to a cause and effect text on pollution being read by the teacher or from a digital device",
                        " pick out the main idea from that cause and effect text",
                        " respond to oral questions based on the text correctly",
                        " identify and write down the ideas presented in the text",
                        " orally answer questions based on the text",
                        " make a list of unfamiliar words and practise pronouncing them",
                        " give the meaning of specific words using context clues",
                        " look up the meanings of unfamiliar words from an online or offline dictionary",
                        " use given words to construct sentences"
                    ],
                    "key_inquiry_questions": [
                        "What should one look for when listening to a text?"
                    ],
                    "core_competencies": [
                        "Digital Literacy: It is enhanced as learner listens to texts and searches for meanings of words using digital devices.",
                        "Self- efficacy: This is enhanced as the learner practices pronouncing words and uses them correctly in sentences."
                    ],
                    "values": [
                        "Responsibility: It is cultivated as the learner acquires knowledge about how to take care of the environment from the cause and effect text on pollution."
                    ],
                    "pcis": [
                        "Environmental education awareness: It is enhanced as the learner listens to a text on pollution."
                    ],
                    "links_to_other_subjects": [
                        "The learner relates good listening skills to the learning of listening in Kiswahili."
                    ]
                },
                {
                    "substrand_number": "4.1.1",
                    "substrand_name": "Listening Comprehension: Selective Listening",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "distinguish between specific and general information from a listening text",
                        "select specific information from a text",
                        "listen and respond to texts appropriately",
                        "emphasise the value of listening skills in communication"
                    ],
                    "suggested_learning_experiences": [
                        " listen to an audio text on consumer roles and responsibilities and decide whether the information presented is specific or general",
                        " search online for audio recordings and attentively listen for specific information",
                        " role play a scene on roles and responsibilities of consumers to emphasise listening skills during communication",
                        " listen to a passage on consumer roles and responsibilities and answer questions posed by the speaker"
                    ],
                    "key_inquiry_questions": [
                        "Why is it important to get the main points from an oral text?",
                        "How can you ensure you capture the relevant information from a speaker?"
                    ],
                    "core_competencies": [
                        "Critical thinking: It is enhanced as the learner critically listens to oral texts and selects information."
                    ],
                    "values": [
                        "Responsibility: It is enhanced as the learner listens to texts on consumer roles and responsibilities."
                    ],
                    "pcis": [
                        "Consumer literacy skills: They are enhanced as the learner listens to texts on consumer roles and responsibilities.",
                        "Effective communication skills: They are enhanced as the learner listens to and responds to audio texts."
                    ],
                    "links_to_other_subjects": [
                        "Areas:",
                        "The learner is able to practice selective listening as a lifelong skill and also relate it to the learning of listening skills in Creative",
                        "arts and sports.",
                        "4.2. Reading\t4.2.1 Intensive Reading",
                        "a)\tidentify reading strategies for use on given texts,",
                        "b)\tselect main ideas and details from written texts,",
                        "c)\tacknowledge reading for main ideas and details as a comprehension skill.\tThe learner is guided to:",
                        "•\tsearch online and watch appropriate video clips on the selected reading strategies: reading for main ideas and reading for details,",
                        "•\tread and underline the main ideas and details in texts on consumer roles and responsibilities and review each other’s work,",
                        "•\twork with peers and share ideas on how one can practically use the selected reading strategies,",
                        "•\tfill in substitution tables with specific details from texts,",
                        "•\tcomplete a mind map with focus on the main idea and details.\t1.\tWhy should one read for main ideas?",
                        "2.\tHow can you improve your reading?",
                        "Core Competencies to be developed:",
                        "•\tLearning to learn: It is enhanced as the learner shares what they have learnt while completing the mind map.",
                        "•\tDigital literacy: It is achieved as the learner manipulates digital devices when searching online and watching appropriate video clips on the selected reading strategies.",
                        "Values:",
                        "Unity: It is enhanced as the learner collaboates with peers to complete the mind map.",
                        "Pertinent and Contemporary Issues (PCIs):",
                        "Consumer literacy: It is enhanced as the learner reads and underlines the main ideas and details in texts on consumer roles and responsibilities.",
                        "Links to other Learning Areas:",
                        "The learner is able to relate intensive reading skills to reading in other languages such as Kiswahili."
                    ]
                },
                {
                    "substrand_number": "5.1.1",
                    "substrand_name": "Pronunciation",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify words with sounds /ɒ/, /ͻ:/, /θ/ and /ð/ in a given text",
                        "pronounce words that have target sounds correctly",
                        "apply emphatic stress correctly in varied contexts",
                        "acknowledge the role of correct pronunciation in communication"
                    ],
                    "suggested_learning_experiences": [
                        " interact with an audio or video recording featuring vowel sounds/ɒ/ /ͻ:/ and consonant sounds/θ/ /ð/ from a digital device",
                        " list words that contain the mentioned sounds from print or digital texts",
                        " pronounce the identified words correctly, with peers",
                        " play word games involving the target sounds",
                        " with peers, search online and offline for the meaning of emphatic stress",
                        " listen to a series of sentences and identify the stressed words",
                        " collaborate to recite a poem and emphasise given words to bring out various meanings",
                        " read sentences and stress given words appropriately"
                    ],
                    "key_inquiry_questions": [
                        "How can one improve their pronunciation?"
                    ],
                    "core_competencies": [
                        "Communication: It is enhanced as the learner listens keenly and articulates sounds and stressed words.",
                        "Collaboration: It is promoted as the learner works with peers to practise sounds and stress in sentences."
                    ],
                    "values": [
                        "Responsibility: It is fostered as the learner demonstrates accountability when participating in group recitation of poems."
                    ],
                    "pcis": [
                        "Effective communication: It is enhanced as the learner becomes more proficient in pronunciation."
                    ],
                    "links_to_other_subjects": [
                        "The learner relates proper pronunciation to the learning of effective communication in Kiswahili."
                    ]
                },
                {
                    "substrand_number": "6.1.1",
                    "substrand_name": "Conversational Skills: Disagreeing politely",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "list ways of disagreeing politely",
                        "use conversational strategies to disagree appropriately",
                        "apply non-verbal cues to express varied moods and feelings",
                        "advocate for the need to speak politely during communication"
                    ],
                    "suggested_learning_experiences": [
                        " watch a short video or read an excerpt in which speakers disagree appropriately and identify polite expressions used",
                        " role play the events depicted in the video or excerpt",
                        " practise disagreeing politely while incorporating non-verbal cues",
                        " listen to a dialogue where characters agree or disagree politely",
                        " work with peers to write a short dialogue depicting disagreeing politely and present it to the rest of the class"
                    ],
                    "key_inquiry_questions": [
                        "Which words or phrases are used to show politeness?",
                        "How do you use non-verbal cues to express different moods and feelings?"
                    ],
                    "core_competencies": [
                        "Collaboration: It is enhanced as the learner contributes to group decision making while role playing events in a video in which speakers disagree politely."
                    ],
                    "values": [
                        "Respect: It is enhanced as the learner learns to disagree politely."
                    ],
                    "pcis": [
                        "Effective communication: It is enhanced as the learner learns to disagree politely during conversations"
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to relate politeness to other learning areas such as Mathematics and Integrated Science."
                    ]
                },
                {
                    "substrand_number": "7.1.1",
                    "substrand_name": "Listening for Detail",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify main ideas in a listening text",
                        "respond appropriately to questions based on the listening text",
                        "acknowledge the importance of listening for details in life"
                    ],
                    "suggested_learning_experiences": [
                        " listen to a recorded text on wild life and answer questions from the text, and discuss the main ideas",
                        " listen to a passage read by peers or the teacher and outline the main ideas from the text individually",
                        " discuss with peers answers based on a given text"
                    ],
                    "key_inquiry_questions": [
                        "How should one listen for detail?"
                    ],
                    "core_competencies": [
                        "Communication: It is promoted as the learner listens keenly and actively and responds to questions.",
                        "Digital literacy: It is enhanced as the learner interacts with digital devices when listening to a recorded text."
                    ],
                    "values": [
                        "Patriotism: It is promoted as the learner nurtures the love of their country by interacting with texts on Kenya’s rich wildlife heritage.",
                        "Responsibility: It is promoted as the learner is sensitised on the importance of wildlife."
                    ],
                    "pcis": [
                        "Wildlife conservation: It is enhanced as the learner interacts with information about wildlife."
                    ],
                    "links_to_other_subjects": [
                        "The leaner develops listening for detail and is able to relate it to their learning in Kiswahili."
                    ]
                },
                {
                    "substrand_number": "8.1.1",
                    "substrand_name": "Listening and Responding: Oral Narratives - Myths",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify the characters in a given myth",
                        "narrate the key events in a given myth",
                        "explain the moral lesson in a set myth",
                        "relate the characters in a myth to real life",
                        "acknowledge the role/importance of oral literature in lifelong learning"
                    ],
                    "suggested_learning_experiences": [
                        " predict events in a myth from the title or pictures in the story",
                        " listen to a narration of a myth from your community then retell the myth to their peers",
                        " watch a video recording of a myth",
                        " identify the characters in the myth",
                        " collaborate answer questions from the story",
                        " discuss the lessons learnt from a myth",
                        " discuss the relevance of the story to real life"
                    ],
                    "key_inquiry_questions": [
                        "How can you tell what is going to happen in a story?",
                        "How are the characters or events in the story related to the people or happenings around us?"
                    ],
                    "core_competencies": [
                        "Digital literacy: It is enhanced as the learner interacts with technology through video recording of a myth.",
                        "Collaboration: It is enhanced as the learner respects the rules of engagement when discussing the moral lesson of a story with peers."
                    ],
                    "values": [
                        "Respect: It is developed as the learner listens to and appreciates myths from different communities."
                    ],
                    "pcis": [
                        "Social cohesion: It is enhanced as the learner interacts with stories from various communities."
                    ],
                    "links_to_other_subjects": [
                        "Areas:",
                        "The learner relates myths and other types of narratives to other learning areas such as Religious Education."
                    ]
                },
                {
                    "substrand_number": "9.1.1",
                    "substrand_name": "Pronunciation: 9.1.1.1\tSounds: vowels /ɑː/ /зː/and consonants /tʃ/ and/dʒ/ 9.1.1.2\t: Stressed and unstressed words (content and function words)",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify words with vowels\n/ɑː/; /зː/ and the consonant\n/tʃ/; /dʒ/ from a sample text",
                        "pronounce the vowels /ɑː/;\n/зː/ and the consonants /tʃ/;\n/dʒ/ correctly",
                        "apply stress on content words while leaving the function words unstressed",
                        "acknowledge the importance of emphatic stress in communication"
                    ],
                    "suggested_learning_experiences": [
                        " listen to a recording and identify the sounds /ɑː/ /зː/ /tʃ/ and/dʒ/",
                        " practise saying the sounds /ɑː/ /зː/ /tʃ/ and/dʒ/",
                        " identify the stressed and unstressed words in a sample text",
                        " work with peers to practise saying words with the sounds /ɑː/ /зː/ /tʃ/ and/dʒ/ and make a recording",
                        " listen to sentences as they are read out",
                        " pick out words that are either stressed and unstressed",
                        " collaborate to recite a poem and identify the stressed words"
                    ],
                    "key_inquiry_questions": [
                        "Why are some words said with greater force than others?",
                        "Why do we pronounce some words differently from others in a sentence?"
                    ],
                    "core_competencies": [
                        "Self-efficacy: It is achieved as the learner pronounces words correctly.",
                        "Communication and collaboration: This is enhanced as the learner works in harmony with others to pronounce words correctly."
                    ],
                    "values": [
                        "Peace: It is promoted by learner avoiding to hurt peers as they collaborate to recite a poem and identify the stressed words."
                    ],
                    "pcis": [
                        "Citizenship: It is promoted as the learner learns sounds so that they can communicate effectively globally."
                    ],
                    "links_to_other_subjects": [
                        "Pronunciation and sentence stress is important in the concept of public speaking in Creative arts and sports.",
                        "Outcomes\tSuggested Learning Experiences\tSuggested Key"
                    ]
                },
                {
                    "substrand_number": "10.1.1",
                    "substrand_name": "Oral Presentations",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify the items in the format of a speech",
                        "present a written speech using effective speaking skills",
                        "prepare a short speech on a given topic",
                        "acknowledge the importance of good speaking skills for effective communication"
                    ],
                    "suggested_learning_experiences": [
                        " search online and offline for the format of a speech",
                        " listen to or watch a recorded speech from a digital device",
                        " identify the introduction, body and conclusion of the speech they have listened to or watched",
                        " work with peers write down points on how they can appreciate their heritage through art",
                        " collaborate to prepare a speech using the points generated above and present it in class",
                        " present the speech to the whole class as other learners provide feedback on the non-verbal cues used",
                        " identify the speaking strategies that made each speech interesting"
                    ],
                    "key_inquiry_questions": [
                        "How can you make a speech presentation interesting?",
                        "What are some of the techniques for introducing or concluding a speech?"
                    ],
                    "core_competencies": [
                        "Communication and collaboration: It is inculcated as the learner works in groups to discuss the format of a speech.",
                        "Learning to learn: It is developed as the learner organises their own learning and acquire speech presentation skills."
                    ],
                    "values": [
                        "Respect:It is enhanced as the learner listens to peers` speeches and respect each other’s opinions.",
                        "Unity: It is enhanced as the learner collaborates with peers while engaging in conversations."
                    ],
                    "pcis": [
                        "Social cohesion: It is improved as the learner are presenting a speech on art thus making learners appreciate their heritage"
                    ],
                    "links_to_other_subjects": [
                        "Public speaking is a concept relevant in performance of various genres in Creative arts and sports and sports",
                        "Outcomes\tSuggested Learning Experiences\tSuggested Key"
                    ]
                },
                {
                    "substrand_number": "11.1.1",
                    "substrand_name": "Conversational Skills: interviews",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify polite words and expressions in a radio or television interview",
                        "use polite words and expressions when conducting an interview",
                        "appreciate the role of interviews in presenting reality"
                    ],
                    "suggested_learning_experiences": [
                        " listen to a recorded or a role played interview and identify polite expressions used. For example, “I am sorry but...”; “your point is valid, but...”",
                        " watch a video in which the speakers are engaged in a radio or television interview",
                        " make a list of the verbal and non- verbal cues used by the speakers to express politeness",
                        " brainstorm and conduct an interview on choosing a career in traffic law enforcement agencies using polite expressions",
                        " search online and offline for typical questions and answers in a radio or television interview",
                        " conduct a hot seating episode that relates to experiences people go through in their various careers"
                    ],
                    "key_inquiry_questions": [
                        "Why is it important to use polite language during an interview?",
                        "How do we show respect for other people’s opinion?"
                    ],
                    "core_competencies": [
                        "Collaboration: It is promoted as the learner observes the rules of engagement while playing different roles as interviewee or interviewer.",
                        "Digital literacy: It is enhanced as the learner uses both the radio and television as sources of information."
                    ],
                    "values": [
                        "Respect: It is developed as the learner disagrees politely while conducting the interview.",
                        "Unity: It is promoted as the learner endeavours to achieve a common goal while organising and engaging in interviews with peers."
                    ],
                    "pcis": [
                        "Effective communication: It is achieved as the learner acquires skills for expressing opinions."
                    ],
                    "links_to_other_subjects": [
                        "Use of polite language is relevant to the concept of harmonious living in Religious Education and Social Studies."
                    ]
                },
                {
                    "substrand_number": "12.1.1",
                    "substrand_name": "Listening to Respond: Attitude",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "a)\texplain the message in a given song,",
                        "b)\tuse appropriate words and expressions to express their attitude towards a given song,",
                        "c)\tappreciate how choice of words affects the reader."
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [
                        "including modern fashion.\t1.\tWhat messages are found in songs?",
                        "What makes one like or dislike a song?"
                    ],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "13.1.1",
                    "substrand_name": "Extensive Listening: Poems",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "a)\tidentify messages in poems,",
                        "b)\tperform poems using appropriate techniques,",
                        "c)\tacknowledge the role of poems in society."
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [
                        "•\tdiscuss what stands out in presentation.\t1.\tHow can you improve the presentation of a poem?",
                        "What messages are conveyed in poem?"
                    ],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "14.1.1",
                    "substrand_name": "Pronunciation and Intonation",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "a)\tidentify silent consonant letters in words,",
                        "b)\tpronounce words with silent consonant letters in sentences,",
                        "c)\tuse the correct intonation in declarative and exclamatory sentences,",
                        "d)\tacknowledge the importance of correct pronunciation and intonation in communication."
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [
                        "•\tunderline silent letters in words.\t1.\tWhy should we use the right intonation when speaking?",
                        "What are some of the words with silent letters?"
                    ],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "15.1.1",
                    "substrand_name": "Oral Reports: Events",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "a)\trecount events that take place outside the classroom,",
                        "b)\tpresent a report on occurences taking place out of the classsroom using verbal and non-verbal cues,",
                        "c)\tacknowledge the role of oral reports in communication."
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [
                        "•\tprovide feedback on reports presented by peers and suggest improvements.\t1.\tHow can you make your presentation convincing?",
                        "Why do we give oral reports?"
                    ],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                }
            ]
        },
        {
            "strand_number": "2.0",
            "strand_name": "Reading",
            "substrands": [
                {
                    "substrand_number": "1.2.1",
                    "substrand_name": "Extensive Reading: Independent Reading",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify print and non- print texts that are interesting to read",
                        "read a range of texts for information",
                        "appreciate the importance of reading for enjoyment"
                    ],
                    "suggested_learning_experiences": [
                        " skim through grade-appropriate print and electronic reading materials",
                        " scan grade-appropriate print and electronic reading materials",
                        " read materials on human rights at their pace within a specified period",
                        " discuss what they have read",
                        " write down the main ideas in the texts they have read",
                        " use a dictionary to look up the meaning of vocabulary acquired from independent reading",
                        " infer the meaning of words as used in the texts"
                    ],
                    "key_inquiry_questions": [
                        "Why should one read widely?",
                        "What should one consider when selecting a reading text?"
                    ],
                    "core_competencies": [
                        "Self–efficacy: This is enhanced when the learner improves their self-esteem as they choose the texts to read.",
                        "Learning to learn: It is enhanced as the learner gains assertiveness and independence when they select reading materials."
                    ],
                    "values": [
                        "Responsibility: It is developed as the learner engages and helps peers in selecting reading materials."
                    ],
                    "pcis": [
                        "Decision-making: This is improved as the learner chooses what to read extensively from a variety of materials."
                    ],
                    "links_to_other_subjects": [
                        "The learner relates the concept of human rights to the study of other learning areas such as Social Studies which handles human rights as a pertinent issue.",
                        "Outcomes\tSuggested Learning Experiences\tSuggested Key"
                    ]
                },
                {
                    "substrand_number": "1.4.1",
                    "substrand_name": "Intensive Reading: Short Stories (Class Reader)",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "outline the sequence of events in a short story that they have read",
                        "use contextual clues to infer the meanings of words",
                        "answer direct and inferential questions from a short story",
                        "acknowledge the role of reading in communication"
                    ],
                    "suggested_learning_experiences": [
                        " predict events by focusing on the title and illustrations in a text",
                        " silently read the short story",
                        " infer contextual meanings of words based on the events in the story",
                        " retell the story while citing issues on human rights",
                        " role-play selected events and characters in the story",
                        " work with peers to discuss the relationships between their own lives and those of characters in the text"
                    ],
                    "key_inquiry_questions": [
                        "How can you predict the outcome of a story even before you read it?",
                        "How do you tell the meaning of unfamiliar words in a story?"
                    ],
                    "core_competencies": [
                        "Critical thinking: It is promoted as the learner assesses the relationship between their own lives and those of the characters in the story.",
                        "Citizenship: It is promoted as the learner cites issues on human rights."
                    ],
                    "values": [
                        "Responsibility: It is promoted as the learner takes different roles to dramatise the events in the story."
                    ],
                    "pcis": [
                        "Environmental and social issues: It is promoted as the learner compares their experiences with those of the characters in the story."
                    ],
                    "links_to_other_subjects": [
                        "Intensive reading is handled in Kiswahili."
                    ]
                },
                {
                    "substrand_number": "2.2.1",
                    "substrand_name": "Intensive Reading: Simple poems",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify the persona in a given poem",
                        "identify instances of repetition in a given poem",
                        "explain what the poem is about",
                        "appreciate the role of poems in communication"
                    ],
                    "suggested_learning_experiences": [
                        " read a given poem for enjoyment",
                        " recite/rap and dramatise the given poem",
                        " discuss the voice that speaks in the poem (the persona)",
                        " explain the words, phrases and sentences that help them to decipher the surface and deeper meaning of a poem",
                        " relate the message in the poem with real life experiences",
                        " work with peers to compose, type and share poems related to scientific innovations",
                        " display their poems on a chart, a poster in class or on the school notice board"
                    ],
                    "key_inquiry_questions": [
                        "How is a poem different from a passage?",
                        "How can you say what is in the poem in your own words?"
                    ],
                    "core_competencies": [
                        "Critical thinking and problem-solving: It is enhanced as the learner relates the message in the poem to real life and explores different ways of dealing with the issues mentioned.",
                        "Self–efficacy: It is developed as the learner pays attention to detail while composing a poem related to scientific innovations."
                    ],
                    "values": [
                        "Responsibility: It is enhanced as the learner engages in writing poems on scientific innovations in groups."
                    ],
                    "pcis": [
                        "Social cohesion is developed as the learner works together with peers to compose poems on scientific innovations."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to relate to concepts learnt in poetry to their learning in Kiswahili."
                    ]
                },
                {
                    "substrand_number": "2.4.1",
                    "substrand_name": "Intensive Reading: Short story (Class Reader)",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify the setting - time and place-of a short story",
                        "highlight the episodes in the short story chronologically",
                        "appreciate the differences in culture and setting"
                    ],
                    "suggested_learning_experiences": [
                        " watch different places and times of the day and night from a digital device or written text",
                        " read a short story and retell what they have read",
                        " tease out the geographical setting, the historical period and the culture from which the story is based by looking at the words and elements used in the story",
                        " work with peers to compare the setting and places in the short story to their own real life setting",
                        " use their surroundings to describe the setting and place",
                        " draw or take pictures of different settings at different times"
                    ],
                    "key_inquiry_questions": [
                        "Which places in the short stories would you like to visit?",
                        "Which time in history would you desire to live?"
                    ],
                    "core_competencies": [
                        "Digital literacy: It is enhanced as the learner manipulates digital devices while looking at different places at different times.",
                        "Imagination and creativity: These are brought out as the learner undertakes tasks that encourage artistic expression while drawing or taking pictures of different settings."
                    ],
                    "values": [
                        "Unity: It is fostered as the learner displays team spirit while working with peers to compare the setting in the short story with that of their environment."
                    ],
                    "pcis": [
                        "Peace education: It is enhanced as the learner appreciates the fact that different people live in different places."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to relate the content of short stories to similar content in other subjects such as Religious Education."
                    ]
                },
                {
                    "substrand_number": "3.2.1",
                    "substrand_name": "Intensive Reading",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "answer questions based on a given text correctly",
                        "infer meanings of words in a given text correctly",
                        "acknowledge the importance of good reading skills reading in life"
                    ],
                    "suggested_learning_experiences": [
                        " predict events by focusing on the title and illustrations in a text",
                        " individually, silently read a passage on pollution so as to internalize the information",
                        " read the passage aloud in turns as they answer oral questions that are asked",
                        " infer the meaning of given words using synonyms, contexts among others",
                        " work with peers to recapture events in the text as they role play",
                        " write answers to the questions given after the passage correctly"
                    ],
                    "key_inquiry_questions": [
                        "How can one improve the way they read?",
                        "Which skills should one use in order to read effectively?"
                    ],
                    "core_competencies": [
                        "Critical thinking: It is cultivated as the learner infers meanings of words used in the passage.",
                        "Communication and collaboration: It is promoted as the learner works with peers to infer meanings of given words."
                    ],
                    "values": [
                        "Patriotism: It is fostered as the learner acquires knowledge on pollution and how to improve the environment by reading varied texts."
                    ],
                    "pcis": [
                        "Environmental education awareness: It is enhanced as the learner reads a passage on pollution."
                    ],
                    "links_to_other_subjects": [
                        "The learner relates intensive reading to other learning areas where intensive reading is a critical skill such as in Social Studies and Kiswahili.",
                        "Outcomes\tSuggested Learning Experiences\tSuggested Key"
                    ]
                },
                {
                    "substrand_number": "3.4.1",
                    "substrand_name": "Intensive reading: Poetry",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify the aspects of structure in a given poem",
                        "recognize the main ideas in a given poem",
                        "recognize the role of poems in communicating values"
                    ],
                    "suggested_learning_experiences": [
                        " search online and offline for the components of the structure of a poem; poet, number of stanzas, number of lines in a stanza",
                        " read a given poem and identify the structure",
                        " recite and dramatize the given poem",
                        " explain the words, phrases and sentences in a poem that help them to decipher the surface and deeper meaning",
                        " relate the message of the poem to real life",
                        " identify topics of poems such as pollution, list the topics down and display them in charts",
                        " compose, type and share a poem related to pollution, with peers",
                        " display their poems in a portfolio/chart/class noticeboard"
                    ],
                    "key_inquiry_questions": [
                        "What messages do poems convey?"
                    ],
                    "core_competencies": [
                        "Problem solving: It is enhanced as the learner attempts to solve simple problems while discussing the messages in a poem and",
                        "relating them to real life."
                    ],
                    "values": [
                        "Respect: It is enhanced as the learner respects diverse opinions while engaging in discussions and writing of poems on pollution."
                    ],
                    "pcis": [
                        "Environmental conservation:It is developed as the learner composes poems on pollution."
                    ],
                    "links_to_other_subjects": [
                        "The learner relates the study of poems to poetry in other learning areas such as Kiswahili and Creative arts and sports.",
                        "Question(s)"
                    ]
                },
                {
                    "substrand_number": "4.4.1",
                    "substrand_name": "Intensive Reading: Short story (Class Reader)",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify the characters in a short story",
                        "use contextual clues to infer character traits of the characters in a short story",
                        "acknowledge the role of characters in a short story"
                    ],
                    "suggested_learning_experiences": [
                        " with peers, read the short story and retell what they have read",
                        " describe the traits of the characters in the short story using different adjectives",
                        " compare and contrast the traits of the characters that appear in the short story",
                        " role play the different characters and discuss their importance in the short story",
                        " make connections between their own lives and those of characters in the text"
                    ],
                    "key_inquiry_questions": [
                        "What should one look for when reading a story?",
                        "What qualities do you admire in people?"
                    ],
                    "core_competencies": [
                        "Communication: It is developed as the learner discusses the character traits in the short story, thereby practising the skills of effective speaking.",
                        "Collaboration: It is enhanced as the learner works patiently with peers to role play different characters and discusses their importance."
                    ],
                    "values": [
                        "Responsibilty:It is fostered as the learner helps peers and appreciates their diversity during the group discussion."
                    ],
                    "pcis": [
                        "Peace education: It is promoted as the learner appreciates the different traits people possess."
                    ],
                    "links_to_other_subjects": [
                        "Religious Education requires a lot of character assessment and application.",
                        "Outcomes\tSuggested Learning Experiences\tSuggested Key"
                    ]
                },
                {
                    "substrand_number": "5.2.1",
                    "substrand_name": "Study Skills- Reference Materials",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "select relevant reference materials for varied tasks",
                        "use reference materials to obtain information on varied subjects",
                        "acknowledge the role of reference materials in lifelong learning"
                    ],
                    "suggested_learning_experiences": [
                        " pick out various words from print and digital texts",
                        " check the meanings and spellings of the words in a dictionary",
                        " work with peers to look for the synonyms of various words from a thesaurus",
                        " construct sentences using the given words",
                        " give the antonyms of those words",
                        " use an encyclopaedia to search for information on various topics",
                        " create crossword puzzles using the antonyms and synonyms learnt and share with peers for review"
                    ],
                    "key_inquiry_questions": [
                        "What is the importance of reference materials?",
                        "How can one use reference materials appropriately?"
                    ],
                    "core_competencies": [
                        "Self- efficacy: It is enhanced as the learner gathers information from different reference materials.",
                        "Collaboration: It is enhanced as the learner recognises the value of others’ ideas while searching for antonyms and synonyms."
                    ],
                    "values": [
                        "Respect: It is promoted as the learner appreciates others while reviewing their crossword puzzles on the antonyms and synonyms."
                    ],
                    "pcis": [
                        "Peaceful conflict resolution: Itis inculcated as the learner creates and shares with peers their crossword puzzles on antonyms and synonyms learnt, for review."
                    ],
                    "links_to_other_subjects": [
                        "The learner relates the concept of effective use of reference materials to library use in Pre-technical Studies."
                    ]
                },
                {
                    "substrand_number": "5.4.1",
                    "substrand_name": "Intensive Reading: Short story (Class Reader)",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify dialogue and repetition in a short story",
                        "explain the importance of repetition and dialogue in a short story",
                        "acknowledge the role of dialogue and repetition in fiction writing"
                    ],
                    "suggested_learning_experiences": [
                        " watch plays that have characters talking to one another and repeating certain lines or sentences from a digital device",
                        " read a short story and work with peers to retell what they have read",
                        " search online and offline for the importance of repetition and dialogue in a short story",
                        " discuss the message in the dialogue in a short story",
                        " role play a dialogue in the short story read",
                        " describe how the dialogues bring out the traits of the different speakers",
                        " make connections between their own lives and those of the characters in the short story",
                        " write a short paragraph on the theme of ‘peers’ using repetition and dialogue appropriately"
                    ],
                    "key_inquiry_questions": [
                        "What makes stories interesting to read?"
                    ],
                    "core_competencies": [
                        "Critical thinking and problem solving: It is enhanced as the learner discusses the relationship between characters in a short story in real life."
                    ],
                    "values": [
                        "Unity: It is promoted as the learner displays team spirit when role playing a dialogue in the short story read."
                    ],
                    "pcis": [
                        "Peace education: It is developed as the learner appreciates the opinion of their peers as they engage in dialogue."
                    ],
                    "links_to_other_subjects": [
                        "The learner relates the concepts learnt in literary works to learning literary works in Kiswahili."
                    ]
                },
                {
                    "substrand_number": "6.2.1",
                    "substrand_name": "Reading Fluency: Poem",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify techniques of reading fast",
                        "read a text accurately, with expression and at the right speed",
                        "apply fluency strategies when reading a text",
                        "appreciate the value of fluency in reading to enhance understanding"
                    ],
                    "suggested_learning_experiences": [
                        " preview a text before reading",
                        " skim a text to obtain the main idea",
                        " Scan a text to obtain specific details",
                        " ignore unknown words when reading a text",
                        " practice reading a text at the right speed while displaying the right feelings",
                        " pronounce words and sounds accurately",
                        " work with peers to engage in a reader’s theatre",
                        " recite the poems aloud in class",
                        " work with peers to download sample texts from the internet and read them"
                    ],
                    "key_inquiry_questions": [
                        "Why should we display appropriate expressions when reading a text?"
                    ],
                    "core_competencies": [
                        "Collaboration: It is enhanced as the learner recognises opinions of others while engaging in a reader’s theatre.",
                        "Self- efficacy: It is enhanced as the learner fluently reads given poems."
                    ],
                    "values": [
                        "Responsibility: It is enhanced as the learner engages in assigned roles and duties such as downloading sample texts."
                    ],
                    "pcis": [
                        "Effective communication: It is enriched as the learner perfects their reading skills."
                    ],
                    "links_to_other_subjects": [
                        "The learner relates reading fluency to reading in other languages such as Kiswahili.",
                        "Outcomes\tSuggested Learning Experiences\tSuggested Key"
                    ]
                },
                {
                    "substrand_number": "6.4.1",
                    "substrand_name": "Intensive Reading: short story (Class Reader)",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify the main ideas in the short story",
                        "summarise the key events in the short story",
                        "relate the main ideas in the short story to real life situations",
                        "appreciate the relevance of the short story in addressing real life issues"
                    ],
                    "suggested_learning_experiences": [
                        " read a prescribed section of the short story",
                        " discuss the storyline",
                        " present findings in a talking tree",
                        " summarise the main idea in the short story",
                        " act out a section of the short story, with peers"
                    ],
                    "key_inquiry_questions": [
                        "Why do people read short stories?"
                    ],
                    "core_competencies": [
                        "Learning to learn: It is enriched as the learner shares what they have learnt through a presentation."
                    ],
                    "values": [
                        "Unity: It is strengthened as the learner demonstrates team spirit while engaging in a group discussion on the storyline."
                    ],
                    "pcis": [
                        "Gender roles: These are underscored as the learner identifies gender roles highlighted in the short story and relates them to real life."
                    ],
                    "links_to_other_subjects": [
                        "Areas:",
                        "The learner relates the concepts in short stories to reading short stories in Kiswahili.",
                        "Suggested Learning Experiences\tSuggested Key Inquiry",
                        "Question(s)"
                    ]
                },
                {
                    "substrand_number": "7.2.1",
                    "substrand_name": "Intensive Reading: Visuals",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify different visuals in given contexts correctly",
                        "make a connection between visuals and the written text",
                        "interpret visuals correctly for meaning",
                        "appreciate the role of visuals in simplifying representation"
                    ],
                    "suggested_learning_experiences": [
                        " study information presented in optical illusions in print/ electronic devices and discuss findings",
                        " make inference of implied meaning from the visuals",
                        " work with peers to make connections of the visuals such as pictures, graphs, illustrations, charts and videos provided with written texts",
                        " write a summary of what has been viewed in the visuals which may depict human-wildlife conflict",
                        " present a piece of written information on wildlife in form of a visual and share in class"
                    ],
                    "key_inquiry_questions": [
                        "What information do we obtain from visuals?",
                        "How can one interpret a visual correctly?"
                    ],
                    "core_competencies": [
                        "Citizenship: It is fostered as the learner interacts with information from various visual materials on human wildlife conflict.",
                        "Learning to learn: It is enhanced as the learner works independently to make visuals in line with the theme of wildlife."
                    ],
                    "values": [
                        "Patriotism: It is promoted as the learner acquires knowledge on his or her environment while reading about the importance of wildlife."
                    ],
                    "pcis": [
                        "Environmental and social issues: These are promoted as the learner learns the importance of co-existing with wildlife."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to relate visuals as an aspect of learning in Pre- technical Studies",
                        "Outcomes\tSuggested Learning Experiences\tSuggested Key"
                    ]
                },
                {
                    "substrand_number": "7.4.1",
                    "substrand_name": "Intensive Reading: Short story (Class Reader)",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify the characters in a given short story",
                        "explain the relationship between the characters in the short story",
                        "appreciate the role of the characters in the short story in depicting real- life experiences"
                    ],
                    "suggested_learning_experiences": [
                        " read the short story and pick out the characters",
                        " discuss the things done by the characters in the short story",
                        " dramatise different characters in a short story in order to bring out their traits",
                        " distinguish between the main characters and the minor characters",
                        " work with peers to use relationship tree diagrams, character map or any other diagrammatic tool to show how the characters relate to each other",
                        " display the tree diagram via power point or manila paper in class"
                    ],
                    "key_inquiry_questions": [
                        "How does one identify qualities of characters in a short story?"
                    ],
                    "core_competencies": [
                        "Critical thinking: It is enhanced as the learner uses logical reasoning while discussing the actions of the characters.",
                        "Creativity and imagination:It is enhanced as the learner shows the relationships between characters in the story."
                    ],
                    "values": [
                        "Responsibility: It is promoted as the learner engages and helps peers as they work in groups."
                    ],
                    "pcis": [
                        "Social cohesion: This is promoted as the learner observes the rules of engagement while dramatising different characters in a short story."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to relate the concept of characterisation to character analysis in Religious studies.",
                        "Outcomes\tSuggested Learning Experiences\tSuggested Key"
                    ]
                },
                {
                    "substrand_number": "8.2.1",
                    "substrand_name": "Intensive Reading: Poem",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "select required information from a text",
                        "use nonverbal cues to bring out the message in a poem",
                        "make judgement on the information in a text",
                        "infer the meaning of unfamiliar words using contextual clues",
                        "acknowledge the importance comprehension in life"
                    ],
                    "suggested_learning_experiences": [
                        " identify the characters, themes and aspects of style such as repetition from a poem",
                        " infer the meaning of words from the context",
                        " use visuals, synonyms, antonyms among others to infer the meaning of words",
                        " rap/recite the poem in turns using relevant non-verbal cues",
                        " answer direct and inferential questions based on the poem",
                        " retell events depicted in the poem in own words",
                        " make evidence supported judgements about the events and the message in a poem",
                        " conduct debates based on the poem elaborating on what you like or do not like about the poem",
                        " use prior experience and previous knowledge when giving an opinion"
                    ],
                    "key_inquiry_questions": [
                        "How can one tell the meaning of unfamiliar words used in a text?",
                        "Why should one support an opinion about a story or person with evidence?"
                    ],
                    "core_competencies": [
                        "Learning to learn: It is promoted as the learner asks for clarification while inferring meanings of words from contexts."
                    ],
                    "values": [
                        "Respect: It is promoted as the learner participates in discussions in pairs or groups and debates issues based on a poem."
                    ],
                    "pcis": [
                        "Effective communication: It is enhanced as the learner conducts debates based on a poem during club meetings."
                    ],
                    "links_to_other_subjects": [
                        "Areas:",
                        "The learner links the study of poems to poetry in Kiswahili."
                    ]
                },
                {
                    "substrand_number": "8.4.1",
                    "substrand_name": "Intensive Reading: Poetry",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify inanimate characters in a given poem",
                        "describe traits of inanimate characters present in a given poem",
                        "appreciate the role of inanimate characters in poetry"
                    ],
                    "suggested_learning_experiences": [
                        " find out the meaning of inanimate characters from print and digital texts",
                        " identify inanimate characters in a poem",
                        " discuss the likely inanimate characters in a poem and their traits",
                        " recite a poem related to the theme using appropriate non-verbal cues",
                        " role play an inanimate character in a given poem",
                        " relate inanimate characters with individuals in real life"
                    ],
                    "key_inquiry_questions": [
                        "How do you describe the characters in a poem?",
                        "Why are the characters in a poem important?"
                    ],
                    "core_competencies": [
                        "Critical thinking: It is enhanced as the learner makes decisions while looking for information about inanimate characters.",
                        "Creativity and imagination: It is developed as learner discusses new ways of doing things when role playing inanimate characters."
                    ],
                    "values": [
                        "Respect: It is promoted through collaborative group tasks"
                    ],
                    "pcis": [
                        "Health education awareness on HIV and AIDS: It is created as learner reads a poem on the same"
                    ],
                    "links_to_other_subjects": [
                        "Areas:",
                        "The learner is able to relate the aspects of poetry learnt to their learning in Kiswahili."
                    ]
                },
                {
                    "substrand_number": "9.2.1",
                    "substrand_name": "Extensive Reading: Grade appropriate fiction Materials - Characters",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify the characters in a given fiction text",
                        "describe the traits of a given character in a fictional text",
                        "appreciate the role of characters in fiction"
                    ],
                    "suggested_learning_experiences": [
                        " search online and offline for words that can be used to describe character traits",
                        " read a given fiction material on African heroes/heroines and list the characters in the text",
                        " role play the different characters identified",
                        " dramatise the text and video record the performance",
                        " choose a character and discuss what the character does or says",
                        " use flash cards to describe the traits of the given character",
                        " work with peers to relate the characters in the fiction text to real life",
                        " identify the character that they like most and explain why"
                    ],
                    "key_inquiry_questions": [
                        "What makes reading enjoyable?",
                        "How can the characters in a story be described?",
                        "Which stories are the most enjoyable to read?"
                    ],
                    "core_competencies": [
                        "Creativity and imagination: It is developed and networking is enhanced as the learner role plays different characters.",
                        "Digital literacy: It is developed as the learner searches online and video record their performances using their digital devices."
                    ],
                    "values": [
                        "Social justice: Reading on African heroes/ heroines makes the learner understand issues that Africa as a continent is exposed to"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": [
                        "The theme of African heroes/ heroines is handled in Social Studies."
                    ]
                },
                {
                    "substrand_number": "9.4.1",
                    "substrand_name": "Intensive Reading: Similes and metaphors",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "list the similes and metaphors in a given short story",
                        "use similes and metaphors in their own sentences",
                        "explain the similes and metaphors used in the short story",
                        "acknowledge the importance of similes and metaphors in communication"
                    ],
                    "suggested_learning_experiences": [
                        " search online and offline for meanings of simile and metaphor",
                        " read a given short story and identify the similes and metaphors present",
                        " discuss the meanings of the similes and metaphors identified",
                        " discuss the relevance of the similes and metaphors in the short story",
                        " list the similes and metaphors they know",
                        " construct sentences using the similes and metaphors in the context of African heroes and heroines"
                    ],
                    "key_inquiry_questions": [
                        "What makes short stories interesting?",
                        "Why should short stories be read?",
                        "How can one write a short story?"
                    ],
                    "core_competencies": [
                        "Citizenship: National and cultural identity is enhanced as the learner uses metaphors and similes in the context of African heroes:",
                        "Collaboration: Team work is enhanced as the learner respects the opinion of others while contributing to group discussions on similes and metaphors."
                    ],
                    "values": [
                        "Respect: Discussion on heroes and heroines inculcates respect for the citizens of the different countries."
                    ],
                    "pcis": [
                        "Citizenship education (Patriotism): Constructing sentences in the context of African heroes and heroines makes the learner identify with Africa."
                    ],
                    "links_to_other_subjects": [
                        "The concept of metaphors and similes is relevant to the learning of stylistic devices in Kiswahili.",
                        "Outcomes\tSuggested Learning Experiences\tSuggested Key"
                    ]
                },
                {
                    "substrand_number": "10.2.1",
                    "substrand_name": "Study Skills: Note Making",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify key points in a text",
                        "make notes from a written text",
                        "appreciate the importance of note making in learning"
                    ],
                    "suggested_learning_experiences": [
                        " work with peers to search online and offline on how to make notes",
                        " read a given text on art and identify the key points",
                        " identify verbal sign posts and share with peers",
                        " make notes on the margin and peer review",
                        " paraphrase the writer’s words",
                        " create own abbreviations and display on a chart",
                        " jot down any ideas that a writer repeats",
                        " discuss some of the words that are used to introduce key points in a piece of writing",
                        " rewrite or re-read their notes and reorganize into categories"
                    ],
                    "key_inquiry_questions": [
                        "How do we determine what to include in our notes during note making?",
                        "What is the importance of note making?"
                    ],
                    "core_competencies": [
                        "Digital literacy: It is enhanced as the learner interacts with technology as they use electronic devices to get information.",
                        "Communication and collaboration: It is enhanced as the learner collaborates with peers to discuss words used in writing."
                    ],
                    "values": [
                        "Respect: It is promoted as the learner demonstrates patience while working with peers to search online and offline on how to make notes."
                    ],
                    "pcis": [
                        "Mentorship: It is promoted as reading a text on Art helps learners identify some careers related to art."
                    ],
                    "links_to_other_subjects": [
                        "Note making skills are invaluable in all subjects as it is part of the array of study skills necessary across the board."
                    ]
                },
                {
                    "substrand_number": "10.4.1",
                    "substrand_name": "Intensive Reading: Short story (Class Reader)",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "highlight the main events in the story",
                        "relate the events in the short story to real life",
                        "identify the setting in the short story",
                        "appreciate the importance of literature in life"
                    ],
                    "suggested_learning_experiences": [
                        " read a given short story",
                        " discuss with peers the main events",
                        " use a graphic organizer to highlight the events in the story",
                        " research the meaning of setting from online and offline sources and make notes",
                        " discuss the setting of the short story they have read",
                        " work with peers to discuss how the events in the short story relate to real life"
                    ],
                    "key_inquiry_questions": [
                        "How do events flow logically in a story?",
                        "Why is the setting of a story important to the reader?"
                    ],
                    "core_competencies": [
                        "Communication and collaboration: It is enhanced as the learner discusses with peers the main events and how they relate to real life.",
                        "Creativity and imagination: It is enhanced as the learner uses a graphic organizer to highlight the events in the story."
                    ],
                    "values": [
                        "Unity: It is promoted as the learner displays team spirit while working with peers to discuss how the events in the short story relate to real life."
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "11.2.1",
                    "substrand_name": "Extensive Reading: Non- fiction",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify print and non- print non-fiction materials that are interesting to read",
                        "read a range of non- fiction materials for general information",
                        "appreciate the importance of reading for information"
                    ],
                    "suggested_learning_experiences": [
                        " skim through print and electronic reading materials on careers",
                        " discuss the general ideas with peers",
                        " scan print and electronic reading materials and identify key words and phrases",
                        " use a dictionary to look up the meaning of vocabulary acquired during independent reading",
                        " read various texts on risky behaviour by road users and note the key points",
                        " share with peers what he or she has read about What do"
                    ],
                    "key_inquiry_questions": [
                        "What is the importance of reading widely?",
                        "you consider when selecting a reading text?"
                    ],
                    "core_competencies": [
                        "Self-efficacy: It is enhanced as the learner selects reading materials to enhance their ability to make decisions.",
                        "Learning to learn: It is achieved as the learner manages time while silently and reading varied materials."
                    ],
                    "values": [
                        "Responsibility: It is promoted as the learner engages in the selection of reading material."
                    ],
                    "pcis": [
                        "Life Skills education: It is promoted as the learner applies decision making skills while choosing materials to read extensively."
                    ],
                    "links_to_other_subjects": [
                        "The skill of extensive reading is relevant in all subjects including Integrated Science and Pre-Technical Studies.",
                        "Outcomes",
                        "Suggested Learning Experiences\tSuggested Key"
                    ]
                },
                {
                    "substrand_number": "11.4.1",
                    "substrand_name": "Intensive Reading: Lessons Learnt (Class Reader)",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify the lessons learnt in a short story",
                        "relate the lessons learnt in the short story to real life",
                        "appreciate the role of stories in addressing societal issues"
                    ],
                    "suggested_learning_experiences": [
                        " listen or watch a story and identify moral lessons that are brought out from a digital device",
                        " read the short story and retell what they have read",
                        " discuss the lessons learnt by looking at the actions and the words used in the story, with peers",
                        " discuss how different characters bring out the lessons",
                        " role play the episodes that carry the main lessons in the short story",
                        " make connections between situations in their own lives and the episodes in the text",
                        " use the lessons learnt to write a composition and share it with peers"
                    ],
                    "key_inquiry_questions": [
                        "What issues in the society are addressed by stories?",
                        "How can one derive lessons from a short story?"
                    ],
                    "core_competencies": [
                        "Creativity and imagination: It is developed as the learner relates lessons from the short stories to their own lives.",
                        "Collaboration: It is promoted as the learner participates in role plays to enhance their team work skills.",
                        "Pertinent and Contemporary Issues (PCIs):",
                        "Patriotism and good governance: These are promoted as the learner endeavours to make better their world using the lessons learnt."
                    ],
                    "values": [],
                    "pcis": [
                        "Patriotism and good governance: These are promoted as the learner endeavours to make better their world using the lessons learnt.",
                        "Values:",
                        "Unity: It is achieved as the learner displays team spirit when working with peers to unpack lessons in the short stories."
                    ],
                    "links_to_other_subjects": [
                        "The concept of making connections between situations in their own lives and the episodes in the text is relevant in performance of texts in Creative arts and sports and sports"
                    ]
                },
                {
                    "substrand_number": "12.2.1",
                    "substrand_name": "Intensive Reading: Comprehension Strategies",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "12.4.1",
                    "substrand_name": ": Short Story: Characters (Class Reader)",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "13.2.1",
                    "substrand_name": "Intensive Reading: Comprehension strategies",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "a)\tidentify the key points in a passage,",
                        "b)\tcreate mental images of the characters, places and events in the text,",
                        "c)\tsummarise the key points in the text,",
                        "d)\tappreciate the role of reading in lifelong learning."
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "13.4.1",
                    "substrand_name": "Short Story: Style (Class Reader)",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "a)\tidentify personification and flashback in a short story,",
                        "b)\tread and dramatise selected parts of a short story featuring personification and flashback,",
                        "c)\tappreciate the creative use of language in short stories."
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [
                        "story.\t1.\tHow does a writer make a story interesting?",
                        "Which qualities of a person can be given to animals?"
                    ],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "14.2.1",
                    "substrand_name": "Study Skills",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "14.4.1",
                    "substrand_name": "Extensive reading: Short story (Class Reader)",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "a)\tidentify the ideas in the short story,",
                        "b)\trelate the ideas from the short story to real life experiences,",
                        "c)\tappreciate the value of short stories in reflecting social issues."
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [
                        "life experiences.\t1.\tWhere does a writer get what to write about?",
                        "How are stories related to what happens in real life?"
                    ],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "15.2.1",
                    "substrand_name": "Reading Fluency",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "15.4.1",
                    "substrand_name": "Poems",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                }
            ]
        },
        {
            "strand_number": "3.0",
            "strand_name": "Grammar",
            "substrands": [
                {
                    "substrand_number": "1.3.1",
                    "substrand_name": "Word classes: Compound Nouns",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify compound nouns in a text",
                        "use compound nouns in their singular and plural forms",
                        "appreciate the importance of compound nouns in communication"
                    ],
                    "suggested_learning_experiences": [
                        " listen to an audio recording on human rights",
                        " identify the compound nouns used in the text",
                        " work with peers to categorise compound nouns into two-word or three-word nouns from a given list",
                        " form separate and hyphenated compound nouns by combining two or more words",
                        " form plurals of compound nouns from a completion table",
                        " write sentences using compound nouns in their singular and plural forms",
                        " search online and offline for more examples of compound nouns",
                        " use compound nouns to form sentences from a substitution table",
                        " assess the correctness of the sentences with peers"
                    ],
                    "key_inquiry_questions": [
                        "Why should we use compound nouns when communicating?"
                    ],
                    "core_competencies": [
                        "Communication and collaboration: It is enhanced as the learner work with peers categorise compound nouns",
                        "Self-efficacy: It is enhanced as the learner shows concerted attention to detail when forming separate and hyphenated compound nouns by combining two or more words.",
                        "Learning to learn: It is enhanced as the learner engages in self- driven tasks while using compound nouns in sentences."
                    ],
                    "values": [
                        "Respect: It is promoted as the learner displays patience while working with peers to identify the compound nouns in the text."
                    ],
                    "pcis": [
                        "Effective communication: It is boosted as the learner communicates using the newly acquired compound nouns."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to relate the use of compound nouns in learning similar concept in other languages such as Kiswahili.",
                        "Outcomes\tSuggested Learning Experiences\tSuggested Key"
                    ]
                },
                {
                    "substrand_number": "2.3.1",
                    "substrand_name": "Word classes: Collective Nouns.",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify collective nouns from a text",
                        "use singular and plural forms of collective nouns correctly in sentences",
                        "appreciate the importance of collective nouns in communication"
                    ],
                    "suggested_learning_experiences": [
                        " list the collective nouns as they listen to an audio text",
                        " identify collective nouns in a print text",
                        " classify collective nouns according to people, animals or things",
                        " discuss the plural forms of these nouns",
                        " write correct sentences using collective nouns from substitution tables",
                        " fill in blank spaces using the correct collective nouns",
                        " fill in crossword puzzles using collective nouns",
                        " search for more examples of collective nouns from print or non- print text",
                        " collaborate to construct sentences using the collective nouns they have identified"
                    ],
                    "key_inquiry_questions": [
                        "How do collective nouns form their plurals?"
                    ],
                    "core_competencies": [
                        "Learning to learn: It is enhanced as the learner shares what they have learnt while discussing plural forms of collective nouns.",
                        "Communication and collaboration: It is developed as the learner contributes to group decision making while constructing sentences with peers."
                    ],
                    "values": [
                        "Unity: It is developed as the learner collaborates with peers to construct sentences using the collective nouns they have identified.",
                        "Respect: It is developed as the learner appreciates the capabilities of others as they work in groups."
                    ],
                    "pcis": [
                        "Effective communication: This is enhanced as the learner uses collective nouns correctly."
                    ],
                    "links_to_other_subjects": [
                        "The learner relates the learning of compound nouns to learning similar concepts in Kiswahili."
                    ]
                },
                {
                    "substrand_number": "3.3.1",
                    "substrand_name": "Word Classes: Primary Auxiliaries",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify primary auxiliary verbs in a text",
                        "use primary auxiliary verbs in sentences correctly",
                        "appreciate the importance of primary auxiliary verbs in communication"
                    ],
                    "suggested_learning_experiences": [
                        " identify primary auxiliary verbs from a text",
                        " search for the functions of primary auxiliary verbs from the internet or text books",
                        " individually write down sentences using each of the primary auxiliary verbs identified",
                        " collaborate to write a short paragraph on environmental conservation using primary auxiliary verbs",
                        " read out the paragraphs to the rest of the class",
                        " fill in blank spaces in sentences given using the correct form of the primary auxiliary verbs",
                        " engage in a question and answer session using primary auxiliary verbs"
                    ],
                    "key_inquiry_questions": [
                        "What are the functions of verbs in sentences?"
                    ],
                    "core_competencies": [
                        "Digital literacy: It is promoted as the learner uses digital devices to search for information from the internet.",
                        "Self-efficacy: It is affirmed as the learner’s confidence is boosted by using correct tenses in speech."
                    ],
                    "values": [
                        "Respect: It is enhanced as the learner helps peers in constructing sentences correctly."
                    ],
                    "pcis": [
                        "Environmental education awareness: It is enhanced as the learner writes a paragraph on environmental conservation."
                    ],
                    "links_to_other_subjects": [
                        "Areas:",
                        "The learner relates the concept of verbs to the learning of verbs in Kiswahili."
                    ]
                },
                {
                    "substrand_number": "4.3.1",
                    "substrand_name": "Verbs and Tense",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify verbs in the simple present and simple past tense in a text",
                        "write sentences using the simple present tense",
                        "write sentences using the simple past tense",
                        "advocate for appropriate use of tense in communication"
                    ],
                    "suggested_learning_experiences": [
                        " underline verbs in simple present and simple past tense in a text on consumer rights and responsibilities",
                        " reflect on the formation of simple present and simple past tense form of verbs",
                        " construct and share sentences on a variety of issues including consumer rights and responsibilities",
                        " type the constructed sentences using a digital device or write them down in their exercise books",
                        " search online or offline for verbs used in simple present and simple past tense from texts on consumer rights and responsibilities",
                        " complete sentences using the correct tense of the given verbs",
                        " create and display charts showing words in their simple present and past tense forms",
                        " play language games using verbs in the present and past tense"
                    ],
                    "key_inquiry_questions": [
                        "Why is correct use of tense important?"
                    ],
                    "core_competencies": [
                        "Self-efficacy: It is achieved as the learner builds on their learning experiences when constructing grammatically correct sentences."
                    ],
                    "values": [
                        "Integrity: It is achieved as the learner constructs sentences on consumer rights and responsibilities."
                    ],
                    "pcis": [
                        "Effective communication skills: They are achieved as the learner uses appropriate tense in constructing sentences on consumer roles and responsibilites.",
                        "Consumer literacy: It is enhanced as the learner constructs sentences on consumer rights and responsibilities."
                    ],
                    "links_to_other_subjects": [
                        "Areas:",
                        "The learner relates the skills acquired when learning about tenses in Kiswahili."
                    ]
                },
                {
                    "substrand_number": "5.3.1",
                    "substrand_name": "Word Classes: adjectives",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify gradable and non- gradable adjectives from a text",
                        "use gradable and the non- gradable adjectives in sentences",
                        "value the need for correct use of adjectives in communication"
                    ],
                    "suggested_learning_experiences": [
                        " search for and identify gradable and non- gradable adjectives from digital and print texts",
                        " complete sentences on adjectives from a substitution table",
                        " recite a poem featuring gradable and non-gradable adjectives",
                        " construct sentences using gradable and non-gradable adjectives, with peers",
                        " work with peers to fill crossword puzzles featuring gradable and non-gradable adjectives"
                    ],
                    "key_inquiry_questions": [
                        "When is it necessary to describe a noun?"
                    ],
                    "core_competencies": [
                        "Learning to learn: It is enhanced as the learner uses gradable and non-gradable adjectives correctly."
                    ],
                    "values": [
                        "Respect: It is enhanced as the learner displays humility when working with peers to fill crossword puzzles featuring gradable and non-gradable adjectives."
                    ],
                    "pcis": [
                        "Effective communication: It is developed as the learner makes sentences using gradable and non-gradable adjectives."
                    ],
                    "links_to_other_subjects": [
                        "Areas:",
                        "The learner relates the concept of Gradable and non- gradable adjectives in learning other languages such as Kiswahili."
                    ]
                },
                {
                    "substrand_number": "6.3.1",
                    "substrand_name": "Word Classes: Adverbs",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify adverbs of frequency and degree correctly from a text",
                        "use adverbs of frequency and degree correctly in sentences",
                        "appreciate the importance of using adverbs correctly in communication"
                    ],
                    "suggested_learning_experiences": [
                        " watch a short video and pick out the adverbs of frequency and degree used by the speakers",
                        " identify the adverbs of frequency and degree from a text",
                        " construct sentences using adverbs of frequency and degree",
                        " hold conversations using the adverbs of frequency and degree",
                        " fill in crossword puzzles",
                        " search online for more examples of adverbs of frequency and degree"
                    ],
                    "key_inquiry_questions": [
                        "Why should one use adverbs correctly?"
                    ],
                    "core_competencies": [
                        "Imagination and creativity: It is sharpened as the learner constructs correct sentences using adverbs."
                    ],
                    "values": [
                        "Respect: It is enhanced as the learner learns to value human dignity while helping peers to construct sentences correctly."
                    ],
                    "pcis": [
                        "Effective communication: It is enhanced as the learner uses adverbs of frequency and degree in the spoken and written contexts."
                    ],
                    "links_to_other_subjects": [
                        "Areas:",
                        "The learner relates the concept of adverbs to the learning of word classes in Kiswahili."
                    ]
                },
                {
                    "substrand_number": "7.3.1",
                    "substrand_name": "Word Classes: Pronouns",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify indefinite and reflexive pronouns correctly",
                        "use indefinite and reflexive pronouns in sentences correctly",
                        "appreciate the role of indefinite and reflexive pronouns in communication"
                    ],
                    "suggested_learning_experiences": [
                        " study a chart displaying the indefinite and reflexive pronouns to distinguish between them",
                        " listen to an audio on wildlife from a digital device and write down the indefinite and reflexive pronouns from the audio text",
                        " collaborate to construct sentences using indefinite and reflexive pronouns",
                        " choose an appropriate indefinite and reflexive pronoun to fill in gaps in given sentences",
                        " construct correct sentences using reflexive and indefinite pronouns from a substitution table"
                    ],
                    "key_inquiry_questions": [
                        "What are indefinite and reflexive pronouns?",
                        "Why do we use indefinite pronouns?"
                    ],
                    "core_competencies": [
                        "Citizenship: It is promoted as the learner listens to a text on wildlife resources hence caring for others and the environment.",
                        "Critical thinking and problem solving: It is enhanced as the learner constructs sentences using indefinite and reflexive pronouns."
                    ],
                    "values": [
                        "Respect: It is promoted as learners work in groups and respect each other’s opinions while constructing sentences using indefinite and reflexive pronouns."
                    ],
                    "pcis": [
                        "Environmental and social issues on animal welfare: These are promoted as the learner listens to videos on wildlife."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to relate the use of pronouns to other languages such as Kiswahili.",
                        "Outcomes\tSuggested Learning Experiences\tSuggested Key"
                    ]
                },
                {
                    "substrand_number": "8.3.1",
                    "substrand_name": "Word Classes: Simple prepositions",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify prepositions of position, time and place correctly",
                        "use prepositions of position, time and place in sentences correctly",
                        "appreciate the role of prepositions of position, place and time in communication"
                    ],
                    "suggested_learning_experiences": [
                        " identify the prepositions of position, place and time from print or digital texts",
                        " construct sentences using prepositions of position, place and time and display on charts",
                        " fill in gaps in given sentences using of prepositions of position, time and place",
                        " search for sentences featuring simple prepositions from newspapers, magazines and the internet",
                        " create crossword puzzles using simple prepositions, with peers"
                    ],
                    "key_inquiry_questions": [
                        "How do we show where a person or thing is?",
                        "How do you show the position of a thing or the time something happens?"
                    ],
                    "core_competencies": [
                        "Learning to learn: It is enhanced as the learner builds on their knowledge of simple prepositions to express themselves clearly.",
                        "Creativity and imagination: It is enhanced as the learner explores new ideas while creating a crossword puzzle using simple prepositions."
                    ],
                    "values": [
                        "Respect: This is developed as the learner demonstrates patience while creating crossword puzzles using simple prepositions,",
                        "with peers."
                    ],
                    "pcis": [
                        "Citizenship education- Ethnic relations is enhanced as the learner participates in group activities."
                    ],
                    "links_to_other_subjects": [
                        "Areas:",
                        "The learning of correct use of prepositions is important when making presentations in learning areas such as Integrated Science.",
                        "Outcomes\tSuggested Learning Experiences\tSuggested Key"
                    ]
                },
                {
                    "substrand_number": "9.3.1",
                    "substrand_name": "Word Classes: Conjunctions – because, that, when, if, unless, and since",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify the listed conjunctions from a group of words",
                        "use the listed conjunctions correctly in sentences",
                        "appreciate the correct use of conjunctions in communication"
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [],
                    "core_competencies": [
                        "Collaboration: It is enhanced as the learner recites poems with peers.",
                        "Creativity and imagination: It is developed as the learner makes connections and creates posters on heroes or heroines."
                    ],
                    "values": [
                        "Patriotism: It is promoted as the learner creates posters of African heroes and heroines and this makes them proud of their nation"
                    ],
                    "pcis": [
                        "Citizenship: Good governance is promoted as some African heroes’ and heroines’ stories address issues of governance"
                    ],
                    "links_to_other_subjects": [
                        "The concepts of creating posters is related to the strand of creating in Creative arts and sports."
                    ]
                },
                {
                    "substrand_number": "10.3.1",
                    "substrand_name": "Word Classes: Demonstratives and Quantifiers",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify demonstratives and quantifiers in a given text",
                        "use demonstratives in sentences for clarity of communication",
                        "appreciate the importance of demonstratives and quantifiers communication"
                    ],
                    "suggested_learning_experiences": [
                        " identify quantifiers (few and many) and demonstratives (this, these and that and those)",
                        " point out various items that are at different distances",
                        " determine the correct demonstratives to use in different circumstances",
                        " generate the plural forms of the demonstrative pronouns, with peers",
                        " demonstrate practically the differences in meaning in quantifiers such as little and a little amount of water",
                        " generate sentences using various demonstratives and quantifiers",
                        " construct sentences using demonstrative and quantifiers from a substitution table"
                    ],
                    "key_inquiry_questions": [
                        "Why do we use demonstratives and quantifiers?",
                        "When do we use demonstratives and quantifiers?"
                    ],
                    "core_competencies": [
                        "Communication and collaboration: It is promoted as the learner works in a team to generate the plural forms of the",
                        "demonstrative pronouns, with peers.",
                        "Self-efficacy: It is developed as the learner practices the correct use of demonstratives and quantifiers."
                    ],
                    "values": [
                        "Love: It is exhibited through care and compassion as the learner works with peers to generate the plural forms of the demonstrative pronouns."
                    ],
                    "pcis": [
                        "Critical thinking: It is enhanced as the learner uses logical thinking selects the correct demonstratives and quantifiers to use in different contexts."
                    ],
                    "links_to_other_subjects": [
                        "Determiners and quantifiers are concepts that are related to learning of word classes in Kiswahili.",
                        "Outcomes\tSuggested Learning Experiences\tSuggested Key"
                    ]
                },
                {
                    "substrand_number": "11.3.1",
                    "substrand_name": "Word Classes: Adverbs",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify adverbs formed from adjectives in sentences or a group of words",
                        "form adverbs from adjectives",
                        "use adverbs formed from adjectives in sentences",
                        "appreciate the value of adverbs in communication"
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [],
                    "core_competencies": [
                        "Self-efficacy: It is enhanced as the learner shows concerted attention to detail when forming adverbs from adjectives .",
                        "Critical thinking: It is developed as the learner cultivates the skills of reasoning when using adverbs in sentences."
                    ],
                    "values": [
                        "Responsibility: It is promoted as the learner demonstrates accountabilty when selecting adverbs from digital devices."
                    ],
                    "pcis": [
                        "Decision making skills: These are achieved as the learner makes decisions on adverbs to use in speech and writing."
                    ],
                    "links_to_other_subjects": [
                        "Word formation is relevant in vocabulary buiding skills in Kiswahili."
                    ]
                },
                {
                    "substrand_number": "12.3.1",
                    "substrand_name": "Phrasal Verbs",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "a)\tidentify phrasal verbs correctly in a text,",
                        "b)\tuse the phrasal verbs correctly in sentences,",
                        "c)\tacknowledge the role of phrasal verbs in making conversations interesting."
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [
                        "the given phrasal verbs, with peers.\t1.\tHow are phrasal verbs formed?",
                        "How can one tell the meaning of a phrasal verb?"
                    ],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "13.3.1",
                    "substrand_name": "Word Classes: Compound Sentences",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "14.3.1",
                    "substrand_name": "Sentences: Active and Passive Voice",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "a)\tidentify sentences in the active and passive voice,",
                        "b)\ttransform sentences from active to passive voice and vice versa,",
                        "c)\tconstruct sentences in the active and passive voice,",
                        "d)\tappreciate the use of active and passive voice in effective communication."
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [
                        "sentences.\t1.\tWhy should one use a variety of sentences?",
                        "How can one tell the doer and the receiver of an action in a sentence?"
                    ],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "15.3.1",
                    "substrand_name": "Types of Sentences: Interrogative sentences",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "a)\tidentify interrogative sentences and question tags from a text,",
                        "b)\tuse interrogative sentences and question tags in varied contexts,",
                        "c)\tappreciate the role of correctly framed questions in communication."
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [
                        "interrogatives.\t1.\tHow do we ask questions?",
                        "How do we answer questions?"
                    ],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                }
            ]
        },
        {
            "strand_number": "4.0",
            "strand_name": "Writing",
            "substrands": [
                {
                    "substrand_number": "1.5.1",
                    "substrand_name": "Writing legibly and neatly",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "classify letters according to height differentials",
                        "write a text, legibly and neatly",
                        "advocate the need for legibility and neatness in writing"
                    ],
                    "suggested_learning_experiences": [
                        " copy a provided passage and shape upper and lower case lettters appropriately",
                        " copy a provided passage and space letters, words and sentences correctly",
                        " rewrite a provided text legibly and neatly",
                        " cancel words or sentences neatly when composing a text",
                        " split words that are joined appropriately",
                        " write dictated sentences legibly and neatly",
                        " write a narrative composition on human rights legibly and neatly",
                        " cancel neatly upon making mistakes as they listen to the excerpt that is dictated"
                    ],
                    "key_inquiry_questions": [
                        "Why should one write legibly and neatly?",
                        "What are the qualities of a good handwriting?"
                    ],
                    "core_competencies": [
                        "Learning to learn: It is enhanced as the learner completes tasks on time as he writes texts legibly and neatly.",
                        "Self-efficacy: It is enhanced as the learner’s confidence in written communication is boosted."
                    ],
                    "values": [
                        "Responsibility: This is enhanced as the learner legibly and neatly writes words and sentences related to human rights."
                    ],
                    "pcis": [
                        "Effective communication: It is improved as the learner practises writing legibly and neatly."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to apply the skill of writing neatly and legibly while writing essays in Religious Education."
                    ]
                },
                {
                    "substrand_number": "2.5.1",
                    "substrand_name": "Mechanics of Writing: Punctuation",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "punctuate a given text using commas, apostrophes, and capital letters correctly",
                        "use an apostrophe, commas and capital letters appropriately in composition writing",
                        "advocate the use of correct punctuation in writing"
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [],
                    "core_competencies": [
                        "Self-efficacy:It is developed as the learner gains confidence to use punctuation marks correctly in speech and in writing.",
                        "Critical thinking and problem solving: It is enhanced as the learner figures out when to use a comma, appostrophe and capital letter."
                    ],
                    "values": [
                        "Respect: It is inculcated as the learner assesses peers’ work  while tolerating any errors of punctuation."
                    ],
                    "pcis": [
                        "Decision making skills: They are enhanced as the learner decides on what and where to punctuate correctly in writing."
                    ],
                    "links_to_other_subjects": [
                        "The learner relates correct use of commas, apostrophes and capital letters in written work in subjects such as Agriculture ."
                    ]
                },
                {
                    "substrand_number": "3.5.1",
                    "substrand_name": "Paragraphing: Sequencing of Ideas",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify conjunctions used in a well formed paragraph",
                        "use conjunctions to sequence and connect ideas correctly in a paragraph",
                        "appreciate the role of conjunctions in communication"
                    ],
                    "suggested_learning_experiences": [
                        " look for conjuctions and their funtions in their immediate context from print and non-print text",
                        " read paragraphs that use conjunctions to sequence ideas from a book or online source",
                        " combine sentences to form paragraphs using appropriate conjunctions",
                        " rearrange jumbled sentences to form a cohesive paragraph using conjunctions",
                        " use different conjunctions in a composition to show sequence of ideas"
                    ],
                    "key_inquiry_questions": [
                        "Why is it important to use conjunctions in writing?"
                    ],
                    "core_competencies": [
                        "Creativity and imagination: It is developed as the learner connects ideas creatively and sequentially in composition writing.",
                        "Problem solving:It is achieved as the learner attempts to solve problems while forming paragraphs using conjunctions."
                    ],
                    "values": [
                        "Unity: This is enriched as the learner works patiently with peers to identify conjunctions in paragraphs."
                    ],
                    "pcis": [
                        "Critical and creative thinking skills: These are advanced as the learner practises connecting ideas logically in writing."
                    ],
                    "links_to_other_subjects": [
                        "Areas:",
                        "The learner relates the learning of conjuctions to their learning in Kiswahili."
                    ]
                },
                {
                    "substrand_number": "4.5.1",
                    "substrand_name": "Paragraphing: Connectors of sequence",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify connectors of sequence from a given text",
                        "sequence ideas in a given paragraph",
                        "appreciate the use of idea connectors for clarity in communication"
                    ],
                    "suggested_learning_experiences": [
                        " read a given text on consumer rights and responsibilities and identify the connectors of sequence used",
                        " search online and offline and list other connectors of sequence",
                        " with peers, construct sentences using the listed connectors of sequence",
                        " write paragraphs on consumer rights and responsibilities using connctors of sequence",
                        " read the paragraphs to their peers and discuss the use of the connectors",
                        " collaborate to edit the paragraphs and peer review each other’s work"
                    ],
                    "key_inquiry_questions": [
                        "How can a good paragraph be developed?"
                    ],
                    "core_competencies": [
                        "Creativity and imagination: It is enhanced as the learner undertakes artistic expression while writing paragraphs using connectors of sequence."
                    ],
                    "values": [
                        "Patriotism: It is enhanced as the learner is made aware of responsibilities in the society as they develop paragraphs on consumer",
                        "rights and good consumer practices."
                    ],
                    "pcis": [
                        "Effective communication: It is enhanced as the learner constructs sentences and write paragraphs using connectors of sequence."
                    ],
                    "links_to_other_subjects": [
                        "Areas:",
                        "The learner relates the skill of paragraphing to the writing of essays in Religious Education."
                    ]
                },
                {
                    "substrand_number": "5.5.1",
                    "substrand_name": "Functional Writing: Apology Letters",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "list the parts of a letter of apology",
                        "write a letter of apology based on a given context",
                        "acknowledge the role of letter writing in communication"
                    ],
                    "suggested_learning_experiences": [
                        " search online and offline for parts of a letter of apology",
                        " listen to two conversations: one that constitutes an apology and another that doesn’t, from a digital device",
                        " discuss what makes the two conversations different",
                        " read through a letter of apology and identify the different parts",
                        " discuss the language and content of a letter of apology",
                        " search for sample letters of apology from the internet, newspapers, magazines or books",
                        " use the elements and layout of a formal letter plan and individually write a letter of apology",
                        " collaborate to assess the correctness of the letters written by each learner"
                    ],
                    "key_inquiry_questions": [
                        "Why do people write letters?"
                    ],
                    "core_competencies": [
                        "Learning to learn: It is enhanced as the learner completes the given task on time when writing letters of apology.",
                        "Digital Literacy: It is developed as the learner interacts with digital devices to search for sample letters of apology from the",
                        "internet."
                    ],
                    "values": [
                        "Unity: It is promoted as the learner collaborates in the writing of letters of apology."
                    ],
                    "pcis": [
                        "Peaceful conflict resolution: It is promoted as the learner practises apologising to peers and seniors."
                    ],
                    "links_to_other_subjects": [
                        "The learner relates the skill of writing letters of apology to the learning of functional writing in Kiswahili."
                    ]
                },
                {
                    "substrand_number": "6.5.1",
                    "substrand_name": "Mechanics of Writing",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "spell commonly misspelt words correctly",
                        "use prefixes and suffixes correctly in writing",
                        "write words with silent vowels (-ie and -e",
                        "correctly",
                        "make connections between spelling and meaning in suffixed and prefixed words",
                        "acknowledge the importance of correct spellings in writing"
                    ],
                    "suggested_learning_experiences": [
                        " Read a digital or print passage on drug abuse and pick out the misspelt words",
                        " make a list of words with prefixes and suffixes used in a passage",
                        " write the correct spellings of words with prefixes and suffixes from a dictation",
                        " pick out words with silent vowels from a list",
                        " rewrite correctly a piece of writing in which words with prefixes, suffixes, or silent letters are misspelt",
                        " construct sentences using words with silent vowels",
                        " work with peers to search for more examples of words with prefixes, suffixes and silent vowels from the internet, newspapers, or magazines",
                        " select the correct form of prefix or suffix for given words from a table",
                        " create and display charts showing different words with prefixes and suffixes",
                        " write short compositions based on the theme using words with prefixes, suffixes, and silent (-ie -ei) vowels",
                        " collaborate to assess each other’s writing for correct spelling of prefixed and suffixed words as well as words with silent vowels"
                    ],
                    "key_inquiry_questions": [
                        "Why should words be spelt correctly?"
                    ],
                    "core_competencies": [
                        "Communication: It is enriched as the learner writes clearly and spells words correctly for effective communication.",
                        "Self-efficacy: It is enhanced as the learner identifies and states what they find difficult to spell and why."
                    ],
                    "values": [
                        "Unity: It is reinforced as the learner assists peers while collaborating to assess each other’s writing."
                    ],
                    "pcis": [
                        "Health education awareness: It is advanced as the learner interacts with print and non-print material on rehabilitation from drug abuse."
                    ],
                    "links_to_other_subjects": [
                        "The learner relates correct spelling to the writing of essays in Religious Education and Social Studies."
                    ]
                },
                {
                    "substrand_number": "7.5.1",
                    "substrand_name": "Composition Writing",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify the steps in the writing process",
                        "write a dialogue on a given topic",
                        "appreciate the importance of the writing process in enhancing clear communication"
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [],
                    "core_competencies": [
                        "Digital literacy: It is developed as the learner searches for information from the internet."
                    ],
                    "values": [
                        "Unity: It is enhanced as the learner brainstorms about ideas for writing compositions with peers."
                    ],
                    "pcis": [
                        "Effective communication: It is achieved as the learner connects ideas logically in writing.",
                        "Critical thinking: It is enhanced as the learner evaluates his or her own and others’ compositions."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to relate composition writing to essay writing in Religious Studies."
                    ]
                },
                {
                    "substrand_number": "8.5.1",
                    "substrand_name": "Assessment of writing",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify errors in an essay written by self or peers",
                        "assess a composition written by self or peers and suggest corrections for errors",
                        "appreciate the importance feedback to improve a composition"
                    ],
                    "suggested_learning_experiences": [
                        " read sample compositions",
                        " identify the errors in the compositions and list them down",
                        " write a composition on the relationship between road use and domestic tourism and peer review the compositions to correct errors",
                        " work with peers to create a narrative composition",
                        " exchange the composition with peers for review",
                        " suggest corrections to be made to the composition",
                        " display the edited work on the class notice board",
                        " take part in a gallery walk and view what the others have done"
                    ],
                    "key_inquiry_questions": [
                        "How does a text with errors make you feel?",
                        "What are some of the common mistakes we make in our writing?"
                    ],
                    "core_competencies": [
                        "Collaboration: It is enhanced as the learner contributes to group decision making while working with peers to create a narrative composition.",
                        "Learning to learn: It is developed as the learner assesses the correctness and suggests corrections to be made to the",
                        "composition."
                    ],
                    "values": [
                        "Patriotism: It is promoted as the learner nurtures the love of their country by interacting with texts on domestic tourism."
                    ],
                    "pcis": [
                        "Peer education: It is developed as the learner works with others to improve the compositions."
                    ],
                    "links_to_other_subjects": [
                        "Areas:",
                        "Self and peer assessment also features in composition writing in Kiswahili."
                    ]
                },
                {
                    "substrand_number": "9.5.1",
                    "substrand_name": "Creative Writing: Narrative Compositions (240-280 words)",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "recall a specific event, emotion or experience that affected them greatly",
                        "plan a narrative composition using prewriting techniques",
                        "create a narrative composition using revealing details",
                        "acknowledge the value of quality narrative compositions"
                    ],
                    "suggested_learning_experiences": [
                        " identify the parts of narrative composition",
                        " Work with peers to narrate events, feelings or experiences that impacted them",
                        " work with peers to plan a narrative composition",
                        " write a narrative composition individually",
                        " collaborate with peers to check each other’s work for: - Correctness of language - Relevance to the topic - Punctuation - Spelling",
                        " review their work individually and make corrections where necessary",
                        " publish their work by either: - Sharing it through email - Sharing it through social media - Pasting the work on posters - Posting the work in class, and conducting a gallery walk"
                    ],
                    "key_inquiry_questions": [
                        "Why do we enjoy reading stories?",
                        "How can you make your composition interesting?",
                        "Which event excited you or made you sad recently?"
                    ],
                    "core_competencies": [],
                    "values": [
                        "Unity: It is promoted as the learner cooperates with peers to revise and make their work better."
                    ],
                    "pcis": [
                        "Social cohesion: Working with peers while conducting the gallery walk makes learners learn to live harmoniously."
                    ],
                    "links_to_other_subjects": [
                        "The concept of narrative composition writing is related to the concept types of writing in both Kiswahili and creative arts and sports."
                    ]
                },
                {
                    "substrand_number": "10.5.1",
                    "substrand_name": "Functional Writing: Thank you and Congratulatory notes",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "recognise the key elements and layout of a thank you and a congratulatory note",
                        "use the correct format to write a thank you note",
                        "write a congratulatory note correctly",
                        "critique thank you and congratulatory notes for correctness and relevance"
                    ],
                    "suggested_learning_experiences": [
                        " list some of the ocassions when we write a thank you and a congratulatory note",
                        " write a thank you and a congratulatory note",
                        " search for samples of a thank you and a congratulatory note from the internet, newspapers, magazines and textbooks and read through them",
                        " download a thank you and a congratulatory note from the internet and read through them",
                        " identify the key aspects (components) of a thank you and a congratulatory note",
                        " collaborate to write a thank you and a congratulatory note individually",
                        " paste the completed work on the wall",
                        " conduct a gallery walk and give feedback for each other’s work",
                        " share a thank you and a congratulatory note online, through email, or posters"
                    ],
                    "key_inquiry_questions": [
                        "How are strong emotions expressed in writing?",
                        "Why should one write how they feel about something?"
                    ],
                    "core_competencies": [],
                    "values": [
                        "Love: It is fostered as the learner shows a caring attitude while collaborating with peers to create congratulatory and thank you notes."
                    ],
                    "pcis": [
                        "Life Skills education (effective communication): It is developed as the learner creates congratulatory and thank you notes and look for artistc ways to make them presentable.",
                        "Financial literacy: It is inculcated as the learner shares ideas on how art can be a source of income."
                    ],
                    "links_to_other_subjects": [
                        "Congratulatory and thank you notes are forms of functional writing which is also an aspect learnt in Kiswahili."
                    ]
                },
                {
                    "substrand_number": "11.5.1",
                    "substrand_name": "Mechanics of Writing: Prefixes and Suffixes",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify words with prefixes and suffixes from a text",
                        "use prefixes and suffixes correctly in sentences",
                        "acknowledge the influence of prefixes and suffixes on meaning and formation of words"
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [],
                    "core_competencies": [
                        "Collaboration: It is enhanced as the learner generates lists of words with prefixes and suffixes in groups or pairs.",
                        "Creativity and imagination: It is enhanced as the learner performs different tasks on prefixes and suffixes."
                    ],
                    "values": [
                        "Unity: It is promoted as the learner searches for more examples of words using prefixes and suffixes in groups."
                    ],
                    "pcis": [
                        "Creative thinking skills: They are developed as the learner formulates sentences using different forms of words."
                    ],
                    "links_to_other_subjects": [
                        "Word formation is related to learning of vocabulary which is subject specific for example in Agriculture and Nutition.."
                    ]
                },
                {
                    "substrand_number": "12.5.1",
                    "substrand_name": "The writing process",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "a)\texplain the process of writing a dialogue,",
                        "b)\twrite a dialogue on a given topic correctly,",
                        "c)\tacknowledge the importance of the writing process."
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [
                        "•\twork with the teacher to evaluate the individual dialogues.\t1.\tHow can a good dialogue be written?",
                        "Why should one write a dialogue?"
                    ],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "13.5.1",
                    "substrand_name": "Creative Narrative Composition: Idioms",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "a)\texplain the meaning of the specified idioms in context,",
                        "b)\tcompose a narrative composition using the specified idioms,",
                        "c)\tappreciate the value of idioms in spoken and written communication."
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [
                        "•\tshare the compositions in groups for peer review.\t1.\tWhat makes a story outstanding?",
                        "How can we improve our writing skills?"
                    ],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "14.5.1",
                    "substrand_name": "Creative Writing: Descriptive Writing",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "a)\tidentify words and expressions for describing people, places and events,",
                        "b)\twrite a descriptive composition on people, places and events,",
                        "c)\tvalue the place of description in written and spoken communication."
                    ],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [
                        "school website or class blogs.\t1.\tWhich words or expressions do we use to describe things, events or people?",
                        "How can descriptions make our writing better?"
                    ],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "15.5.1",
                    "substrand_name": "Functional Writing: Personal Journals",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [],
                    "suggested_learning_experiences": [],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                }
            ]
        }
    ]
}