{
    "grade": "Grade 4",
    "subject": "Christian Religious Education",
    "education_level": "Upper Primary",
    "strands": [
        {
            "strand_number": "1.0",
            "strand_name": "Creation",
            "substrands": [
                {
                    "substrand_number": "1.1",
                    "substrand_name": "Self-awareness",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "mention his or her name for identification and self-awareness",
                        "recognise his or her uniqueness as a creation of God",
                        "acknowledge God as the creator",
                        "appreciate his or her uniqueness as God’s special creation"
                    ],
                    "suggested_learning_experiences": [
                        "say their names",
                        "state what is unique about them",
                        "recite and meditate on Psalms 139:13 about being fearfully and wonderfully made",
                        "read Genesis 1:27 about being, ‘created in the image and likeness of God’",
                        "sing a song related to their uniqueness"
                    ],
                    "key_inquiry_questions": [
                        "Why are you a special creation?"
                    ],
                    "core_competencies": [
                        "Self-efficacy: the skill of knowing self is exhibited as learners say their names for identification"
                    ],
                    "values": [
                        "Respect: learners portray positive regard for self and others"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "1.2",
                    "substrand_name": "Thoughts and feelings",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "identify good thoughts and feelings",
                        "explain the importance of being joyful",
                        "list lessons learnt from Ephesians 4:26",
                        "apply the lessons learnt to cope with emotions in day-to-day life"
                    ],
                    "suggested_learning_experiences": [
                        "sing a song related to good thoughts and feelings",
                        "list good thoughts such as sharing with others, helping parents, being happy, being thankful, respecting others",
                        "say why it is good to be joyful",
                        "share experiences on how they cope with emotions such as anger or sadness",
                        "use digital devices to draw and colour pictures of faces depicting various emotions",
                        "role-play forgiving others when wronged",
                        "read Ephesians 4:26 and write down lessons learnt",
                        "write Philippians 4:4 on flash cards and recite it",
                        "sing songs related to rejoicing in the Lord always (Philippians 4:4)"
                    ],
                    "key_inquiry_questions": [
                        "How do you control your thoughts and feelings?",
                        "How do you cope with anger or sadness?"
                    ],
                    "core_competencies": [
                        "Learning to learn: the skill of sharing experiences is nurtured as learners tell each other how they cope with emotions such as anger or sadness"
                    ],
                    "values": [
                        "Love: is nurtured as learners role-play forgiving others when wronged"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "1.3",
                    "substrand_name": "Making choices",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "list choices they make in day-to-day life",
                        "discuss results of choices they make in daily life",
                        "make right choices guided by the word of God",
                        "portray responsibility by making right choices"
                    ],
                    "suggested_learning_experiences": [
                        "in pairs, list choices they make in day-to-day life",
                        "list results of choices that they make",
                        "sing a song about good choices",
                        "Role-play ‘making right choices that are acceptable to God.’"
                    ],
                    "key_inquiry_questions": [
                        "What are the effects of the choices you make?"
                    ],
                    "core_competencies": [
                        "Self-efficacy",
                        "Learning to learn"
                    ],
                    "values": [
                        "Respect",
                        "Love"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "1.4",
                    "substrand_name": "My Family: Family members",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "name family members in the nuclear and extended family",
                        "draw a family tree to understand relationships within the family",
                        "explain why it is important to honour parents",
                        "respect family members for harmonious co-existence"
                    ],
                    "suggested_learning_experiences": [
                        "sing a song related to family relationships",
                        "name family members in the nuclear family",
                        "name family members in the extended family (cousins, aunts, uncles, grandparents)",
                        "draw a family tree and write names of family members on it",
                        "list ways of respecting family members",
                        "type a poem using a digital device about respect for family members",
                        "watch a video clip of family members eating or praying together",
                        "recite Ephesians 6:1-3 on respecting parents"
                    ],
                    "key_inquiry_questions": [
                        "Why is it important to know members of your family?"
                    ],
                    "core_competencies": [
                        "Collaboration",
                        "Digital literacy"
                    ],
                    "values": [
                        "Unity"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "1.5",
                    "substrand_name": "Relationships within the Family",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "take care when alone with people of the opposite sex",
                        "mention ways of protecting oneself from sexual abuse",
                        "identify whom to report to if touched inappropriately or sexually abused",
                        "appreciate the body as a temple of the Holy Spirit and live a holy life"
                    ],
                    "suggested_learning_experiences": [
                        "sing a song related to respecting their bodies as the temple of the Holy Spirit",
                        "in turns, read 2 Samuel 13:4-14",
                        "say whom to report to if they are touched inappropriately or sexually abused",
                        "in groups, tell how they should protect themselves from sexual abuse",
                        "role-play ways of protecting themselves from sexual abuse",
                        "write 1 Corinthians 6:19 on flash cards and meditate on it",
                        "watch a video clip of children being tempted with gifts, but they say NO! to the strangers"
                    ],
                    "key_inquiry_questions": [
                        "Why are healthy family relationships important?"
                    ],
                    "core_competencies": [
                        "Collaboration: the skill of team work is portrayed as learners carry out activities in groups",
                        "Digital literacy: the skill of digital citizenship is enhanced as learners act safely and responsibly while watching video clips"
                    ],
                    "values": [
                        "Unity: learners collaborate with each other as they read the Bible in turns"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "1.6",
                    "substrand_name": "Attributes of God",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "read scriptures on the attributes of God",
                        "list three attributes of God and revere Him",
                        "recognise God as a loving Father who knows them by their names"
                    ],
                    "suggested_learning_experiences": [
                        "in groups, picture-read 1 John 4:7-8, Genesis 1:1-25 and 1Samuel 2:2 in turns",
                        "sort and match letters on attributes of God (Sole Creator, Loving Father, Holy Father)",
                        "join words about the attributes of God from a puzzle (sole creator, loving, holy)",
                        "compose a poem on, ‘God our loving Father,’",
                        "sing a song about the love of God"
                    ],
                    "key_inquiry_questions": [
                        "Why should you know the attributes of God?"
                    ],
                    "core_competencies": [
                        "Collaboration: the skill of teamwork is portrayed as they sort and match letters",
                        "Creativity and Imagination: the skill of exploration is exhibited as learners compose a poem on, ‘God our loving Father.’"
                    ],
                    "values": [
                        "Unity is nurtured as they work in groups and sing a song about the love of God"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                }
            ]
        },
        {
            "strand_number": "2.0",
            "strand_name": "The Holy Bible",
            "substrands": [
                {
                    "substrand_number": "2.1",
                    "substrand_name": "The Inspired Word of God",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "handle the Holy Bible with respect as the inspired word of God",
                        "identify the books in the Old and New Testament",
                        "role play naming some books in the Bible",
                        "recite Isaiah 49:16 and desire to read the Holy Bible always"
                    ],
                    "suggested_learning_experiences": [
                        "sing a song related to respecting the Holy Bible",
                        "role-play ways of handling the Holy Bible with respect",
                        "in pairs, observe and read charts containing books in the Old and New Testament",
                        "play games on naming some books in the Old and the New Testament",
                        "recite and meditate on Isaiah 49:16",
                        "sing a song about the books in the Holy Bible"
                    ],
                    "key_inquiry_questions": [
                        "Why should you respect the Holy Bible?",
                        "Why is it important to know the books in the Holy Bible?"
                    ],
                    "core_competencies": [
                        "Collaboration: the skill of teamwork is enhanced as learners contribute to group discussions and take up different roles while singing and role playing",
                        "Creativity and imagination: the skill of originality is developed as learners come up with new ideas while playing games on naming some books in the Old and the New Testament"
                    ],
                    "values": [
                        "Responsibility: is enhanced as they learn how to care for the Holy Bible"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "2.2",
                    "substrand_name": "Bible Stories: Zacchaeus the Tax Collector",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "retell the story of Zacchaeus",
                        "recount how Zacchaeus changed his behaviour positively",
                        "demonstrate integrity when using money",
                        "discuss why it is important to repent sins in order to be like Christ"
                    ],
                    "suggested_learning_experiences": [
                        "read Luke19:2-10 in turns",
                        "draw and colour Zacchaeus on a tree and share the drawings with peers",
                        "retell the story of Zacchaeus",
                        "tell a friend how to turn away from bad behaviour//sin",
                        "state three lessons learnt from the story of Zacchaeus",
                        "list ways of using money wisely",
                        "sing a song related to Jesus Christ as the saviour"
                    ],
                    "key_inquiry_questions": [
                        "How did Zacchaeus’ encounter with Jesus Christ change his behaviour?"
                    ],
                    "core_competencies": [
                        "Self-efficacy: the skill of expressing their emotions is exhibited as learners tell their friends how to turn away from bad behaviour/sin"
                    ],
                    "values": [
                        "Patriotism: they learn how Zacchaeus dedicated his life to serving his government regardless of the challenges his work posed to him and his family"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "2.3",
                    "substrand_name": "Balaam’s Donkey",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "retell the story of Balaam and his donkey",
                        "apply the story in their lives by obeying God’s instructions",
                        "acquire the value of love by speaking good things about others",
                        "acknowledge God’s greatness by revering Him"
                    ],
                    "suggested_learning_experiences": [
                        "in groups, read Numbers 22:1-6, 20- 34",
                        "in pairs, list the importance of obeying God and their seniors",
                        "role-play the story of Balaam’s Donkey",
                        "discuss why they should bless and not curse or speak ill about others according to Numbers 22:1-6, 20-34",
                        "use a digital device or a pencil to draw the scenarios in this story",
                        "sing a song related to obedience"
                    ],
                    "key_inquiry_questions": [
                        "Why did the donkey talk?"
                    ],
                    "core_competencies": [
                        "Learning to Learn: the skill of self-discipline is nurtured as learners work collaboratively in groups",
                        "Digital Literacy: the skill of digital citizenship is enhanced as learners use a digital device and draw the scenarios based on the story"
                    ],
                    "values": [
                        "Social Justice: learners advocate for harmonious relationships in society as they discuss why they should bless and not curse or speak ill about others"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "2.4",
                    "substrand_name": "Samson kills a Lion",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "retell the story of Samson; Judges 14: 5- 9",
                        "acknowledge God’s power in his or her life",
                        "trust in God to cope with the challenges of life"
                    ],
                    "suggested_learning_experiences": [
                        "in turns, read Judges 14:5-9",
                        "model or draw a lion",
                        "compose a poem on ‘Samson kills a lion’",
                        "watch a video clip about Samson",
                        "sing a song on God’s power",
                        "draw pictures of Samson killing a lion"
                    ],
                    "key_inquiry_questions": [
                        "How does the story of Samson portray God’s power?"
                    ],
                    "core_competencies": [
                        "Imagination and Creativity: the skill of originality is nurtured as learners model a lion and compose a poem",
                        "Communication: the skill of speaking clearly and effectively is exhibited as they read in turns"
                    ],
                    "values": [
                        "Respect: learners take turns to read the Bible and listen to each other’s ideas"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "2.5",
                    "substrand_name": "Joseph interprets a Dream",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "retell the story of Joseph interpreting a dream",
                        "apply lessons learnt by depending on God’s wisdom",
                        "recognise that, ‘the fear of God is the beginning of wisdom.’"
                    ],
                    "suggested_learning_experiences": [
                        "read Genesis 41:14-24, 28-30 in turns",
                        "share dreams they have dreamt about and try to interpret them",
                        "dramatise Joseph interpreting the dream",
                        "draw a picture of Joseph before Pharaoh and colour it",
                        "mention three lessons learnt from the story",
                        "sing a song related to this story",
                        "recite Proverbs 1:7"
                    ],
                    "key_inquiry_questions": [
                        "How was Joseph able to interpret dreams?"
                    ],
                    "core_competencies": [
                        "Learning to learn: the skill of sharing experiences is nurtured as learners share dreams they have dreamt about"
                    ],
                    "values": [
                        "Love: is inculcated as they learn how Joseph loved God and his adopted country Egypt by ensuring they had food security"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "2.6",
                    "substrand_name": "Bible Patriarchs Abraham",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "recount the call of Abraham",
                        "obey God’s instructions in his or her day-to-day life",
                        "mention his or her name for self-identity",
                        "discuss Abram’s change of name to Abraham",
                        "appreciate God’s blessings in his or her life"
                    ],
                    "suggested_learning_experiences": [
                        "sing the song about Abraham the father of faith",
                        "read Genesis 12:1-5 and retell the call of Abraham",
                        "role-play the call of Abraham",
                        "tell what they like about their names",
                        "read Genesis 17:1-5 on the change of Abraham’s name",
                        "recite Genesis 12:3 and appreciate God’s blessings in their lives"
                    ],
                    "key_inquiry_questions": [
                        "Why was the name Abram changed?",
                        "How did Abraham show obedience to God?"
                    ],
                    "core_competencies": [
                        "Collaboration: the skill of teamwork is nurtured as learners role-play the call of Abraham",
                        "Communication: the skill of speaking clearly and effectively is enhanced as they retell the call of Abraham"
                    ],
                    "values": [
                        "Respect: learners listen to and appreciate diverse opinions from peers"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                }
            ]
        },
        {
            "strand_number": "3.0",
            "strand_name": "The Life of Jesus Christ",
            "substrands": [
                {
                    "substrand_number": "3.1",
                    "substrand_name": "The Annunciation",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "narrate the annunciation of the Birth of Jesus Christ",
                        "acknowledge the uniqueness of the birth of Jesus Christ",
                        "recite Luke 1:37 and trust in God’s power",
                        "emulate Mary the mother of Jesus and lead a holy life"
                    ],
                    "suggested_learning_experiences": [
                        "in turns, read Luke 1:26-37",
                        "role-play the annunciation of the birth of Jesus Christ",
                        "watch a video clip on the annunciation of the birth of Jesus Christ",
                        "in groups, sing a song about the annunciation of the birth of Jesus Christ",
                        "say why sexual purity is important",
                        "recite and meditate on Luke 1:37"
                    ],
                    "key_inquiry_questions": [
                        "Why is the birth of Jesus Christ unique?"
                    ],
                    "core_competencies": [
                        "Digital Literacy: the skill of connecting using technology is portrayed as learners watch a video clip on the birth of John the Baptist",
                        "Imagination and Creativity: the skill of coming up with new ideas is exhibited as learners role-play the annunciation of the birth of Jesus Christ"
                    ],
                    "values": [
                        "Unity: learners work in pairs and groups to perform different tasks"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "3.2",
                    "substrand_name": "Birth of John the Baptist",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "retell the Birth of John the Baptist",
                        "discuss how John the Baptist prepared the way for the Messiah",
                        "appreciate the need to live a righteous life by turning away from sins"
                    ],
                    "suggested_learning_experiences": [
                        "in pairs, read Luke 1:5-13, 57",
                        "role-play the angel’s appearance to Zechariah in the temple",
                        "watch a video clip on the birth of John the Baptist",
                        "read Luke 1:76-79 and tell how John the Baptist prepared the way for the Messiah",
                        "sing a song about John the Baptist"
                    ],
                    "key_inquiry_questions": [
                        "How is John the Baptist a precursor of Jesus Christ?"
                    ],
                    "core_competencies": [
                        "Digital Literacy",
                        "Imagination and Creativity"
                    ],
                    "values": [
                        "Unity"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "3.3",
                    "substrand_name": "Healing of Blind Bartimaeus",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "retell the healing of blind Bartimaeus",
                        "recognise the healing power of Jesus Christ in their lives",
                        "appreciate Jesus’ power over sickness and disease"
                    ],
                    "suggested_learning_experiences": [
                        "sing a song about the healing power of God",
                        "read Mark 10:46-52 and retell the healing of blind Bartimaeus",
                        "role-play the healing of blind Bartimaeus",
                        "record the role play using a digital device",
                        "share an incident when they prayed to God for healing"
                    ],
                    "key_inquiry_questions": [
                        "How did Bartimaeus show faith in Jesus Christ?"
                    ],
                    "core_competencies": [
                        "Learning to Learn: the skill of sharing experiences is enhanced as learners share an incident when they prayed to God for healing",
                        "Communication: the skill of speaking clearly and effectively is portrayed as learners retell the healing of blind Bartimaeus"
                    ],
                    "values": [
                        "Responsibility: learners engage in assigned roles and duties as they role-play the healing of blind Bartimaeus"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "3.4",
                    "substrand_name": "Healing the 10 Lepers",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "narrate the story of the 10 lepers",
                        "outline ways of showing gratitude to God in day-to-day life",
                        "express gratitude to those who are kind tp them",
                        "appreciate the miracle by having faith in God"
                    ],
                    "suggested_learning_experiences": [
                        "in turns, read Luke 17:11-19",
                        "role-play the healing of the ten lepers",
                        "draw the ten lepers using a digital device or a pencil",
                        "tell how the 10 lepers showed faith in God",
                        "mention how they exercise faith in God",
                        "share instances when they prayed to God for healing",
                        "in groups, list ways they express gratitude to God",
                        "write a ‘Thank you note’ to God for the gift of life",
                        "list ways they express gratitude to others",
                        "sing a song related to showing gratitude to God"
                    ],
                    "key_inquiry_questions": [
                        "How did the 10 lepers portray gratitude?"
                    ],
                    "core_competencies": [
                        "Imagination and creativity: the skill of coming up with new ideas is portrayed as learners draw the 10 lepers using a digital device or pencil",
                        "Digital Literacy: the skill of connecting using technology is portrayed as learners use a digital device to draw the 10 lepers"
                    ],
                    "values": [
                        "Love: is nurtured as learners write a ‘Thank you note’ to God for the gift of life"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "3.5",
                    "substrand_name": "Jesus raises a Widow’s Son",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "retell the story of raising the widow’s son",
                        "recognise God’s power over life and death",
                        "apply lessons learnt by showing compassion to others",
                        "pray to God when faced with challenges"
                    ],
                    "suggested_learning_experiences": [
                        "read Luke 7:11-16 and retell the story",
                        "list challenges they face in their lives and how they involve God",
                        "tell how they show kindness to others",
                        "say how Jesus showed compassion to the widow",
                        "watch a video clip on raising the widow’s son",
                        "write John 11:25 on flash cards and recite it",
                        "sing a song about God’s power over life and death"
                    ],
                    "key_inquiry_questions": [
                        "What do you learn from the miracle of raising the widow’s son?"
                    ],
                    "core_competencies": [
                        "Digital literacy: the skill of connecting parts of a digital device is exhibited as learners watch a video clip on raising the widow’s son",
                        "Self-efficacy: the skill of expressing their needs clearly for help is portrayed as they list challenges they face in their lives and how they depend on God to get solutions"
                    ],
                    "values": [
                        "Love: is nurtured as learners say how Jesus showed compassion to the widow"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "3.6",
                    "substrand_name": "Forgiveness",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "outline the importance of forgiving others",
                        "resist vengeance as outlined in Mathew 5:39",
                        "appreciate forgiveness by not repaying evil for evil"
                    ],
                    "suggested_learning_experiences": [
                        "read Matthew 5:39 and say why it is important to forgive others",
                        "role-play acts of forgiveness",
                        "say why they should not revenge when wronged",
                        "sing a song about loving others",
                        "write Mathew 5:39, display it in class and recite it"
                    ],
                    "key_inquiry_questions": [
                        "Why should you not pay evil for evil?"
                    ],
                    "core_competencies": [
                        "Citizenship",
                        "Communication"
                    ],
                    "values": [
                        "Love",
                        "Peace",
                        "Patriotism"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "3.7",
                    "substrand_name": "Helping the Needy",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "state the importance of helping the needy",
                        "demonstrate kindness by sharing with those in need",
                        "recite Mathew 5:42 and help those in need promptly"
                    ],
                    "suggested_learning_experiences": [
                        "read Matthew 5:42 and tell what they have learnt",
                        "mention instances they helped someone at school, home or in church e.g. they gave a pencil, rubber or shared lunch with another pupil",
                        "role-play sharing items with those who do not have",
                        "write Matthew 5:42 on flash cards and recite it"
                    ],
                    "key_inquiry_questions": [
                        "How do you help those in need?"
                    ],
                    "core_competencies": [
                        "Citizenship: the skill of developing and showing compassion and empathy is portrayed as learners mention instances they helped someone at school, home or in church",
                        "Communication: the skill of writing clearly and correctly is exhibited as learners write Matthew 5:42 on flash cards and recite it"
                    ],
                    "values": [
                        "Love: is portrayed as learners sing a song about loving others",
                        "Peace: is nurtured as learners say why they should not revenge when wronged",
                        "Patriotism: is portrayed as learners demonstrate kindness by sharing with those in need"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "3.8.1",
                    "substrand_name": "Parable of the lost coin",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "retell the parable of the lost coin",
                        "list lessons learnt from the parable of the lost coin",
                        "recognise God’s love for the sinner and the need to live a righteous life",
                        "appreciate God’s love and lead upright lives"
                    ],
                    "suggested_learning_experiences": [
                        "read Luke 15:8-10 and retell the parable of the lost coin",
                        "role-play the parable of the lost coin",
                        "share lessons learnt from the parable of the lost coin with a friend",
                        "say how God loves them and how to lead a righteous life",
                        "tell why it is important to live a holy life as a Christian",
                        "sing a song about God’s willingness to save the lost"
                    ],
                    "key_inquiry_questions": [
                        "How does God show love for the sinner?"
                    ],
                    "core_competencies": [
                        "Learning to learn: the skill of sharing what they have learnt is exhibited as they share lessons learnt from the parable of the lost coin",
                        "Imagination and creativity: the skill of coming up with new ideas is exhibited as learners role-play the parable of the lost coin"
                    ],
                    "values": [
                        "Love: is nurtured as learners say how God loves them and how to lead a righteous life"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "3.8.2",
                    "substrand_name": "Parable of the mustard seed",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "retell the parable of the mustard seed as guided by the Bible text",
                        "describe how the kingdom of God grows from a small beginning",
                        "explain how they contribute to the growth of the kingdom of God",
                        "appreciate the growth of God’s kingdom by evangelising to others"
                    ],
                    "suggested_learning_experiences": [
                        "read Luke 13:18-19 and narrate the parable",
                        "in groups, collect small seeds from the school compound",
                        "plant the seeds, water them and observe as the seeds sprout and grow to a big tree",
                        "draw a big tree with birds resting on its branches and compare it to the growth of God’s kingdom",
                        "Role-play the activities they do in Church",
                        "watch a video clip on a mustard seed",
                        "say how they respond to salvation",
                        "sing a song about the kingdom of God"
                    ],
                    "key_inquiry_questions": [
                        "How does the parable of the mustard seed relate to the kingdom of God?"
                    ],
                    "core_competencies": [
                        "Creativity and Imagination: the skill of communicating new ideas is enhanced as learners draw a big tree and compare it to the growth of God’s kingdom",
                        "Digital Literacy: the skill of digital citizenship is portrayed as learners watch a video clip on a mustard seed"
                    ],
                    "values": [
                        "Unity: is enhanced as learners work in groups to collect small seeds from the school compound",
                        "Responsibility: is enhanced as learners plant the seeds, water them and observe as the seeds sprout and grow to a big tree"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "3.9",
                    "substrand_name": "Nicodemus’ encounter with Jesus Christ",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "retell the story of Nicodemus’ encounter with Jesus Christ",
                        "acknowledge that repentance of sins draws us close to Christ",
                        "discuss the importance of baptism to Christians today",
                        "recite John 3:16 and believe in Jesus Christ to inherit eternal life"
                    ],
                    "suggested_learning_experiences": [
                        "read John 3:1-5 and say how they respond to Christ’s saving grace",
                        "role-play the story of Nicodemus’ encounter with Jesus Christ",
                        "discuss how repentance of sins can draw them to Christ",
                        "watch a video on Nicodemus’ conversion",
                        "say why baptism is important to Christians today",
                        "sing a song on Nicodemus’ conversion",
                        "tell how they respond to John 3:16"
                    ],
                    "key_inquiry_questions": [
                        "How did Nicodemus’ encounter with Jesus Christ change his life?"
                    ],
                    "core_competencies": [
                        "Communication: speaking skills are portrayed as learners read the Bible and tell how they respond to Christ’s saving grace",
                        "Learning to learn: the skill of working collaboratively is enhanced as learners discuss how repentance of sins can draw them to Christ"
                    ],
                    "values": [
                        "Respect: learners display humility as they role-play the story of Nicodemus"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                }
            ]
        },
        {
            "strand_number": "4.0",
            "strand_name": "Christian Values",
            "substrands": [
                {
                    "substrand_number": "4.1",
                    "substrand_name": "Trust",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "emulate Joseph by resisting sexual temptations as young people",
                        "exercise assertiveness in the face of temptations/tempting situations",
                        "identify people he/she can trust for own safety",
                        "recite Psalm 125:1 and trust in God always"
                    ],
                    "suggested_learning_experiences": [
                        "in turns, read Genesis 39:7-12 and retell the story of Joseph and Potiphar’s wife",
                        "list lessons learnt from the story of Joseph and Potiphar’s wife",
                        "list people they can trust at home, school and in the community",
                        "brainstorm on how to escape/avoid temptations/tempting situations",
                        "in pairs, roleplay saying No! to sexual temptations",
                        "in groups, discuss whom to report to when in danger",
                        "write a poem on, ‘People I trust’",
                        "role-play saying, ‘No’ to strangers to avoid child abuse or kidnap",
                        "list the importance of trusting God",
                        "sing a song about trusting God"
                    ],
                    "key_inquiry_questions": [
                        "Whom do you trust at home and school?",
                        "Why should you avoid talking to strangers?",
                        "Why should you put your trust in God?"
                    ],
                    "core_competencies": [
                        "Self-efficacy: the skill of expressing their needs clearly for help is portrayed as learners list people they can trust at home, school and the community",
                        "Creativity and Imagination: the skill of coming up with unique and new ideas is exhibited as learners role-play saying, No! to strangers to avoid child abuse or kidnap"
                    ],
                    "values": [
                        "Responsibility: learners observe safety precautions as they say No! to strangers"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "4.2",
                    "substrand_name": "Truthfulness",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "state the importance of telling the truth",
                        "resist lying as cited in Proverbs 12:19",
                        "desire to always speak the truth according to Ephesians 4:25"
                    ],
                    "suggested_learning_experiences": [
                        "read Ephesians 4:25",
                        "say why they should always tell the truth",
                        "in pairs, say when they did not tell the truth and how to overcome lies",
                        "write a poem on the importance of always telling the truth",
                        "write Proverbs 12:19 on flash cards and recite it"
                    ],
                    "key_inquiry_questions": [
                        "Why should you always tell the truth?"
                    ],
                    "core_competencies": [
                        "Imagination and Creativity: the skill of coming up with new ideas and originality is enhanced as they write a poem on the importance of always telling the truth",
                        "Communication and collaboration: the skill of speaking clearly and effectively is enhanced as learners, in pairs, say when they did not tell the truth and how to overcome lies"
                    ],
                    "values": [
                        "Integrity: learners say why they should always tell the truth"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "4.3",
                    "substrand_name": "Obedience",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "read Exodus 20:12 and state the benefit of honouring parents",
                        "obey parents and teachers to promote harmonious co-existence",
                        "practise responsibility by obeying school rules",
                        "outline the results of disobedience",
                        "desire to exercise obedience in day-to-day life"
                    ],
                    "suggested_learning_experiences": [
                        "read Exodus 20:12 and state the benefit of honouring parents",
                        "compose a poem on the benefits of obeying parents",
                        "discuss the importance of obeying teachers",
                        "say why they should obey school rules",
                        "in groups, list the results of disobedience",
                        "sing a song on the benefits of obedience"
                    ],
                    "key_inquiry_questions": [
                        "Why is it important to obey?"
                    ],
                    "core_competencies": [
                        "Learning to learn: the skill of carrying out activities with peers is portrayed as learners list the results of disobedience",
                        "Creativity and Imagination: the skill of coming up with new ideas is nurtured as learners compose a poem on the benefits of obeying parents and teachers"
                    ],
                    "values": [
                        "Responsibility: learners obey parents and teachers"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "4.4",
                    "substrand_name": "Love",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "recognise that God loves children; Matthew 19:13-15",
                        "demonstrate love by showing kindness to others",
                        "appreciate God’s love by obeying His teachings"
                    ],
                    "suggested_learning_experiences": [
                        "in groups, retell Jesus Christ’s love for children",
                        "role-play Jesus blessing Children (Mathew 19:13-15)",
                        "draw Jesus praying for children",
                        "watch a video clip on Jesus Christ blessing children",
                        "show love to others as taught by Jesus Christ"
                    ],
                    "key_inquiry_questions": [
                        "How did Jesus Christ show love to children?",
                        "How do you show Godly love to others as a Christian?"
                    ],
                    "core_competencies": [
                        "Imagination and Creativity: the skill of coming up with unique and new ideas is exhibited as learners draw Jesus praying for children",
                        "Digital Literacy: the skill of digital citizenship is portrayed as learners watch a video clip on Jesus Christ blessing children"
                    ],
                    "values": [
                        "Love: learners show love to others as taught by Jesus Christ"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "4.5",
                    "substrand_name": "Responsibility: Personal and school items",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "identify personal items and how they care for them",
                        "identify school properties and how they care for them",
                        "acquire responsibility by taking care of personal and school properties"
                    ],
                    "suggested_learning_experiences": [
                        "display personal items e.g. pullover, pen, pencils, eraser, exercise books, text books",
                        "in pairs, list the use of each item",
                        "say why they should take good care of their personal and school items",
                        "compose a poem on taking care of personal and school properties"
                    ],
                    "key_inquiry_questions": [
                        "How do you take care of personal and school items?"
                    ],
                    "core_competencies": [
                        "Communication: the skill of communication and self-expression is exhibited as learners compose a poem"
                    ],
                    "values": [
                        "Responsibility: learners care for personal and school items"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "4.6",
                    "substrand_name": "Holiness",
                    "number_of_lessons": 4,
                    "specific_learning_outcomes": [
                        "describe ways of glorifying God with their bodies",
                        "acquire the value of holiness by keeping away from situations that lead to sin",
                        "recite 1Corinthians 6:19 on the body as the temple of the Holy Spirit",
                        "desire to lead holy lives free from sin"
                    ],
                    "suggested_learning_experiences": [
                        "in pairs, read 1 Corinthians 6:19-20 and mention the lessons learnt",
                        "in pairs, list sins that do not please God",
                        "in groups, discuss how to avoid situations that lead to sin",
                        "sing a song on holiness"
                    ],
                    "key_inquiry_questions": [
                        "Why should you lead holy lives as young people?"
                    ],
                    "core_competencies": [
                        "Self-efficacy: the skill of knowing self is portrayed as learners discuss how to avoid situations that lead to sin"
                    ],
                    "values": [
                        "Respect: learners practise humility and take turns to read the Bible and perform assigned tasks"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                }
            ]
        },
        {
            "strand_number": "5.0",
            "strand_name": "The Church",
            "substrands": [
                {
                    "substrand_number": "5.1",
                    "substrand_name": "House of God",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "outline lessons learnt from Matthew 21:12-14",
                        "participate in church activities to grow spiritually",
                        "appreciate the church as a house of worship"
                    ],
                    "suggested_learning_experiences": [
                        "read Matthew 21:12-13 and list lessons learnt from the Bible text",
                        "read 1Corithinians 14:26 and list activities mentioned in the Bible text",
                        "in groups, list the activities they do in church",
                        "in pairs, list ways of respecting the church as a house of God",
                        "write a poem about respecting the church",
                        "sing a song related to serving God"
                    ],
                    "key_inquiry_questions": [
                        "Why is the church a holy place?"
                    ],
                    "core_competencies": [
                        "Collaboration: the skill of teamwork is portrayed as learners mention ways they serve God in church"
                    ],
                    "values": [
                        "Responsibility is exhibited as learners list activities they do in church"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "5.2",
                    "substrand_name": "The Early Church",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "name the disciples of Jesus Christ",
                        "describe how the early church was started",
                        "desire to turn away from sins according to Acts 2:38"
                    ],
                    "suggested_learning_experiences": [
                        "read Matthew 10:1-4 and list the disciples of Jesus Christ",
                        "sort the names of the 12 disciples using flash cards",
                        "search for the names of the disciples in a word puzzle",
                        "watch a video clip on the twelve disciples",
                        "read Acts 2:38-41 on how the early church was started",
                        "Role-play how the early church was started",
                        "repent their sins as guided in Acts 2:38"
                    ],
                    "key_inquiry_questions": [
                        "How was the early church started?"
                    ],
                    "core_competencies": [
                        "Learning to learn: the skill of developing relationships is nurtured as learners carry out activities together such as sorting, searching and role playing"
                    ],
                    "values": [
                        "Responsibility: they learn how to take up assigned roles, by following the example of the disciples of Jesus Christ"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "5.3",
                    "substrand_name": "Standing Firm in Faith",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "name the city where believers were first called Christians",
                        "retell how Stephen was stoned for standing firm in his faith",
                        "list three lessons learnt from the stoning of Stephen",
                        "explain why they should not join ungodly groups",
                        "utilise the virtue of assertiveness and stand firm in faith"
                    ],
                    "suggested_learning_experiences": [
                        "sing a song related to standing firm in the Christian faith",
                        "read Acts 11: 26 and say where believers were first called Christians",
                        "identify Antioch, from a Bible map",
                        "in groups, read Acts 7: 54-60 and retell the story of Stephen",
                        "brainstorm on lessons learnt from the story of Stephen",
                        "explain why they should not join ungodly groups; radicalised groups, groups that do not recognise Jesus Christ",
                        "list ways they can stand firm in their Christian faith"
                    ],
                    "key_inquiry_questions": [
                        "Why should you stand firm in your Christian faith?",
                        "Why should you not join ungodly groups?"
                    ],
                    "core_competencies": [
                        "Learning to learn: the skill of engaging in self-driven tasks is portrayed as learners identify Antioch from the map"
                    ],
                    "values": [
                        "Patriotism: learners explain why they should not join ungodly groups; radicalised groups and groups that do not recognise Jesus Christ"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "5.4",
                    "substrand_name": "The Lord’s Prayer",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "recite the Lord’s prayer",
                        "pray for parents, guardians and friends",
                        "say a prayer to God every day to grow spiritually"
                    ],
                    "suggested_learning_experiences": [
                        "sing a song related to the Lord’s Prayer",
                        "read Matthew 6:9-13",
                        "discuss why it is important to pray every day",
                        "pray for their parents/guardians, friends and relatives",
                        "recite the Lord’s prayer daily",
                        "list the number of times they pray and share with classmates"
                    ],
                    "key_inquiry_questions": [
                        "Why should you pray always as a Christian?"
                    ],
                    "core_competencies": [
                        "Collaboration: learners develop the skill of teamwork as they discuss, sing and recite the Lord’s Prayer"
                    ],
                    "values": [
                        "Unity is enhanced as learners pray for their parents/guardians, friends and relatives"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "5.5",
                    "substrand_name": "Fruit of the Holy Spirit",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "list the fruit of the Holy Spirit; Galatians 5:22-23",
                        "describe how they apply the fruit of the Holy Spirit in their lives",
                        "desire to be led by the Holy Spirit in their daily activities"
                    ],
                    "suggested_learning_experiences": [
                        "in pairs, read Galatians 5:22-23",
                        "list the fruit of the Holy Spirit",
                        "write the fruit of the Holy Spirit on flash cards and display it in class",
                        "in groups, list good things they should do to others as Christians",
                        "discuss how they apply the fruit of the Holy Spirit in their daily lives",
                        "compose and sing a song on the fruit of the Holy Spirit"
                    ],
                    "key_inquiry_questions": [
                        "Why should you have the fruit of the Holy Spirit?"
                    ],
                    "core_competencies": [
                        "Creativity and imagination: the skill of originality is nurtured as learners compose a song on the fruit of the Holy Spirit"
                    ],
                    "values": [
                        "Peace is exhibited as learners practise the fruit of the Holy Spirit such as peace and live peacefully with others"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "5.6",
                    "substrand_name": "Self-control",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "practice self-control as guided in Galatians 5:23- 25",
                        "make right decisions that are guided by the Holy Spirit",
                        "demonstrate self-control by avoiding behaviour that defiles the body",
                        "live Godly lives guided by the Holy Spirit"
                    ],
                    "suggested_learning_experiences": [
                        "read Galatians 5:23-25",
                        "role-play ‘making decisions that portray self-control’",
                        "in groups, list choices they make in their day-to- day lives",
                        "list things that can defile them e.g. engaging in sex, watching ungodly movies, drug use and abuse",
                        "say how they can avoid defiling their bodies",
                        "compose a song on self-control: Galatians 5:23-25"
                    ],
                    "key_inquiry_questions": [
                        "Why should you practice self- control?"
                    ],
                    "core_competencies": [
                        "Learning to learn: the skill of working collaboratively is portrayed as learners list choices they make in their day-to-day lives",
                        "Imagination and creativity: the skill of originality is exhibited as learners role-play ‘making decisions that portray self-control’"
                    ],
                    "values": [
                        "Responsibility is inculcated as learners list and avoid things that can defile their bodies",
                        "Integrity: learners exhibit self-discipline by not engaging in acts that can defile them e.g. watching ungodly movies"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                }
            ]
        },
        {
            "strand_number": "6.0",
            "strand_name": "Morality and Social Media",
            "substrands": [
                {
                    "substrand_number": "6.1",
                    "substrand_name": "Use of Social Media",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "list digital devices used at home and school",
                        "discuss appropriate ways of using social media",
                        "apply the value of integrity when using social media",
                        "desire to do the right thing always even when no one is watching"
                    ],
                    "suggested_learning_experiences": [
                        "in groups, list some digital devices that they know or use",
                        "in pairs, discuss appropriate use of social media",
                        "say why they should not chat with strangers online",
                        "use a digital device to listen to a gospel song or watch a video clip based on the Bible"
                    ],
                    "key_inquiry_questions": [
                        "Why should you use social media appropriately?"
                    ],
                    "core_competencies": [
                        "Communication: listening skills are enhanced as learners use social media devices to listen to a gospel song or watch a video clip based on the Bible"
                    ],
                    "values": [
                        "Responsibility: learners use social media responsibly",
                        "Integrity: learners use social media appropriately even when no one is watching them"
                    ],
                    "pcis": [],
                    "links_to_other_subjects": []
                }
            ]
        }
    ]
}