{
    "grade": "Grade 6",
    "subject": "English Language",
    "education_level": "Upper Primary",
    "strands": [
        {
            "strand_number": "1.0",
            "strand_name": "THEME 1.0: CHILD LABOUR",
            "substrands": [
                {
                    "substrand_number": "1.1.1",
                    "substrand_name": "Listening and Speaking: Pronunciation and Listening",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "select words with the target sound /ɪə/ from an oral narrative,",
                        "use vocabulary related to the theme in sentences correctly,",
                        "use proverbs, fixed phrases, idioms, and metaphors with straightforward"
                    ],
                    "suggested_learning_experiences": [
                        "listen to an oral narrative from a",
                        "digital device or a text read by the teacher,",
                        "listen for specific information such as sounds: /ɪə/ as in tear, appear, rear, clear and severe from a text,",
                        "listen for the main idea from a text and practise saying words with the sound /ɪə/,",
                        "infer the meaning of vocabulary and phrases using contextual clues, answer oral questions based on",
                        "listening comprehension,"
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Pronunciation and Listening  (3 Lessons)\tBy the end of the Sub Strand, the learner should be able to: a)\tselect words with the target sound /ɪə/ from an oral narrative, b)\tuse vocabulary related to the theme in sentences correctly, c)\tuse proverbs, fixed phrases, idioms, and metaphors with straightforward\tThe learner is guided to: •\tlisten to an oral narrative from a digital device or a text read by the teacher, •\tlisten for specific information such as sounds: /ɪə/ as in tear, appear, rear, clear and severe from a text, •\tlisten for the main idea from a text and practise saying words with the sound /ɪə/, •\tinfer the meaning of vocabulary and phrases using contextual clues, answer oral questions based on listening comprehension,",
                        "Why should you listen keenly?",
                        "Why should you pronounce words accurately?    \t\tmeanings in oral communication, d)\tlisten for the main idea and specific details from an oral text, e)\tvalue the importance of listening attentively.\t•\tuse digital and print resources to look up the meaning and spelling of words, •\tretell a story and record the narration on a digital device, •\tuse expressions such as fixed phrases: play games, far away, believe it or not, do your best, burst into tears; similes: as hungry as a wolf, as greedy as a hyena; metaphors: The thief was a hyena, he was so greedy; idioms: work like a dog, dog tired, work for peanuts, donkey work; proverbs: all work and no play makes Jack a dull boy, phrasal verbs: beat up, agree with, put up with, cope with."
                    ],
                    "core_competencies": [
                        "Digital Literacy: The learner manipulates digital devices when listening to an oral narrative.",
                        "Learning to Learn: The learner carries out activities with peers as they practise pronunciation of words."
                    ],
                    "values": [
                        "Respect: The learner interacts with information on equity as they listen to texts related to child labour.",
                        "Responsibility: The learner shows accountability when listening to an oral narrative from a digital device."
                    ],
                    "pcis": [
                        "Child Rights: This is addressed as the learner interacts with texts on child labour."
                    ],
                    "links_to_other_subjects": [
                        "Vocabulary learnt on the theme of child labour can be applied to the learning of child rights in Social Studies.",
                        "Strand\tSub",
                        "Strand\tSpecific Learning Outcomes\tSuggested Learning Experiences\tSuggested Key Inquiry Question(s)"
                    ]
                },
                {
                    "substrand_number": "1.2.1",
                    "substrand_name": "Reading: Extensive Reading",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "select appropriate reading materials in collaboration with peers,",
                        "read a variety of materials independently for information and pleasure,",
                        "use reference materials to find the required information,",
                        "judge the suitability of sample extensive reading materials."
                    ],
                    "suggested_learning_experiences": [
                        "select age-appropriate reference materials from print and non-print sources,",
                        "read selected reference materials independently,",
                        "search for information on child labour from reference materials,",
                        "compile a list of new words and their meaning,",
                        "create a crossword puzzle from the list of new words,",
                        "make notes on the information they have obtained."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Extensive Reading  (3 lessons)\tBy the end of the Sub Strand, the learner should be able to: a)\tselect appropriate reading materials in collaboration with peers, b)\tread a variety of materials independently for information and pleasure, c)\tuse reference materials to find the required information, d)\tjudge the suitability of sample extensive reading materials.\t The learner is guided to: •\tselect age-appropriate reference materials from print and non-print sources, •\tread selected reference materials independently, •\tsearch for information on child labour from reference materials, •\tcompile a list of new words and their meaning, •\tcreate a crossword puzzle from the list of new words, •\tmake notes on the information they have obtained.",
                        "How do you select the books you read?",
                        "Why do you read books?"
                    ],
                    "core_competencies": [
                        "Digital Literacy: The learner uses digital technology as they select age-appropriate reference materials from digital sources.",
                        "Communication and Collaboration: The learner recognises the values of others’ ideas when selecting appropriate reading materials in collaboration with peers."
                    ],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": [
                        "The learner is able to relate the skills acquired in listening comprehension to the acquisition of listening skills in Kiswahili.",
                        "Strand\tSub Strand\tSpecific\tLearning Outcomes\tSuggested Learning Experiences\tSuggested Key Inquiry Question(s)"
                    ]
                },
                {
                    "substrand_number": "1.3.1",
                    "substrand_name": "Grammar in Use: Word Classes",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "identify determiners some, enough, each, and a lot of, in texts,",
                        "use determiners some, enough, each, and a lot of, in sentences correctly,",
                        "collaborate with peers to judge the correct use of determiners in sentences."
                    ],
                    "suggested_learning_experiences": [
                        "identify the determiners",
                        "some, enough, each and a lot of in sentences,",
                        "complete online quizzes and exercises involving the use of some, enough, each, and a lot of,",
                        "construct sentences using determiners,",
                        "make sentences using",
                        "determiners from substitution tables,",
                        "correct the sentences constructed by a peer,",
                        "work in groups and determine the correctness of a sample of sentences."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Word Classes   (3 lessons) Determiners - some, enough, each, and a lot of\tBy the end of the Sub Strand, the learner should be able to: a)\tidentify determiners some, enough, each, and a lot of, in texts, b)\tuse determiners some, enough, each, and a lot of, in sentences correctly, c)\tcollaborate with peers to judge the correct use of determiners in sentences.\tThe learner is guided to: •\tidentify the determiners some, enough, each and a lot of in sentences, •\tcomplete online quizzes and exercises involving the use of some, enough, each, and a lot of, •\tconstruct sentences using determiners, •\tmake sentences using determiners from substitution tables, •\tcorrect the sentences constructed by a peer, •\twork in groups and determine the correctness of a sample of sentences.",
                        "How do we express the quantity or amount of something?",
                        "Why should we give the exact amount of something?"
                    ],
                    "core_competencies": [
                        "Communication and Collaboration: The learner contributes to group decision making when identifying sentences featuring determiners from a print or digital text.",
                        "Digital Literacy: The learner interacts with technology when completing online quizzes and exercises involving the use of determiners."
                    ],
                    "values": [
                        "Social justice: The learner fosters fairness by reviewing the sentences constructed by a peer.",
                        "Responsibility: The learner engages in assigned roles as they construct sentences using determiners."
                    ],
                    "pcis": [
                        "Peace Education: The learner nurtures social cohesion as they work in groups to determine the correctness of a sample of sentences."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to relate the concept of determiners when editing their written work in Kiswahili.",
                        "Strand\tSub Strand\tSpecific Learning Outcomes\tSuggested Learning Experiences\tSuggested Key Inquiry Question(s)"
                    ]
                },
                {
                    "substrand_number": "1.4.1",
                    "substrand_name": "Writing: Guided Writing",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "record specific details on forms to convey information,",
                        "design a form to provide the required information,",
                        "advocate the importance of filling forms correctly."
                    ],
                    "suggested_learning_experiences": [
                        "discuss different types of forms they have filled in groups,",
                        "work jointly to search for",
                        "relevant sample forms from the internet,",
                        "download relevant forms and fill them,",
                        "fill in the basic details, personal information, and the why details in a form,",
                        "design a form with basic,",
                        "personal, and why details in small groups."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Guided Writing  (3 lessons)  Fill in forms\tBy the end of the Sub Strand, the learner should be able to: a)\trecord specific details on forms to convey information, b)\tdesign a form to provide the required information, c)\tadvocate the importance of filling forms correctly.\tThe learner is guided to: •\tdiscuss different types of forms they have filled in groups, •\twork jointly to search for relevant sample forms from the internet, •\tdownload relevant forms and fill them, •\tfill in the basic details, personal information, and the why details in a form, •\tdesign a form with basic, personal, and why details in small groups.",
                        "Why do we fill forms?",
                        "Why is it important to fill forms accurately and correctly?"
                    ],
                    "core_competencies": [
                        "Creativity and Imagination: The learner gains new perspectives on how to undertake a task as they design forms.",
                        "Digital Literacy: The learner manipulates digital devices as they search, download, and fill in the relevant information in forms."
                    ],
                    "values": [
                        "Social Justice: The learner fosters fairness by according equal opportunities to peers when searching for relevant sample forms from the internet."
                    ],
                    "pcis": [
                        "Social cohesion: The learner nurtures social cohesion as they design a form with basic, personal, and why details in small groups."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to relate the concept of filling forms to the learning of the same concept in Kiswahili."
                    ]
                }
            ]
        },
        {
            "strand_number": "2.0",
            "strand_name": "THEME 2.0: CULTURAL AND RELIGIOUS CELEBRATIONS",
            "substrands": [
                {
                    "substrand_number": "2.1.1",
                    "substrand_name": "Listening and Speaking: Pronunciation and",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "identify proverbs from a text for effective communication,",
                        "listen for the main idea and specific details from a text,",
                        "use words and expressions such as similes, metaphors and proverbs containing selected sounds correctly,"
                    ],
                    "suggested_learning_experiences": [
                        "listen to a",
                        "comprehension",
                        "passage of about 150 words,",
                        "pronounce words containing the sounds",
                        "/l/ and /r/,",
                        "say tongue twisters with the target sounds after the teacher,",
                        "work jointly to give the meaning of new words and use them in sentences,"
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Pronunciation and Listening Comprehension  (3 lessons)\tBy the end of the Sub Strand, the learner should be able to: a)\tidentify proverbs from a text for effective communication, b)\tlisten for the main idea and specific details from a text, c)\tuse words and expressions such as similes, metaphors and proverbs containing selected sounds correctly,\tThe learner is guided to: •\tlisten to a comprehension passage of about 150 words, •\tpronounce words containing the sounds /l/ and /r/, •\tsay tongue twisters with the target sounds after the teacher, •\twork jointly to give the meaning of new words and use them in sentences,",
                        "Why should you pronounce words correctly?",
                        "Why do we use proverbs?    \t\td) value the importance of attentive listening in communication.\t•\tuse expressions correctly, for example, -\tmetaphor: Peter is a giraffe- he is so tall. -\tidiom: a red letter day, kill two birds with one stone, feel at home -\tproverbs: charity begins at home, -\tphrasal verb: pass by, look forward to, look for, look at, -\tuse the expressions to create a paragraph."
                    ],
                    "core_competencies": [
                        "Self-efficacy: The learner expresses themselves clearly as they practise pronouncing words containing the sounds",
                        "/l/ and /r/.",
                        "Creativity and Imagination: The learner undertakes group tasks as they use proverbs to create a paragraph in pairs or groups."
                    ],
                    "values": [
                        "Unity is enhanced as the learner works jointly with peers to give the meaning of new words and use them in sentence"
                    ],
                    "pcis": [
                        "Cultural awareness: this is enhanced as the learner interacts with common sayings and expressions from different cultures."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to link the concept of usinf expressions to their learning in Kiswahili.",
                        "Strand\tSub Strand\tSpecific Learning Outcomes\tSuggested Learning Experiences\tSuggested Key Inquiry Question(s)"
                    ]
                },
                {
                    "substrand_number": "2.2.1",
                    "substrand_name": "Reading: Intensive Reading",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "identify characters and events in a text for comprehension,",
                        "predict events in a text accurately,",
                        "answer factual and inferential questions correctly for comprehension,",
                        "create mental images from the events in poems and stories,",
                        "judge the characters or events in a story in collaboration with peers."
                    ],
                    "suggested_learning_experiences": [
                        "read a poem or story and identify the characters and events,",
                        "read a story of about 500 words and predict the events,",
                        "answer factual and inferential questions,",
                        "collaborate with peers to recite a poem,",
                        "summarise events in a story by retelling it in small groups,",
                        "create crossword puzzles using learnt vocabulary,",
                        "collaborate with peers to",
                        "describe characters or places in poems or stories."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Intensive Reading  (3 lessons)  •\tComprehension strategies\tBy the end of the Sub Strand, the learner should be able to: a)\tidentify characters and events in a text for comprehension, b)\tpredict events in a text accurately, c)\tanswer factual and inferential questions correctly for comprehension, d)\tcreate mental images from the events in poems and stories, e)\tjudge the characters or events in a story in collaboration with peers.\tThe learner is guided to: •\tread a poem or story and identify the characters and events, •\tread a story of about 500 words and predict the events, •\tanswer factual and inferential questions, •\tcollaborate with peers to recite a poem, •\tsummarise events in a story by retelling it in small groups, •\tcreate crossword puzzles using learnt vocabulary, •\tcollaborate with peers to describe characters or places in poems or stories.",
                        "Why do we enjoy reading stories and poems?",
                        "Which stories and poems have you read?"
                    ],
                    "core_competencies": [
                        "Communication and Collaboration: The learner recognises the value of others’ opinions as they work with peers to describe characters or events in poems and stories.",
                        "Creativity and Imagination: The learner undertakes tasks that encourage artistic expression of ideas while creating crossword puzzles using learnt vocabulary."
                    ],
                    "values": [
                        "Respect: The learner respects the opinion of others as they collaborate with peers to recite a poem.",
                        "Love: The learner shows a caring attitude as they collaborate with peers to describe characters or places in poems or stories."
                    ],
                    "pcis": [
                        "Life Skills: Effective communication is enhanced as the learner becomes more proficient in reading."
                    ],
                    "links_to_other_subjects": [
                        "The skill of predicting events in a story is relevant to the concept of storytelling in Religious Education.",
                        "Strand\tSub Strand\tSpecific Learning Outcomes\tSuggested Learning Experiences\tSuggested Key Inquiry",
                        "Question (s)"
                    ]
                },
                {
                    "substrand_number": "2.3.1",
                    "substrand_name": "Grammar in Use: Word Classes",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "identify concrete and abstract nouns from a text,",
                        "use concrete and abstract nouns correctly in a variety of contexts,",
                        "appreciate the role of concrete and abstract nouns in communication."
                    ],
                    "suggested_learning_experiences": [
                        "listen to a story, conversation or poem containing abstract nouns and concrete nouns,",
                        "collaborate to pick out concrete and abstract nouns from a story,",
                        "conversation or poem,",
                        "work with peers to construct sentences using concrete and abstract nouns,",
                        "make sentences from a substitution table featuring concrete and abstract nouns,",
                        "use a laptop, tablet, computer, manila paper, notebook, among others and create a crossword puzzle or a word search, with peers,",
                        "share the puzzle or word search through, email, other social media platforms, posters or the school notice",
                        "board."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Word Classes  (3 lessons)  •\tConcrete Nouns •\tAbstract Nouns\tBy the end of the Sub Strand, the learner should be able to: a)\tidentify concrete and abstract nouns from a text, b)\tuse concrete and abstract nouns correctly in a variety of contexts, c)\tappreciate the role of concrete and abstract nouns in communication.\tThe learner is guided to: •\tlisten to a story, conversation or poem containing abstract nouns and concrete nouns, •\tcollaborate to pick out concrete and abstract nouns from a story, conversation or poem, •\twork with peers to construct sentences using concrete and abstract nouns, •\tmake sentences from a substitution table featuring concrete and abstract nouns, •\tuse a laptop, tablet, computer, manila paper, notebook, among others and create a crossword puzzle or a word search, with peers, •\tshare the puzzle or word search through, email, other social media platforms, posters or the school notice board.",
                        "Which things can you see and touch in the classroom?",
                        "Which things cannot be seen or touched?"
                    ],
                    "core_competencies": [
                        "Communication and Collaboration: The learner recognises the value of others’ views as they make sentences using nouns.",
                        "Digital Literacy: The learner interacts with digital devices to create a crossword puzzle or a word search in pairs or groups."
                    ],
                    "values": [
                        "Love: The learner portrays a caring attitude as they collaborate to pick out concrete and abstract nouns from a story, conversation or poem.",
                        "Peace: The learner appreciates the importance of peers as they create a crossword puzzle or a word search."
                    ],
                    "pcis": [
                        "Life Skills: Effective communication is enhanced as the learner practises using nouns in communication."
                    ],
                    "links_to_other_subjects": [
                        "The skill of correct use of concrete and abstract nouns in a variety of contexts relates to the learning of nouns in Kiswahili.",
                        "Strand\tSub",
                        "Strand\tSpecific Learning Outcomes\tSuggested Learning Experiences\tSuggested Key Inquiry Question(s)"
                    ]
                },
                {
                    "substrand_number": "2.4.1",
                    "substrand_name": "Writing: Creative Writing",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "identify topics and possible ideas for open-ended compositions,",
                        "organise ideas in a paragraph logically,",
                        "create an open- ended composition on a variety of themes,",
                        "judge a narrative composition for correctness of language and relevance of topic."
                    ],
                    "suggested_learning_experiences": [
                        "list topics and possible ideas for open-ended compositions,",
                        "discuss in groups ideas and experiences on a given topic,",
                        "write down points to guide them in the writing of an open-ended composition on cultural and",
                        "religious celebrations of about 160-200 words,",
                        "collaborate to create the first paragraph,",
                        "use expressions, proverbs,",
                        "idioms fixed phrases, similes and metaphors appropriately in a composition,",
                        "complete the composition individually,",
                        "Proofread the composition and make necessary corrections,"
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Creative Writing  (3 lessons) Narrative Compositions\tBy the end of the Sub Strand, the learner should be able to: a)\tidentify topics and possible ideas for open-ended compositions, b)\torganise ideas in a paragraph logically, c)\tcreate an open- ended composition on a variety of themes, d)\tjudge a narrative composition for correctness of language and relevance of topic.\tThe learner is guided to: •\tlist topics and possible ideas for open-ended compositions, •\tdiscuss in groups ideas and experiences on a given topic, •\twrite down points to guide them in the writing of an open-ended composition on cultural and religious celebrations of about 160-200 words, •\tcollaborate to create the first paragraph, •\tuse expressions, proverbs, idioms fixed phrases, similes and metaphors appropriately in a composition, •\tcomplete the composition individually, •\tProofread the composition and make necessary corrections,",
                        "How can you make your composition interesting to read?",
                        "Why is it important to proofread your composition?    \t\t\t•\twork with peers to critique an open-ended composition while focusing on: -\torganisation of ideas (coherence) -\tcreativity -\trelevance of topic -\taccuracy of language -\t(grammar, choice of words, spelling) •\tgrade a composition written by peers."
                    ],
                    "core_competencies": [
                        "Creativity and Imagination: The learner organises ideas as they create compositions based on a variety of themes.",
                        "Learning to Learn: The learner carries out activities with peers as they brainstorm, research and list topics and possible ideas for open-ended compositions in pairs or groups."
                    ],
                    "values": [
                        "Social Justice: The learner fosters inclusivity and non-discrimination as they grade a composition written by peers.",
                        "Integrity: The learner follows laid-down procedures when grading peer´s composition."
                    ],
                    "pcis": [
                        "Cultural Awareness: The learner interacts with information on culture as they plan and write an open-ended composition on cultural and religious celebrations."
                    ],
                    "links_to_other_subjects": [
                        "The skills acquired in composition writing are relevant to the writing of essays in Social Studies."
                    ]
                }
            ]
        },
        {
            "strand_number": "3.0",
            "strand_name": "THEME 3.0: ETIQUETTE - TELEPHONE",
            "substrands": [
                {
                    "substrand_number": "3.1.1",
                    "substrand_name": "Listening and Speaking: Pronunciation and Vocabulary",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "pronounce words with target sounds correctly,",
                        "use polite words and phrases in a variety of contexts,",
                        "use a variety of similes, proverbs, idioms and fixed phrases in oral communication,"
                    ],
                    "suggested_learning_experiences": [
                        "say words containing the sounds /æ/ and /ɜː/,",
                        "assess your peers as they pronounce words with the target sound,",
                        "identify polite words and phrases used in a",
                        "telephone conversation,",
                        "role-play a telephone conversation, with peers,",
                        "work with peers to use polite language to interrupt politely in sentences,\tWhy should we use polite words and phrases in a conversation?",
                        "d) collaborate with peers to judge",
                        "whether words or phrases have been used politely in a text.\t•\tpractise using expressions such as:",
                        "-\tfixed phrase: make friends,",
                        "-\tsimile: as proud as a peacock",
                        "-\tmetaphor: Peter is a giraffe; he is so tall",
                        "-\tidiom: feel at home",
                        "-\tproverbs: charity begins at home",
                        "-\tphrasal verb: pass by, look for, look at."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Pronunciation and Vocabulary  (3 lessons) Sounds /æ/ and /ɜː/\tBy the end of the Sub Strand, the learner should be able to: a)\tpronounce words with target sounds correctly, b)\tuse polite words and phrases in a variety of contexts, c)\tuse a variety of similes, proverbs, idioms and fixed phrases in oral communication,\tThe learner is guided to: •\tsay words containing the sounds /æ/ and /ɜː/, •\tassess your peers as they pronounce words with the target sound, •\tidentify polite words and phrases used in a telephone conversation, •\trole-play a telephone conversation, with peers, •\twork with peers to use polite language to interrupt politely in sentences,\tWhy should we use polite words and phrases in a conversation?    \t\td) collaborate with peers to judge whether words or phrases have been used politely in a text.\t•\tpractise using expressions such as: -\tfixed phrase: make friends, -\tsimile: as proud as a peacock -\tmetaphor: Peter is a giraffe; he is so tall -\tidiom: feel at home -\tproverbs: charity begins at home -\tphrasal verb: pass by, look for, look at."
                    ],
                    "core_competencies": [
                        "Communication: The learner’s ability to communicate effectively is developed as they practise clarity in speech through pronunciation of words with the target sounds."
                    ],
                    "values": [
                        "Responsibility: Accountability is enhanced as the learner demonstrates dependability when role-playing a telephone conversation, with peers."
                    ],
                    "pcis": [
                        "Life Skills: Effective communication is promoted as the learner practises pronouncing words and using polite language in communication."
                    ],
                    "links_to_other_subjects": [
                        "The skill of using polite language in a variety of contexts is relevant in the learning of harmonious living in Religious Education.",
                        "Strand\tSub",
                        "Strand\tSpecific Learning Outcomes\tSuggested Learning Experiences\tSuggested Key Inquiry Question(s)"
                    ]
                },
                {
                    "substrand_number": "3.2.1",
                    "substrand_name": "Reading: Intensive Reading",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "identify new words in a text for comprehension,",
                        "answer direct and inferential questions for comprehension,",
                        "infer the meaning of words, similes, proverbs, metaphors and idioms with straight forward meanings using contextual clues,",
                        "advocate the need to read intensively for lifelong learning."
                    ],
                    "suggested_learning_experiences": [
                        "skim and scan a text for specific information,",
                        "read a text of up to 500 words on etiquette,",
                        "answer direct and inferential questions,",
                        "use contextual clues such as",
                        "synonyms and antonyms as well as neighbouring words to infer the",
                        "meaning of fixed phrases, similes, metaphors, idioms, proverbs and phrasal verbs,",
                        "use a dictionary to check the meaning of unfamiliar words,",
                        "collaborate to create a crossword",
                        "puzzle using vocabulary from the text in groups."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Intensive Reading  (3 lessons)\tBy the end of the Sub Strand, the learner should be able to: a)\tidentify new words in a text for comprehension, b)\tanswer direct and inferential questions for comprehension, c)\tinfer the meaning of words, similes, proverbs, metaphors and idioms with straight forward meanings using contextual clues, d)\tadvocate the need to read intensively for lifelong learning.\tThe learner is guided to: •\tskim and scan a text for specific information, •\tread a text of up to 500 words on etiquette, •\tanswer direct and inferential questions, •\tuse contextual clues such as synonyms and antonyms as well as neighbouring words to infer the meaning of fixed phrases, similes, metaphors, idioms, proverbs and phrasal verbs, •\tuse a dictionary to check the meaning of unfamiliar words, •\tcollaborate to create a crossword puzzle using vocabulary from the text in groups.",
                        "How do you obtain information from a text?",
                        "Why do you need to infer the meaning of unfamiliar words?"
                    ],
                    "core_competencies": [
                        "Learning to Learn: The learner’s ability to learn on their own is encouraged as they complete tasks and infer the meaning of words using contextual clues.",
                        "Creativity and Imagination: The learner’s artistic prowess is enriched as they generate ideas when creating a crossword puzzle using vocabulary from the text read."
                    ],
                    "values": [
                        "Unity: Cooperation is cultivated as the learner displays team spirit while creating a crossword puzzle using vocabulary from the text read."
                    ],
                    "pcis": [
                        "Social cohesion: The learner acquires the skills of living harmoniously with others by reading texts on etiquette."
                    ],
                    "links_to_other_subjects": [
                        "The skill of intensive reading is a critical study skill as learners interact with varied texts in Pre-Technical Studies and Religious Education",
                        "Strand\tSub Strand\tSpecific Learning Outcomes\tSuggested Learning Experiences\tSuggested Key Inquiry Question(s)"
                    ]
                },
                {
                    "substrand_number": "3.3.1",
                    "substrand_name": "Grammar in Use: Correlative Conjunctions",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "identify correlative conjunctions in an oral or written text,",
                        "use correlative conjunctions correctly in oral and written communication,",
                        "use the pattern show… nominal… how/where/who in sentences,"
                    ],
                    "suggested_learning_experiences": [
                        "identify the pattern: use of show… nominal… how/where/who in a text,",
                        "use correlative conjunctions either…or/neither…nor in sentences,",
                        "construct sentences using show… nominal… how/where/who,",
                        "fill in blanks in provided sentences to practise the use of the pattern how/where/who,",
                        "search for instances in which correlative conjunctions either…or/neither are used in newspapers or magazines or the internet.\tWhich words do we use when making a choice between two things?",
                        "d) acknowledge the",
                        "importance of using",
                        "well-formed sentences in communication."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Correlative Conjunctions  (3 lessons)  Indicate content\tBy the end of the Sub Strand, the learner should be able to: a)\tidentify correlative conjunctions in an oral or written text, b)\tuse correlative conjunctions correctly in oral and written communication, c)\tuse the pattern show… nominal… how/where/who in sentences,\tThe learner is guided to: •\tidentify the pattern: use of show… nominal… how/where/who in a text, •\tuse correlative conjunctions either…or/neither…nor in sentences, •\tconstruct sentences using show… nominal… how/where/who, •\tfill in blanks in provided sentences to practise the use of the pattern how/where/who, •\tsearch for instances in which correlative conjunctions either…or/neither are used in newspapers or magazines or the internet.\tWhich words do we use when making a choice between two things? \t\td) acknowledge the importance of using well-formed sentences in communication."
                    ],
                    "core_competencies": [
                        "Digital Literacy: The learner’s ability to use technology for learning is enhanced as they search from online",
                        "sources for instances in which correlative conjunctions either…or/neither are used in newspapers or magazines.",
                        "Creativity and Imagination: The learner’s ability to create is developed as they create short dialogues using sentence patterns."
                    ],
                    "values": [
                        "Responsibility: This is inculcated as the learner observes safety precautions when searching on the internet for instances in which correlative conjunctions either…or/neither…nor are used."
                    ],
                    "pcis": [
                        "Life skills: Effective communication is enhanced as the learner practises the use of correlative conjunctions in a variety of sentences and contexts."
                    ],
                    "links_to_other_subjects": [
                        "The concept of correlative conjunctions is relevant in the learning and use of conjunctions in Kiswahili.",
                        "Strand\tSub Strand\tSpecific Learning Outcome\tSuggested Learning Experiences\tSuggested Key Inquiry Question(s)"
                    ]
                },
                {
                    "substrand_number": "3.4.1",
                    "substrand_name": "Writing: Mechanics of Writing",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "identify numerals, common abbreviations and acronyms from a text,",
                        "compose a story incorporating acronyms, abbreviations and numerals,",
                        "use similes, proverbs, metaphors and idioms with straight forward meanings in a composition,",
                        "judge correctness of abbreviations, numerals and acronyms used in a text."
                    ],
                    "suggested_learning_experiences": [
                        "search for numerals, common abbreviations and acronyms from the internet,",
                        "create a crossword puzzle",
                        "featuring numerals, common abbreviations and acronyms in groups,",
                        "display the crossword puzzles in class for peer review,",
                        "use expressions such as",
                        "idioms, similes and metaphors correctly,",
                        "compose a story of about",
                        "(150-200 words) incorporating common acronyms,",
                        "abbreviations, numerals."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Mechanics of Writing  (3 lessons)  •\tAcronyms •\tAbbreviations •\tNumerals\tBy the end of the Sub Strand, the learner should be able to: a)\tidentify numerals, common abbreviations and acronyms from a text, b)\tcompose a story incorporating acronyms, abbreviations and numerals, c)\tuse similes, proverbs, metaphors and idioms with straight forward meanings in a composition, d)\tjudge correctness of abbreviations, numerals and acronyms used in a text.\tThe learner is guided to: •\tsearch for numerals, common abbreviations and acronyms from the internet, •\tcreate a crossword puzzle featuring numerals, common abbreviations and acronyms in groups, •\tdisplay the crossword puzzles in class for peer review, •\tuse expressions such as idioms, similes and metaphors correctly, •\tcompose a story of about (150-200 words) incorporating common acronyms, abbreviations, numerals.",
                        "Why do we use abbreviations and acronyms?",
                        "How do we write numerals?"
                    ],
                    "core_competencies": [
                        "Communication: The learner’s ability to write clearly and correctly is improved as they write a story incorporating common acronyms, abbreviations, numerals.",
                        "Digital Literacy: The learner’s use of technology is enriched as they manipulate digital devices to search for common abbreviations and acronyms from the internet."
                    ],
                    "values": [
                        "Love: This is displayed as the learner portrays a caring attitude when peer reviewing the crossword puzzles displayed in class."
                    ],
                    "pcis": [
                        "Peaceful co-existence: Harmonious living is promoted by the learner while engaging in collaborative writing tasks and displaying of their work."
                    ],
                    "links_to_other_subjects": [
                        "The use of acronyms, abbreviations, numerals is critical in learning of Mathematics and Agriculture."
                    ]
                }
            ]
        },
        {
            "strand_number": "4.0",
            "strand_name": "THEME 4.0: EMERGENCY RESCUE SERVICES",
            "substrands": [
                {
                    "substrand_number": "4.1.1",
                    "substrand_name": "Listening and Speaking: Pronunciation and",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "select words with the target sound /ʊə/ from a text,",
                        "use appropriate words, similes and proverbs with straight forward meanings in day-to- day communication,",
                        "distinguish nouns, verbs and adjectives by stressing syllables correctly,"
                    ],
                    "suggested_learning_experiences": [
                        "pronounce words containing the sound /ʊə/,",
                        "say words with same spelling but different meanings,",
                        "work with peers to distinguish",
                        "verbs, nouns and adjectives on the basis of stress, for example,",
                        "extract/extract, perfect /perfect,",
                        "listen to a story related to an emergency and pick out words such as red cross, ambulance,",
                        "emergency, flying doctors, rescue, security, epidemic, amputate, aid, stroke,"
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Pronunciation and Vocabulary  (3 lessons)\tBy the end of the Sub Strand, the learner should be able to a)\tselect words with the target sound /ʊə/ from a text, b)\tuse appropriate words, similes and proverbs with straight forward meanings in day-to- day communication, c)\tdistinguish nouns, verbs and adjectives by stressing syllables correctly,\tThe learner is guided to: •\tpronounce words containing the sound /ʊə/, •\tsay words with same spelling but different meanings, •\twork with peers to distinguish verbs, nouns and adjectives on the basis of stress, for example, extract/extract, perfect /perfect, •\tlisten to a story related to an emergency and pick out words such as red cross, ambulance, emergency, flying doctors, rescue, security, epidemic, amputate, aid, stroke,",
                        "Which words have the same spelling but different meanings?",
                        "Why is it important to pronounce words accurately?    \t\td)\tapply stress on content words and helping verbs for speech clarity, e)\tadvocate the correct use of stress in oral communication\t•\tuse the identified words in sentences, •\twork with peers to make a recording of a poetry recitation, •\tsing a song on emergency rescue services and lay emphasis on content words, •\tview a video of a recitation of a poem and identify the stressed words, •\tmake recordings as they pronounce words and read sentences while applying the stress correctly, •\tuse expressions such as similes, metaphors, idioms, fixed phrases and proverbs in a written text. Expressions may include: fixed phrases: Catch fire, on fire, cause for alarm, in time, on time, lose control, all day long, all day similes: As fast as lightning, as light as a feather, as helpless as a baby, as cunning as a fox, metaphors: The boy was a fox, he was so cunning. proverb: Prevention is better than cure, There is no smoke\t    \t\t\twithout fire, A stitch in time saves nine, All is well that ends well, idioms: Face the music, play with fire, in the nick of time, get into hot water, breakneck speed phrasal verb: Care for, disagree with, end in tears, put out."
                    ],
                    "core_competencies": [
                        "Communication: The learner’s ability to speak effectively is improved as they pronounce words containing the target sound.",
                        "Digital Literacy: The learner’s ability to interact with technology is enchanced as they make recordings of songs and poetry recitations."
                    ],
                    "values": [
                        "Unity: The learner strives to achieve a common goal while working with peers to distinguish verbs, nouns and adjectives on the basis of stress."
                    ],
                    "pcis": [
                        "Health Education: This is enhanced as learner interacts with content related to emergency rescue services."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to relate the skill of pronouncing words correctly when learning sounds in Kiswahili.",
                        "Strand\tSub Strand\tSpecific Learning Outcomes\tSuggested Learning Experiences\tSuggested Key Inquiry Question(s)"
                    ]
                },
                {
                    "substrand_number": "4.2.1",
                    "substrand_name": "Reading: Intensive Reading",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "predict events from visuals,",
                        "create images from viewed, read or heard texts,",
                        "answer direct and inferential questions correctly for comprehension,",
                        "assess the relevance of visuals in a text."
                    ],
                    "suggested_learning_experiences": [
                        "read a variety of visuals related to the emergency rescue services,",
                        "infer the meaning of words such as unconscious, casualty, oxygen mask, hazard, precaution, prepare, critical, escape, care,",
                        "intensive care unit, watch out, from the passage,",
                        "make predictions about a story based on the visuals.",
                        "create a story from visuals and retell it,",
                        "collaborate with peers to judge the relevance of visuals,",
                        "watch videos, mimes or cartoons and answer questions based on",
                        "the texts."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Intensive Reading  (3 lessons)  Visuals\tBy the end of the Sub Strand, the learner should be able to: a)\tpredict events from visuals, b)\tcreate images from viewed, read or heard texts, c)\tanswer direct and inferential questions correctly for comprehension, d)\tassess the relevance of visuals in a text.\tThe learner is guided to: •\tread a variety of visuals related to the emergency rescue services, •\tinfer the meaning of words such as unconscious, casualty, oxygen mask, hazard, precaution, prepare, critical, escape, care, intensive care unit, watch out, from the passage, •\tmake predictions about a story based on the visuals. •\tcreate a story from visuals and retell it, •\tcollaborate with peers to judge the relevance of visuals, •\twatch videos, mimes or cartoons and answer questions based on the texts.",
                        "How can we communicate without using words?",
                        "What information can we obtain from pictures?"
                    ],
                    "core_competencies": [
                        "Collaboration: The learner’s ability to work harmoniously with others is developed as they recognise the rules of engagement and collaborate with peers to judge the relevance of visuals.",
                        "Digital Literacy: The learner’s ability to interact with digital technology is improved as they watch videos, mimes or cartoons and answer questions based on the texts."
                    ],
                    "values": [
                        "Responsibility: This is inculcated in the learner as they proactively learn to solve problems by working with peers to interpret visuals related to the theme."
                    ],
                    "pcis": [
                        "Safety and security: The learner’s sense of safety is enhanced as they interact with information and texts on emergency rescue services."
                    ],
                    "links_to_other_subjects": [
                        "The skills required in creating stories from visuals relates to skills of creating in Creative Arts.",
                        "Strand\tSub Strand\tSpecific Learning Outcomes\tSuggested Learning Experiences\tSuggested Key Inquiry",
                        "Question(s)"
                    ]
                },
                {
                    "substrand_number": "4.3.1",
                    "substrand_name": "Grammar in Use: Word Classes",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "identify relative and indefinite pronouns in a text,",
                        "use relative and indefinite pronouns correctly in oral and written texts,",
                        "judge the correctness of sentences featuring relative and indefinite pronouns from various texts."
                    ],
                    "suggested_learning_experiences": [
                        "identify relative pronouns such as ‘that,’ ‘which’ ‘who,’ ‘whom,’ and ‘whose’ from a text,",
                        "construct sentences using relative pronouns,",
                        "complete sentences on emergency rescue services featuring relative pronouns,",
                        "use indefinite pronouns such as anyone, anything, everybody, everyone, everything, nobody,",
                        "somebody, and someone from a text,",
                        "complete a crossword puzzle featuring the words: red cross, ambulance,",
                        "emergency, flying doctors one way, two way, dual carriage way, guard rails,",
                        "culverts,",
                        "form sentences using indefinite",
                        "doctors one way, two way, dual carriage way, guard rails, culverts,",
                        "collaborate with others to judge the correctness of sentences from a sample text,",
                        "create posters, crossword puzzles or",
                        "charts featuring relative and indefinite pronouns and share in class."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Word Classes (3 lessons) •\tRelative Pronouns •\tIndefinite Pronouns\tBy the end of the Sub Strand, the learner should be able to: a)\tidentify relative and indefinite pronouns in a text, b)\tuse relative and indefinite pronouns correctly in oral and written texts, c)\tjudge the correctness of sentences featuring relative and indefinite pronouns from various texts.\tThe learner is guided to: •\tidentify relative pronouns such as ‘that,’ ‘which’ ‘who,’ ‘whom,’ and ‘whose’ from a text, •\tconstruct sentences using relative pronouns, •\tcomplete sentences on emergency rescue services featuring relative pronouns, •\tuse indefinite pronouns such as anyone, anything, everybody, everyone, everything, nobody, somebody, and someone from a text, •\tcomplete a crossword puzzle featuring the words: red cross, ambulance, emergency, flying doctors one way, two way, dual carriage way, guard rails, culverts, •\tform sentences using indefinite pronouns, nouns and the words red cross, ambulance, emergency, flying\tWhich words do we use to refer to people or things without saying who or what they are exactly?    \t\t\tdoctors one way, two way, dual carriage way, guard rails, culverts, •\tcollaborate with others to judge the correctness of sentences from a sample text, •\tcreate posters, crossword puzzles or charts featuring relative and indefinite pronouns and share in class."
                    ],
                    "core_competencies": [
                        "Communication: The learner’s speaking and writing skills are sharpened as they use relative and indefinite pronouns to construct sentences.",
                        "Self-efficacy: The learner’s confidence in themselves is enhanced as they plan efficiently and create posters, crossword puzzles or charts featuring relative and indefinite pronouns."
                    ],
                    "values": [
                        "Love: This is cultivated in the learner as they put the interest of others before own during the display of their work and appreciation of the projects accomplished by their peers."
                    ],
                    "pcis": [
                        "Health Education: The learner gains knowledge and skills on health education as they interact and write sentences related to emergency rescue services, featuring relative pronouns."
                    ],
                    "links_to_other_subjects": [
                        "Correct use of relative and indefinite pronouns is relevant in the learning of Kiswahili.",
                        "Strand\tSub Strand",
                        "Specific Learning Outcomes",
                        "Suggested Learning Experiences\tSuggested Key Inquiry Question(s)"
                    ]
                },
                {
                    "substrand_number": "4.4.1",
                    "substrand_name": "Writing: Functional Writing",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "identify the key features of a formal letter,",
                        "create a formal invitation letter using the correct format,",
                        "judge a formal letter for correctness of language and relevance."
                    ],
                    "suggested_learning_experiences": [
                        "go through a sample formal letter and identify its components,",
                        "search and download samples of formal letters online,",
                        "collaborate to plan a formal invitation letter,",
                        "write the formal letter individually,",
                        "proofread the letter and make corrections,",
                        "display the letter in the classroom, noticeboard or posters,",
                        "upload the invitation letter",
                        "online or send through email, WhatsApp, among others, to peers,"
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Functional Writing  (3 lessons)  •\tFormal letter\tBy the end of the Sub Strand, the learner should be able to a)\tidentify the key features of a formal letter, b)\tcreate a formal invitation letter using the correct format, c)\tjudge a formal letter for correctness of language and relevance.\tThe learner is guided to: •\tgo through a sample formal letter and identify its components, •\tsearch and download samples of formal letters online, •\tcollaborate to plan a formal invitation letter, •\twrite the formal letter individually, •\tproofread the letter and make corrections, •\tdisplay the letter in the classroom, noticeboard or posters, •\tupload the invitation letter online or send through email, WhatsApp, among others, to peers,",
                        "Why do you write letters?",
                        "Which kinds of letters do you write?    \t\t\t•\twrite an invitation letter to the County NTSA Officer, Red Cross or St. John Ambulance representative and requesting for a talk on emergency response to your schools, scouts movement, Red Cross or St. John Ambulance club."
                    ],
                    "core_competencies": [
                        "Collaboration: The learner’s ability to work with others is enhanced as they collaborate to plan a formal invitation letter.",
                        "Digital Literacy: The learner’s ability to interact with technological devices is enhanced as they access learning materials in digital platforms by searching for sample letters online and downloading them."
                    ],
                    "values": [
                        "Responsibility: This is enhanced as the learner engages in assigned roles when proofreading the letter and making corrections."
                    ],
                    "pcis": [
                        "Health and Safety (Online Safety): The learner observes online safety as they upload the invitation letter online or send through email, WhatsApp, among others, to peers."
                    ],
                    "links_to_other_subjects": [
                        "The skill of writing invitation letters is related to the writing of letters in Kiswahili."
                    ]
                }
            ]
        },
        {
            "strand_number": "5.0",
            "strand_name": "THEME 5.0: OUR TOURIST ATTRACTIONS",
            "substrands": [
                {
                    "substrand_number": "5.1.1",
                    "substrand_name": "Listening and Speaking: Pronunciation and",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "listen for specific information and the main idea for self-expression,",
                        "respond to oral questions based on the theme,",
                        "use expressions such as similes, metaphors and"
                    ],
                    "suggested_learning_experiences": [
                        "listen to correct pronunciation of sounds, words, and phrases from the teacher, audio-visual recordings among others,",
                        "work with peers to say words and",
                        "phrases with the sounds /ð / and /θ / and assist one another,",
                        "listen to a poem on tourist attraction sites in Kenya and recite it.",
                        "respond to questions on the poem,",
                        "use the following expressions in sentences:"
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Pronunciation and Vocabulary\tBy the end of the Sub Strand, the learner should be able to: a)\tlisten for specific information and the main idea for self-expression, b)\trespond to oral questions based on the theme, c)\tuse expressions such as similes, metaphors and\tThe learner is guided to: •\tlisten to correct pronunciation of sounds, words, and phrases from the teacher, audio-visual recordings among others, •\twork with peers to say words and phrases with the sounds /ð / and /θ / and assist one another, •\tlisten to a poem on tourist attraction sites in Kenya and recite it. •\trespond to questions on the poem, •\tuse the following expressions in sentences:",
                        "Why should we pronounce sounds correctly?",
                        "What information do we obtain when we listen keenly? \t(3 lessons)\t\t\t \t•\tListening for main idea •\tListening for specific information\t\t\t    \t•\tSounds /ð / and /θ /\tproverbs in oral communication, d) advocate the importance of listening comprehension\tfixed phrases: make friends, be careful, fall asleep, in future, in a hurry simile: as brave as a lion; as blind as a bat metaphor: She is a lion. She is so brave proverbs: Prevention is better than cure, seeing is believing, the early bird catches the worm idioms: Sick as a dog, you are what you eat, kick the habit, let the cat out of the bag, would not hurt a fly phrasal verbs: Go away, go back, pick up, get away…the antelope got away from the lion."
                    ],
                    "core_competencies": [
                        "Citizenship: The learner’s sense of patriotism is enhanced as they develop interest in socio-cultural and economic activities by interacting with poems on Kenya’s tourist attraction sites.",
                        "Self-efficacy: The learner’s ability to pay attention to detail is brought out as they use varied expressions in sentences to express themselves."
                    ],
                    "values": [
                        "Social Justice: This is inculcated as the learner assists others to say words and phrases with the sounds /ð / and /θ/ without discrimination."
                    ],
                    "pcis": [
                        "Wildlife and tourism: This is promoted as the learners are exposed to information on our tourist attraction sites by listening to poems on the theme."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to relate the vocabulary learnt to similar content in Social Studies.",
                        "Strand\tSub Strand\tSpecific Learning Outcomes\tSuggested Learning Experiences\tSuggested Key Inquiry",
                        "Question(s)"
                    ]
                },
                {
                    "substrand_number": "5.2.1",
                    "substrand_name": "Reading: Extensive Reading",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "select appropriate reading materials from varied texts,",
                        "read a variety of texts for enjoyment and general understanding,",
                        "assess a text for appropriateness and relevance."
                    ],
                    "suggested_learning_experiences": [
                        "preview a text by focusing on the",
                        "title, author, among others (fiction/ non-fiction) 1251- 1500 words),",
                        "collaborate to determine the appropriateness of a reading text,",
                        "skim texts on the theme of tourist attraction sites in Kenya to find out the general idea,",
                        "scan a text to find specific details such as key words,",
                        "select and read an appropriate reading material based on their interest."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Extensive Reading  (2lessons)  Fiction/ Non- Fiction (1251- 1500 words)\tBy the end of the Sub Strand, the learner should be able to: a)\tselect appropriate reading materials from varied texts, b)\tread a variety of texts for enjoyment and general understanding, c)\tassess a text for appropriateness and relevance.\tThe learner is guided to: •\tpreview a text by focusing on the title, author, among others (fiction/ non-fiction) 1251- 1500 words), •\tcollaborate to determine the appropriateness of a reading text, •\tskim texts on the theme of tourist attraction sites in Kenya to find out the general idea, •\tscan a text to find specific details such as key words, •\tselect and read an appropriate reading material based on their interest.",
                        "Why should we read a variety of materials?",
                        "How do you identify the book you want to read?"
                    ],
                    "core_competencies": [
                        "Learning to Learn: The learner’s ability to grasp information is enhanced as they interact with a variety of texts.",
                        "Critical Thinking and Problem Solving: The learner’s ability to solve simple problems is developed through selection and reading of appropriate texts based on their interest."
                    ],
                    "values": [
                        "Responsibility: This is cultivated in the learner as they undertake assigned roles when selecting and reading an appropriate reading material based on their interest."
                    ],
                    "pcis": [
                        "Patriotism: This is advocated for as the learner is exposed to information on our tourist attraction sites by reading texts on the said theme."
                    ],
                    "links_to_other_subjects": [
                        "The skill of extensive reading is appropriate in the learning and study of Agriculture.",
                        "Strand\tSub Strand\tSpecific Learning Outcomes\tSuggested Learning Experiences\tSuggested Key Inquiry Question (s)"
                    ]
                },
                {
                    "substrand_number": "5.3.1",
                    "substrand_name": "Grammar in Use: Adjectives (3 lessons)",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "identify simple, comparative and superlative forms of adjectives in print and digital texts correctly,",
                        "use simple, comparative and superlative forms of adjectives in oral and written texts,",
                        "acknowledge the importance of using adjectives correctly in communication."
                    ],
                    "suggested_learning_experiences": [
                        "identify adjectives in print and digital texts,",
                        "compare items using simple, comparative and superlative forms of adjectives,",
                        "collaborate with peers to make a list of regular and irregular adjectives,",
                        "create a crossword puzzle and a word search, using comparative and superlative adjectives,",
                        "display the completed",
                        "crossword puzzle and word search on posters or charts."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Adjectives (3 lessons) •\tComparative forms of adjectives •\tSuperlative forms of adjectives\tBy the end of the Sub Strand, the learner should be able to: a)\tidentify simple, comparative and superlative forms of adjectives in print and digital texts correctly, b)\tuse simple, comparative and superlative forms of adjectives in oral and written texts, c)\tacknowledge the importance of using adjectives correctly in communication.\tThe learner is guided to: •\tidentify adjectives in print and digital texts, •\tcompare items using simple, comparative and superlative forms of adjectives, •\tcollaborate with peers to make a list of regular and irregular adjectives, •\tcreate a crossword puzzle and a word search, using comparative and superlative adjectives, •\tdisplay the completed crossword puzzle and word search on posters or charts.",
                        "Which words do we use to describe people, things, and places?",
                        "How do we compare people, things, and events?"
                    ],
                    "core_competencies": [
                        "Self-efficacy: The learner’s ability to plan efficiently is developed as they create and display the crossword puzzles and word search.",
                        "Digital Literacy: The learner’s ability to manipulate digital devices is improved as they share work accomplished (crossword puzzles and word search) on posters and charts."
                    ],
                    "values": [
                        "Respect: This is inculcated as the learner collaborates with peers to make a list of regular and irregular adjectives while respecting diverse opinions."
                    ],
                    "pcis": [
                        "Safety and Security: The learner’s sense of security is promoted as the he/she learns about safety when interacting with animals and when they visit various tourist attraction sites."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to apply the knowledge of adjectives which are a key aspect in the grammar lessons in Kiswahili.",
                        "Strand\tSub Strand\tSpecific Learning Outcomes\tSuggested Learning Experiences\tSuggested Key Inquiry Question(s)"
                    ]
                },
                {
                    "substrand_number": "5.4.1",
                    "substrand_name": "Writing: Creative Writing",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "plan a narrative composition collaboratively,",
                        "organise ideas coherently, clearly, and logically for writing fluency,",
                        "create a narrative composition on a variety of topics.",
                        "judge a narrative composition for correctness of language, relevance of the topic and organisation of ideas."
                    ],
                    "suggested_learning_experiences": [
                        "identify the parts of a narrative composition,",
                        "work with peers to plan a narrative composition of about 160-200 words,",
                        "read sample narrative compositions with peers and critique them for:",
                        "-\tcorrectness of language",
                        "-\tflow or organisation of ideas",
                        "-\trelevance to the topic",
                        "-\tcreativity",
                        "use the steps of the writing process to create a narrative composition of about (160 - 200 words), on tourist",
                        "attraction sites,",
                        "use appropriate fixed phrases such as: catch fire;"
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Creative Writing (3 lessons)  •\tNarrative Compositions (160 – 200 words)\tBy the end of the Sub Strand, the learner should be able to: a)\tplan a narrative composition collaboratively, b)\torganise ideas coherently, clearly, and logically for writing fluency, c)\tcreate a narrative composition on a variety of topics. d)\tjudge a narrative composition for correctness of language, relevance of the topic and organisation of ideas.\tThe learner is guided to: •\tidentify the parts of a narrative composition, •\twork with peers to plan a narrative composition of about 160-200 words, •\tread sample narrative compositions with peers and critique them for: -\tcorrectness of language -\tflow or organisation of ideas -\trelevance to the topic -\tcreativity •\tuse the steps of the writing process to create a narrative composition of about (160 - 200 words), on tourist attraction sites, •\tuse appropriate fixed phrases such as: catch fire;",
                        "Why should we organise ideas in our compositions?",
                        "How can you make your writing interesting?    \t\t\tsimiles such as: as fast as lightning; metaphors such as: the boy was a fox. He was so cunning; proverbs such as: prevention is better than cure; idioms such as get into hot water; and phrasal verbs such as care for."
                    ],
                    "core_competencies": [
                        "Communication: The learner’s ability to communicate effectively is developed as they practise the skills of writing clearly by following the stages of the writing process and creating a narrative composition.",
                        "Creativity and Imagination: The learner’s artistic skills are enhanced as they create and write narrative compositions."
                    ],
                    "values": [
                        "Unity: Cooperation is displayed as the learner collaborates with peers to plan a narrative composition."
                    ],
                    "pcis": [
                        "Environmental Education: The learner interacts with information on tourist attraction sites when creating a narrative composition using the steps of the writing process thereby grasping knowledge on the environment."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to relate the concept of the writing process to their learning in Kiswahili."
                    ]
                }
            ]
        },
        {
            "strand_number": "6.0",
            "strand_name": "THEME 6.0: JOBS AND OCCUPATION - WORK ETHICS",
            "substrands": [
                {
                    "substrand_number": "6.1.1",
                    "substrand_name": "Listening and Speaking: Pronunciation and",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "identify words and phrases with the sounds /f/, /v/ and /əʊ/,",
                        "use vocabulary related to the theme in sentences correctly,",
                        "apply stress and intonation in questions, statements, and exclamatory sentences,",
                        "value the importance of stress and intonation in sentences."
                    ],
                    "suggested_learning_experiences": [
                        "say sounds, words, phrases, and sentences with the sounds /f/, /v/ and /əʊ/,",
                        "say tongue twisters with the sounds /f/ and /v/ and /əʊ/,",
                        "watch a video of a dialogue on work ethics and imitate the use of stress and",
                        "intonation by the speakers,",
                        "recite a choral verse, with peers,",
                        "sing songs featuring stress and intonation,",
                        "form sentences using the following expressions: fixed"
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Pronunciation and Vocabulary (3 lessons)  •\tSounds /f/, /v/\tand /cab •\tVocabulary •\tIntonation and stress\tBy the end of the Sub Strand, the learner should be able to: a)\tidentify words and phrases with the sounds /f/, /v/ and /əʊ/, b)\tuse vocabulary related to the theme in sentences correctly, c)\tapply stress and intonation in questions, statements, and exclamatory sentences, d)\tvalue the importance of stress and intonation in sentences.\t The learner is guided to: •\tsay sounds, words, phrases, and sentences with the sounds /f/, /v/ and /əʊ/, •\tsay tongue twisters with the sounds /f/ and /v/ and /əʊ/, •\twatch a video of a dialogue on work ethics and imitate the use of stress and intonation by the speakers, •\trecite a choral verse, with peers, •\tsing songs featuring stress and intonation, form sentences using the following expressions: fixed",
                        "Why do we put emphasis on some words and not others?",
                        "How can you vary your voice to convey different meanings?    \t\t\tphrases: Take care of, have no idea, you never know simile: As happy as king, as busy as a bee, work like a horse metaphor: Wambui is a bee. She is so busy. idioms: Lay off, hand in, take over, deal with, strike while the iron is hot, go the extra mile proverbs: Make hay while the sun shines. The sun does not wait for a king, Honesty is the best policy, Slow but sure wins the race, Jack of all trades, master of none phrasal verbs: grow up, take over, deal with, give up, go on."
                    ],
                    "core_competencies": [
                        "Communication: The learner’s ability to speak clearly and effectively is enhanced through practice and saying tongue twisters with the sounds /f/, /v/ and /əʊ/.",
                        "Self-efficacy: The learner’s ability to analyse is developed when they give their views as they form sentences using the given expressions."
                    ],
                    "values": [
                        "Integrity: This is enhanced as the learner practises accountability through watching a video of a dialogue on work ethics and imitating the use of stress and intonation by the speakers."
                    ],
                    "pcis": [
                        "Career Guidance: The learner’s grasp of careers is enhanced as they interact with information on work ethics by watching a dialogue."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to relate the concept of stress and intonation to their learning in Kiswahili.",
                        "Strand\tSub Strand\tSpecific Learning Outcomes\tSuggested Learning Experiences\tSuggested Key Inquiry Question(s)"
                    ]
                },
                {
                    "substrand_number": "6.2.1",
                    "substrand_name": "Reading: Intensive Reading",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "make connections between events in the text and prior experiences,",
                        "use contextual clues to infer the meaning of vocabulary such as words, proverbs, fixed phrases, similes, and phrasal verbs,",
                        "respond to a reading text for comprehension,",
                        "acknowledge the role of reading comprehension in lifelong learning."
                    ],
                    "suggested_learning_experiences": [
                        "relate the title and",
                        "illustrations/pictures with their personal experiences.",
                        "skim a text to obtain a general idea (dialogue of about 500 words),",
                        "scan a text on work ethics for specific details,",
                        "observe the cover, pictures, and read the title to make predictions,",
                        "infer the meaning of unknown words, similes, metaphors and fixed phrases from context,",
                        "create mental images (visualise) from read, viewed, or heard text,",
                        "retell events in a story/dialogue in their own words,",
                        "work with peers to make posters",
                        "featuring the new words he or she has learnt,",
                        "answer literal and inferential questions."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Intensive Reading   (3 lessons) •\tDialogue\tBy the end of the Sub Strand, the learner should be able to: a)\tmake connections between events in the text and prior experiences, b)\tuse contextual clues to infer the meaning of vocabulary such as words, proverbs, fixed phrases, similes, and phrasal verbs, c)\trespond to a reading text for comprehension, d)\tacknowledge the role of reading comprehension in lifelong learning.\tThe learner is guided to: •\trelate the title and illustrations/pictures with their personal experiences. •\tskim a text to obtain a general idea (dialogue of about 500 words), •\tscan a text on work ethics for specific details, •\tobserve the cover, pictures, and read the title to make predictions, •\tinfer the meaning of unknown words, similes, metaphors and fixed phrases from context, •\tcreate mental images (visualise) from read, viewed, or heard text, •\tretell events in a story/dialogue in their own words, •\twork with peers to make posters featuring the new words he or she has learnt, •\tanswer literal and inferential questions.",
                        "Why is it important to relate events in a story to our own experience?",
                        "How can you predict what will happen in a story or passage?"
                    ],
                    "core_competencies": [
                        "Communication and Collaboration: The learner’s ability to reason and express own opinion is enhanced as they work with peers to make posters featuring the new words learnt.",
                        "Self-efficacy: The learner’s confidence is enhanced as they display posters made featuring new words learnt through concerted attention to detail."
                    ],
                    "values": [
                        "Responsibility: This is developed as the learner displays dependability while scanning a text on work ethics for specific details."
                    ],
                    "pcis": [
                        "Life Skills: Effective communication is developed as learners retell the events in the story in their own words."
                    ],
                    "links_to_other_subjects": [
                        "The learner is able to relate the skills of intensive reading to their learning in Kiswahili.",
                        "Strand\tSub Strand\tSpecific Learning Outcome\tSuggested Learning Experiences\tSuggested Key Inquiry Question (s)"
                    ]
                },
                {
                    "substrand_number": "6.3.1",
                    "substrand_name": "Grammar in Use: Phrasal Quantifiers",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "recognise phrasal quantifiers in oral and written contexts,",
                        "use phrasal quantifiers with countable and uncountable nouns correctly,",
                        "judge the correctness of phrasal quantifiers in sentences."
                    ],
                    "suggested_learning_experiences": [
                        "work with peers to view a video or listen to an audio text on work ethics featuring phrasal quantifiers and identify them,",
                        "make sentences using phrasal quantifiers such as a lot of…, a pinch of…",
                        "plenty of…, a number of, a crate of …,",
                        "create charts and posters using phrasal",
                        "quantifiers and share them on the school notice board or social media,",
                        "form sentences from a substitution table."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Phrasal Quantifiers  (3 lessons)\tBy the end of the Sub Strand, the learner should be able to: a)\trecognise phrasal quantifiers in oral and written contexts, b)\tuse phrasal quantifiers with countable and uncountable nouns correctly, c)\tjudge the correctness of phrasal quantifiers in sentences.\tThe learner is guided to: •\twork with peers to view a video or listen to an audio text on work ethics featuring phrasal quantifiers and identify them, •\tmake sentences using phrasal quantifiers such as a lot of…, a pinch of… plenty of…, a number of, a crate of …, •\tcreate charts and posters using phrasal quantifiers and share them on the school notice board or social media, •\tform sentences from a substitution table.",
                        "How do we tell countable nouns from uncountable ones?",
                        "Which words are used to show the amount of something?"
                    ],
                    "core_competencies": [
                        "Communication: The learner’s ability for self-expression is developed through creating posters using phrasal quantifiers.",
                        "Digital Literacy: The learner’s ability to manipulate technology for learning is improved as they view videos featuring phrasal quantifiers or display charts on social media."
                    ],
                    "values": [
                        "Integrity: This is inculcated in the learner as they interact with information on choosing to do the right thing by reading material/texts on work ethics."
                    ],
                    "pcis": [
                        "Career exploration: The learner’s knowledge on careers is enhanced as they interact with information on the theme when working with peers to view a video or listen to an audio text on work ethics featuring phrasal quantifiers."
                    ],
                    "links_to_other_subjects": [
                        "The correct use of phrasal quantifiers is relevant when handling food and nutrition in Agriculture.",
                        "Strand\tSub Strand\tSpecific Learning Outcome\tSuggested Learning Experiences\tSuggested Key Inquiry Questions"
                    ]
                },
                {
                    "substrand_number": "6.4.1",
                    "substrand_name": "Writing: Creative Writing",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "plan a composition in preparation for writing,",
                        "use appropriate words and expressions such as similes, metaphors, fixed phrases, phrasal verbs and idioms in written communication,",
                        "create a pictorial composition from visuals.",
                        "judge a pictorial composition for relevance of topic, correctness of language, and creativity."
                    ],
                    "suggested_learning_experiences": [
                        "collaborate to view a variety of pictures, illustrations, and other visuals in print and",
                        "digital texts and discuss what is happening,",
                        "view comic strips from",
                        "newspapers and magazine columns,",
                        "use relevant fixed phrases, similes, metaphors, idioms,",
                        "proverb and phrasal verbs in a composition,",
                        "collaborate to use visuals to compose a story of about (160-200 words),",
                        "organise ideas logically, coherently, and clearly,"
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Creative Writing  (3lessons) Pictorial Compositions\tBy the end of the Sub Strand, the learner should be able to: a)\tplan a composition in preparation for writing, b)\tuse appropriate words and expressions such as similes, metaphors, fixed phrases, phrasal verbs and idioms in written communication, c)\tcreate a pictorial composition from visuals. d)\tjudge a pictorial composition for relevance of topic, correctness of language, and creativity.\tThe learner is guided to: •\tcollaborate to view a variety of pictures, illustrations, and other visuals in print and digital texts and discuss what is happening, •\tview comic strips from newspapers and magazine columns, •\tuse relevant fixed phrases, similes, metaphors, idioms, proverb and phrasal verbs in a composition, •\tcollaborate to use visuals to compose a story of about (160-200 words), •\torganise ideas logically, coherently, and clearly,",
                        "How can you make others want to read your composition?",
                        "What information do we obtain from pictures or visuals?    \t\t\t•\trevise their composition by incorporating suggestions given by peers, •\tpublish the composition by displaying it on the wall, charts, online, posters, and social media platforms, among others."
                    ],
                    "core_competencies": [
                        "Creativity and Imagination: The learner’s ability to undertakes tasks that encourage artistic expression is enhanced by creating a story from a collection of visuals provided by the teacher.",
                        "Self-efficacy: The learner’s ability to confidently express themselves is developed as they publish compositions by displaying them on the wall, charts, online, posters, and social media platforms, among others."
                    ],
                    "values": [
                        "Respect: This is emphasised as the learner appreciates diverse opinions while viewing a variety of visuals."
                    ],
                    "pcis": [
                        "Life Skills: Effective communication is developed as the learner organises ideas logically, coherently and clearly while writing their compositions."
                    ],
                    "links_to_other_subjects": [
                        "The skills acquired by learners as they create pictorial compositions are related to learning of composition writing in Kiswahili."
                    ]
                }
            ]
        },
        {
            "strand_number": "7.0",
            "strand_name": "THEME 7.0: TECHNOLOGY: SCIENTIFIC INNOVATIONS",
            "substrands": [
                {
                    "substrand_number": "7.1.1",
                    "substrand_name": "Listening and Speaking: Pronunciation and",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "articulate sounds correctly for communication clarity,",
                        "seek clarification during a two-way conversation to express different moods in oral contexts,",
                        "interrupt\tappropriately during a conversation.",
                        "use appropriate words and expressions such as"
                    ],
                    "suggested_learning_experiences": [
                        "practise saying the sounds: /ɒ/ as in, of, on, from, lot; hot,",
                        "/ɔː/ as in door, sort, short, ball, call, or among others,",
                        "show moods such as",
                        "happiness, surprise, sadness, regret, and pain, among others, when seeking",
                        "clarification,",
                        "take turns and interrupt appropriately during conversations,",
                        "role play short interviews,",
                        "watch partial dialogues on video, the computer, tablets,"
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Pronunciation and Interactive Listening\tBy the end of the Sub Strand, the learner should be able to: a)\tarticulate sounds correctly for communication clarity, b)\tseek clarification during a two-way conversation to express different moods in oral contexts, c)\tinterrupt\tappropriately during a conversation. d)\tuse appropriate words and expressions such as\tThe learner is guided to: •\tpractise saying the sounds: /ɒ/ as in, of, on, from, lot; hot, /ɔː/ as in door, sort, short, ball, call, or among others, •\tshow moods such as happiness, surprise, sadness, regret, and pain, among others, when seeking clarification, •\ttake turns and interrupt appropriately during conversations, •\trole play short interviews, •\twatch partial dialogues on video, the computer, tablets,",
                        "How do you interrupt a speaker politely during a conversation?",
                        "What emotions or feelings do we show on our faces when talking? \t(3 lessons)\t\t\t \t•\tSounds /ou and /ɔː/ •\tSeeking clarification •\tInterrupting appropriately\t\t\t    \t\tsimiles, metaphors, proverbs among others e)  advocate the importance of interactive listening.\tand other devices and respond to questions appropriately, •\tpractise using expressions such as: fixed phrases: good at, be familiar with, little by little, long ago, a long time ago similes: work like magic, as easy as ABC., like a sea of knowledge, as slow as a snail, as quick as silver metaphors: The internet is a sea of knowledge. It has a lot of information idioms: To make headway, apple of my eye proverbs: Practise makes perfect, Necessity is the mother of invention, Live and learn, Little learning is a dangerous thing,\t    \t\t\tphrasal Verbs: Start over, key in, leave behind, look for, come up with."
                    ],
                    "core_competencies": [
                        "Digital Literacy: The learner’s ability to use digital devices is enhanced while watching partial dialogues on video, computer, tablets and other devices and responding to questions appropriately.",
                        "Communication and Collaboration: The learner’s ability to speak clearly and effectively is developed as they take turns during a conversation."
                    ],
                    "values": [
                        "Peace: This is cultivated as the learner avoids hurting others by practising the skills of turn taking and interrupting appropriately during conversations."
                    ],
                    "pcis": [
                        "Life Skills (Self-esteem): The learner’s self-esteem is promoted as they practise effective communication while engaging in the role-play and retelling the events in the story."
                    ],
                    "links_to_other_subjects": [
                        "The skill of interactive listening is relevant to the learning of listening skills in Kiswahili.",
                        "Strand\tSub Strand\tSpecific Learning Outcomes\tSuggested Learning Experiences\tSuggested Key Inquiry Question(s)"
                    ]
                },
                {
                    "substrand_number": "7.2.1",
                    "substrand_name": "Reading: Extensive Reading",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "select appropriate reading texts from a library,",
                        "read a variety of texts for general information and enjoyment,",
                        "acknowledge the importance of reading widely for lifelong learning."
                    ],
                    "suggested_learning_experiences": [
                        "select a reading text from a varied collection of materials or library,",
                        "preview the table of contents from a book, find the required information, and answer oral questions,",
                        "skim a text to obtain the gist or general idea,",
                        "scan a text to obtain specific information,",
                        "select a reading text (1251-1500 words),",
                        "use a dictionary to look up the meaning of unfamiliar words,",
                        "write a summary of a text he or she has read and share it with peers."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Extensive Reading  (2 lessons) Fictional and Non-Fictional (1251-1500 words)\tBy the end of the Sub Strand, the learner should be able to: a)\tselect appropriate reading texts from a library, b)\tread a variety of texts for general information and enjoyment, c)\tacknowledge the importance of reading widely for lifelong learning.\tThe learner is guided to: •\tselect a reading text from a varied collection of materials or library, •\tpreview the table of contents from a book, find the required information, and answer oral questions, •\tskim a text to obtain the gist or general idea, •\tscan a text to obtain specific information, •\tselect a reading text (1251-1500 words), •\tuse a dictionary to look up the meaning of unfamiliar words, •\twrite a summary of a text he or she has read and share it with peers.",
                        "How can you obtain the general idea of what a text is about?",
                        "Why is it important to read many books?"
                    ],
                    "core_competencies": [
                        "Learning to Learn: The learner’s ability to acquire the skill of selecting and reading a variety of texts is enhanced as they select, read and summarise texts.",
                        "Collaboration: The learner’s ability to work with others harmoniously is boosted as they observe the rules of engagement while sharing a summary of the text he or she has read."
                    ],
                    "values": [
                        "Respect: This is inculcated in the learner as they display patience while writing a summary of a text he or she has read and sharing it with peers."
                    ],
                    "pcis": [
                        "Critical Thinking: The learner acquires the skills of critical thinking while skimming a text to obtain the gist or general idea."
                    ],
                    "links_to_other_subjects": [
                        "Extensive reading is necessary as learners carry out research while doing assignments and general reading in Social Studies.",
                        "Strand\tSub Strand\tSpecific Learning Outcomes\tSuggested Learning Experiences\tSuggested Key Inquiry Question (s)"
                    ]
                },
                {
                    "substrand_number": "7.3.1",
                    "substrand_name": "Grammar in Use: Tense:",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "identify sentences featuring future continuous tense in print and digital texts,",
                        "use future continuous tense in oral and written contexts correctly,",
                        "assess sentences for correctness and appropriateness of tense."
                    ],
                    "suggested_learning_experiences": [
                        "ask the following questions to peers: What are you doing? What were you doing yesterday? What will you be doing tomorrow?",
                        "view a map, globe, list of",
                        "time zones, video or pictures of animals, plants, or people and describe what will",
                        "probably happen the next",
                        "day starting with the words, they, he, and she, among others,",
                        "talk about activities in the past, present, and future",
                        "time,",
                        "search the internet for examples of sentences",
                        "collaborate with peers to",
                        "determine the correctness of aspect in sample sentences."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Tense:   (3 lessons) Future Continuous Aspect\tBy the end of the Sub Strand, the learner should be able to: a)\tidentify sentences featuring future continuous tense in print and digital texts, b)\tuse future continuous tense in oral and written contexts correctly, c)\tassess sentences for correctness and appropriateness of tense.\tThe learner is guided to: •\task the following questions to peers: What are you doing? What were you doing yesterday? What will you be doing tomorrow? •\tview a map, globe, list of time zones, video or pictures of animals, plants, or people and describe what will probably happen the next day starting with the words, they, he, and she, among others, •\ttalk about activities in the past, present, and future time, •\tsearch the internet for examples of sentences expressing continuous aspect,\tHow do you show an action will take place tomorrow or at a later time?    \t\t\t•\tcollaborate with peers to determine the correctness of aspect in sample sentences."
                    ],
                    "core_competencies": [
                        "Communication and Collaboration: The learner’s ability to speak clearly is enhanced as they talk about activities in the past, present, and future time by recognising the value of others.",
                        "Self-efficacy: The learner states what they find difficult to do as they talk about activities in the past, present, and future time."
                    ],
                    "values": [
                        "Love: It is cultivated as the learner learns to resolve conflicts while collaborating with peers to determine the correctness of aspect in sample sentences."
                    ],
                    "pcis": [
                        "Life skills: Effective communication is achieved as learners engage in role play and retell the events in the story."
                    ],
                    "links_to_other_subjects": [
                        "The skill of correct use of aspect is critical in Kiswahili and communication in all the learning areas as they make presentations.",
                        "Strand\tSub Strand\tSpecific Learning Outcomes\tSuggested Learning Experiences\tSuggested Key Inquiry Question (s)"
                    ]
                },
                {
                    "substrand_number": "7.4.1",
                    "substrand_name": "Writing: Mechanics of writing",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "identify the comma and double quotation marks in a text,",
                        "use the comma and the double quotation marks correctly in oral and written texts,",
                        "collaborate with peers to determine the correct use of the comma and the double quotation marks."
                    ],
                    "suggested_learning_experiences": [
                        "collaborate to identify sentences in which the comma and the",
                        "double quotation marks have been used,",
                        "recite a poem on scientific innovations paying attention to the use of the comma and the double quotation marks,",
                        "listen to an oral presentation and answer questions,",
                        "form sentences from a substitution table,",
                        "work with peers to construct and punctuate sentences correctly,",
                        "create a poster or power point",
                        "presentation and display the work to another group,",
                        "listen to a dictation of sentences, write the sentences and punctuate",
                        "them appropriately."
                    ],
                    "key_inquiry_questions": [
                        "",
                        "1 Mechanics of writing  (3 lessons)  •\tPunctuation Comma and Double •\tQuotation Marks\tBy the end of the Sub Strand, the learner should be able to: a)\tidentify the comma and double quotation marks in a text, b)\tuse the comma and the double quotation marks correctly in oral and written texts, c)\tcollaborate with peers to determine the correct use of the comma and the double quotation marks.\tThe learner is guided to: •\tcollaborate to identify sentences in which the comma and the double quotation marks have been used, •\trecite a poem on scientific innovations paying attention to the use of the comma and the double quotation marks, •\tlisten to an oral presentation and answer questions, •\tform sentences from a substitution table, •\twork with peers to construct and punctuate sentences correctly, •\tcreate a poster or power point presentation and display the work to another group, •\tlisten to a dictation of sentences, write the sentences and punctuate them appropriately.",
                        "Why should we punctuate our speech or writing correctly?",
                        "Which punctuation marks do you use frequently?"
                    ],
                    "core_competencies": [
                        "Collaboration: The learner’s ability to collaborate and carry out activities with peers is enhanced as they create a poster or PowerPoint presentation and display the work to another group.",
                        "Creativity: The learner’s artistic prowess is developed as they make posters or PowerPoint presentations and document successes made during recitations."
                    ],
                    "values": [
                        "Love: It is cultivated as the learner learns to resolve conflicts while collaborating with peers to determine the correctness of tense in sample sentences."
                    ],
                    "pcis": [
                        "Information Technology: The learner interacts with technology and learns more about emerging trends as they recite poems on scientific innovations paying attention to the use of the comma and the double quotation marks."
                    ],
                    "links_to_other_subjects": [
                        "The skill of correct use of punctuation marks is critical when writing essays in other learning areas such as Kiswahili and Religious Education."
                    ]
                }
            ]
        },
        {
            "strand_number": "8.0",
            "strand_name": "THEME 8.0: THE FARM – ANIMAL SAFETY AND CARE",
            "substrands": [
                {
                    "substrand_number": "8.1.1",
                    "substrand_name": "Listening and Speaking: Pronunciation and Vocabulary",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub\nStrand, the learner should be able to:",
                        "explain the difference\nbetween riddles and proverbs",
                        "pronounce sounds, words, and\nphrases related to the theme accurately",
                        "use words and\nexpressions such as idioms, fixed\nphrases, phrasal"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "search from online sources for information on the\ndifferences between\nriddles and proverbs and share with peers",
                        "participate in a riddling session",
                        "say sounds, words,\nidioms, and proverbs with the sounds /ʃ / and /ʧ / accurately",
                        "create own riddles and share them their peers",
                        "find and use words and expressions such as:\t1.\tWhy do we tell riddles and\nproverbs?\n2.\tWhich are some of the proverbs you\nknow?\n \n\n\t\tverbs and proverbs in varied contexts,\nd) acknowledge the importance of\nproverbs, riddles, and idioms in\ncommunication.\tfixed phrases: in good shape, at the moment, make money, one by one,\nsimile: as mischievous as a\nmonkey, as helpless as a baby, as gentle as lamb, as white as wool,\nmetaphor: the girl is a lamb. she is so gentle. idioms: would not hurt a fly, curiosity killed\nthe cat, let the cat out of the bag, kill two birds with one stone,\nproverbs: a bad workman quarrels with his tools, put all your eggs in one basket, it is no use crying over spilt milk, a barking dog never bites, a dog is a man's best friend,\nphrasal verbs: die out, care for, care about, look after, rely on",
                        "use words, phrases, and\nproverbs in a conversation"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "8.2.1",
                    "substrand_name": "Reading: Fluency",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub\nStrand, the learner should be able to:",
                        "select a reading text from a collection of materials or the\nlibrary",
                        "read a text at a\nreasonable speed for fluency",
                        "read a text accurately and with expression",
                        "acknowledge the importance of\nreading fluency in lifelong learning"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "obtain specific information from a text",
                        "practise reading at the right speed, with peers",
                        "read a text on animal\nsafety, while observing punctuation marks correctly",
                        "watch a video on reading fluency and practise the\nvarious aspects of fluency",
                        "collaborate in reading a choral verse",
                        "read a paragraph, a\npassage, or story in turns.\t1.\tHow can you improve your\nreading speed?\n2.\tWhat are some of the feelings you show when\nreading a story or poem?"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "8.3.1",
                    "substrand_name": "Grammar in Use: Sentence Patterns",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub Strand, the learner\nshould be able to:",
                        "distinguish the active and passive voice in a sample text correctly",
                        "contrast the use of some given words in sentences",
                        "use active and passive voice correctly",
                        "assess sentences for correctness on the use of active and passive voice"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "identify sentences in the active and passive voice from a text",
                        "change sentences from\nactive to passive voice and vice-versa",
                        "sort pairs of sentences and classify them into either active or passive voice",
                        "construct sentences, related to animal safety, in the\nactive and passive voice, type them on a computer, laptop, tablet, or mobile phone and share them\nthrough, email or other web platforms,\tHow do we change a\nsentence from active to passive form?",
                        "search for more examples of sentences in the active and passive voice from the internet",
                        "collaborate with peers to determine the correctness of sentences"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "8.4.1",
                    "substrand_name": "Writing: Creative Writing",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub Strand, the\nlearner should be able to:",
                        "plan a narrative composition in preparation for writing",
                        "use proverbs,\nphrasal verbs and idiomatic\nexpressions in writing",
                        "create a narrative composition\nbased on a given theme for self- expression",
                        "judge a narrative composition for\ncreativity"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "collaborate to use the writing process (planning, drafting,\nediting, revising, and publishing) and create a narrative composition of about (160-200 words)",
                        "identify idioms, proverbs, and similes from an oral or written text",
                        "use appropriate words and\nexpressions such as fixed phrases: similes, idioms phrasal verbs and metaphors in their writing",
                        "display their compositions in class, on charts, school magazine, noticeboard and blogs, among others",
                        "complete a gap-filling exercise involving similes, proverbs, and idioms.\t1.\tWhy is it\nimportant to plan your composition?\n2.\tWhat makes a composition\ninteresting?\n \n\n\t\torganisation of\nideas, relevance of topic, and correctness"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                }
            ]
        },
        {
            "strand_number": "10.0",
            "strand_name": "THEME 10.0: PROPER USE OF LEISURE TIME",
            "substrands": [
                {
                    "substrand_number": "10.1.1",
                    "substrand_name": "Listening and Speaking: Pronunciation and Vocabulary: Interactive Listening",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub Strand, the learner\nshould be able to:",
                        "identify words with the sound /h/ in an oral text",
                        "use turn taking and polite interruption during a\nconversation",
                        "express appropriate moods during a\nconversation",
                        "advocate the\nimportance of polite interruption"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "pick out the sound /h/ as in\nholiday, /j/ as in yam and /eə/ as in air, from an audio text",
                        "listen to a text on proper use of leisure time and say words and phrases with the sound /h/",
                        "take turns during short interviews, debates and discussions on grade appropriate topics",
                        "interrupt appropriately during a class discussion, interview or\ndebate",
                        "perform a choral verse (about six stanzas) or conversational\t1.\tWhy should we take turns in a conversation?\n2.\tWhat are some of the moods/feelings\nwe can show during a conversation?\n \n\n\t\te) and turn taking in oral\ncommunication.\tpoem in a reader’s theatre, and display various moods",
                        "practise using expressions such as fixed phrase: kill time;\nsimile: sleep like a log;\nmetaphor: My mother is hawk eyed. She sees everything; proverbs: There is no time like the present, idioms: day\ndream, phrasal verbs: good at"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "10.2.1",
                    "substrand_name": "Reading: Intensive Reading",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub\nStrand, the learner should be able to:",
                        "make connections\nbetween events in a text and real life\nexperiences",
                        "respond to a text correctly for\ncomprehension",
                        "use contextual clues to infer the meaning of\nunfamiliar words and expressions such as\nproverbs, similes among others",
                        "acknowledge the role of reading comprehension in lifelong learning"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "preview a text on proper use of leisure time for general\nunderstanding",
                        "make predictions about events in a text",
                        "infer the meaning of unfamiliar words and expressions using prior knowledge and contextual clues",
                        "answer direct and inferential\nquestions orally and in writing",
                        "summarise the events in the text through retelling",
                        "create a password puzzle using the learnt vocabulary.\t1.\tWhy should we relate events in a book to our own life experiences?\n2.\tHow can you predict the\ninformation in a book even before you read it?"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "10.3.1",
                    "substrand_name": "Grammar in Use: Conjunctions",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub Strand, the learner\nshould be able to:",
                        "identify\nconjunctions in a text",
                        "use conjunctions correctly in varied contexts",
                        "judge the\nappropriateness of conjunctions used in sentences"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "identify the conjunctions since, so, nor, yet, for, unless, although, though, in a text",
                        "construct sentences on proper use of leisure time using conjunctions",
                        "fill in blanks in sentences using conjunctions",
                        "collaborate with peers to construct sentences using conjunctions",
                        "create a crossword puzzle using conjunctions and share it with peers through posters,\ncharts or social media.\tHow do you join two or more\nsentences?"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "10.4.1",
                    "substrand_name": "Writing: Creative Writing",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "By the end of the Sub Strand, the learner should be able to:",
                        "use appropriate\nadjectives to describe a person, object or a place",
                        "plan a descriptive composition in\npreparation for writing",
                        "create a descriptive composition on a variety of topics",
                        "judge a descriptive composition for correctness of language, relevance to the topic, creativity and\norganisation of ideas"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "identify key points about an event such as a wedding ceremony,\nfootball match and dance, among others",
                        "suggest people, events, places or objects that can be described in pairs",
                        "plan a descriptive composition of about 160-200 words",
                        "select and use appropriate\nexpressions such as proverbs and idioms in a composition",
                        "collaborate to write the\nintroductory paragraph of the descriptive composition",
                        "complete the descriptive composition.\t1.\tWhat words do we use to\ndescribe objects, people or events?\n2.\tHow can we make our\ndescriptions more interesting?"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                }
            ]
        },
        {
            "strand_number": "11.0",
            "strand_name": "THEME 11.0: SPORTS – INDOOR GAMES",
            "substrands": [
                {
                    "substrand_number": "11.1.1",
                    "substrand_name": "Listening and Speaking: Pronunciation and Vocabulary",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub Strand, the learner\nshould be able to:",
                        "select sounds, words and phrases from a\ntext for listening fluency",
                        "use words and\nexpressions such as proverbs, phrasal\nverbs, among others in sentences",
                        "listen for specific\ndetails and main idea from audio\nrecordings, internet"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "listen to audio stories and pick put specific sounds, words,\nphrases or sentences",
                        "say words with the sounds /ʊ/ and /uː/ correctly",
                        "say tongue twisters with the target sounds",
                        "collaborate to listen to choral poems with the sounds /ʊ/ and\n/uː/ and pick out words with the selected sounds",
                        "interpret non-verbal cues correctly during conversations",
                        "practise using expressions such as fixed phrases: out of breath;\t1)\tWhy should we look at the face of people as they\nspeak?\n2)\tHow are audio stories different from a written story?\n \n\n\t\tradio or television programmes.\nd) appreciate the importance of\neffective listening in communication.\tsimiles: as bright as day;\nmetaphor: Lodunga is a deer. He runs very fast. ; idioms: get a head start; proverbs: look\nbefore you leap and phrasal verbs such as pass round"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "11.2.1",
                    "substrand_name": "Reading: Intensive Reading: Digital Stories",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub\nStrand, the learner should be able to:",
                        "identify words,\nphrases and proverbs from a digital text",
                        "create mental images from viewed, heard or read text",
                        "answer direct and\ninferential questions correctly for\ncomprehension",
                        "acknowledge the role of reading\ncomprehension in lifelong learning"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "participate in a reader’s theatre and read solo or choral poems on indoor games",
                        "make predictions about a text by observing the cover or title",
                        "make connections between\nthe pictures in a text and real life situations",
                        "summarise important ideas and restate them in own words",
                        "retell events in a poem chronologically",
                        "use contextual clues to infer the meaning of expressions similes, metaphors, idioms, proverbs and phrasal verbs",
                        "summarise events in a text through retelling.\t1.\tWhat role do pictures in a book or cover play in a story?\n2.\tHow are digital stories different from story\nbooks?"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "11.3.1",
                    "substrand_name": "Grammar in Use: Interrogatives",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub\nStrand, the learner should be able to:",
                        "identify interrogatives in print or digital texts",
                        "use interrogatives correctly to express different meanings",
                        "assess the\nappropriateness of\ninterrogatives used in print and digital texts"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "discuss in pairs or groups which among the following\nwords are not interrogatives: whip, how, what, when, whom, why, which, whisper, where and whole",
                        "practise using when clauses with present tense to show the future, for example, ‘When\nare you going to school?",
                        "collaborate with peers to use interrogatives in sentences correctly",
                        "create lists of interrogative\nsentences using words related to the theme",
                        "type the list using a computer, laptop or tablet in groups and display his or her work to\npeers.\t1.\tHow do you form questions?\n2.\tWhy do we ask questions?"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "11.4.1",
                    "substrand_name": "Writing: Mechanics of writing",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "By the end of the Sub Strand, the learner\nshould be able to:",
                        "identify synonyms and antonyms correctly for writing fluency",
                        "use synonyms and\nantonyms correctly in sentences",
                        "advocate the use of a rich vocabulary in writing"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "listen/watch a video recording on in-door games and identify words with synonyms and\nantonyms",
                        "form sentences using\nsynonyms and antonyms",
                        "identify synonyms and\nantonyms from newspapers, magazines or the internet and create a crossword puzzle",
                        "display their work on posters.\t1.\tHow do you tell the meaning of\nunfamiliar words?\n2.\tWhich are some of\nthe words with same or opposite\nmeaning?"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                }
            ]
        },
        {
            "strand_number": "9.0",
            "strand_name": "THEME 9: LIFESTYLE DISEASES",
            "substrands": [
                {
                    "substrand_number": "9.1.1",
                    "substrand_name": "Listening and Speaking: Pronunciation and Speaking: Fluency",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub\nStrand, the learner should be able to:",
                        "identify words,\nphrases and sentences with the target sounds",
                        "use words and\nexpressions such as\nidioms, proverbs and similes related to the theme in sentences correctly"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "say words and phrases with the sounds /eə/, /aʊ/ and /h / correctly",
                        "practise saying tongue\ntwisters with the selected sounds",
                        "recite poems on lifestyle\ndiseases with words which\nhave the sounds /eə/ /aʊ/ and\n/h/",
                        "speak at the right speed,\t1.\tWhy should we speak accurately and without\nhesitations?\n2.\tWhat is the\nimportance of showing the\nright feelings when reciting a\npoem or telling a story?\n\t(3 lessons)",
                        "Target sounds",
                        "Expressions",
                        "Oral presentation\t\t\t\n \n\n\t\tc)\tmake an oral\npresentation related to the theme fluently,\nd)\tacknowledge the\nimportance of fluency in oral\ncommunication",
                        "make short speeches on\nlifestyle diseases expressively, accurately and without hesitations",
                        "recite choral and oral verses poems and show the right\nfacial expressions through readers’ theatres",
                        "use fixed phrases such as fall sick; similes… as right as rain; metaphor, for example, Kadzo is a lark. She is always happy. Idioms such as fit as a fiddle,\nsick like a dog, proverbs such as an apple a day keeps the doctor away, prevention is better than cure, phrasal verbs such as pass out",
                        "Make short videos of the poetry recitation or narrations and share them with friends or peers"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "9.2.1",
                    "substrand_name": "Reading: Intensive Reading - Fictional and Non-fictional",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub Strand, the learner\nshould be able to:",
                        "make connections\nbetween events in the text and real life\nexperiences",
                        "create mental images from viewed, heard or read text for\ncomprehension",
                        "respond to texts correctly for\ncomprehension",
                        "acknowledge the importance of\nreading\ncomprehension in lifelong learning"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "predict events by studying the title, cover or pictures in a text on lifestyle diseases",
                        "picture events, characters or places in their minds",
                        "read texts of up to 500 words related to the selected theme",
                        "connect events in a text with an occurrence in their own life or real world events",
                        "use the image on the front cover to predict events in the text",
                        "infer the meaning of unfamiliar words and expressions such as fixed phrases, idioms, proverbs and phrasal verbs",
                        "retell the events depicted in a text in their own words.\t1.\tWhy should we relate\nevents in a\ntext with real life, people or places?\n2.\tHow can we predict what will happen in a text or\nstory?",
                        "answer direct and inferential questions from a variety of texts",
                        "create a mind map using words in a text"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "9.3.1",
                    "substrand_name": "Grammar in Use: Adverbs",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "By the end of the Sub Strand, the learner\nshould be able to:",
                        "identify adverbs in oral and written texts",
                        "use adverbs to express different\nmeanings correctly",
                        "judge the appropriateness of adverbs used in oral and written texts"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "identify the adverbs of manner,\ntime place and frequency in a text on lifestyle diseases",
                        "underline the adverbs in a passage",
                        "pick out different adverbs from\nprint texts or the internet in small groups",
                        "collaborate with peers to judge the correctness of sentences featuring adverbs",
                        "form sentences using adverbs",
                        "create a poem or story using different types of adverbs",
                        "create and solve crossword puzzles using adverbs.\t1.\tHow do we show where, how, when and how many\ntimes an action occurs?\n2.\tWhat are some of the words you could use to talk more about an action?"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "9.4.1",
                    "substrand_name": "Writing: Mechanics of writing",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub Strand, the learner\nshould be able to:",
                        "identify grade appropriate\nhyphenated words from a written text",
                        "use grade appropriate\nhyphenated words correctly for clarity of meaning",
                        "judge sentences for correctness of\nlanguage, and use of the hyphen"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "search for and share with peers\nhyphenated and unhyphenated words such as dark-blue shirt, good- looking, goodhearted, fast-moving,\nanticlockwise from the internet,\nmagazines, newspapers, textbooks or brochures",
                        "listen to a dictation of the following words: mother-in-law, father-in-law, sister-in-law, brother-in law and\nwrite them down",
                        "listen to an audio recording of the words mother-in-law, father-in-law, sister-in-law, brother-in-law and anti- clockwise and create a list",
                        "use words such as fast-flowing, slow- moving, open-mouthed, big-eyed,\nsugar-free among others in sentences,\tWhy is it important to punctuate texts appropriately?",
                        "hyphenate words which refer to age such as five- year-old girl, two-year- old and middle-aged man",
                        "use the hyphen correctly when\nwriting numbers 21 through 99: for example,\ntwenty-one; ninety-nine",
                        "work with peers to create a poster on lifestyle diseases featuring the words learnt,\nNote: The learner should only be exposed to simple and common hyphenated words"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                }
            ]
        },
        {
            "strand_number": "12.0",
            "strand_name": "THEME 12.0: ENVIRONMENT CONSERVATION",
            "substrands": [
                {
                    "substrand_number": "12.1.1",
                    "substrand_name": "Listening and Speaking: Pronunciation and Vocabulary",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub Strand, the learner should be able to:",
                        "listen for specific details such as sounds words and expressions for effective oral communication",
                        "make oral presentations such as speeches accurately, with minimal hesitations and with\nexpressions",
                        "use non-verbal cues appropriately to enhance fluency"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "say words and phrases with the sounds / ʒ/ / ʤ/ correctly",
                        "recite poems with words that have the sounds /ʒ/ / ʤ/",
                        "Listen for specific details such as:\nfixed phrases: as long as, all the time, set on fire, from time to time, too bad, be in trouble;\nsimile: as wide as the sky, as brave as a lion, as green as grass, as clear\nas crystal, as clear as\t1.\tWhy should you speak at the right speed, accurately, and with\nexpression?\n2.\tHow do our\nfaces, hands, and eyes help us\ncommunicate better?\n \n\n\t\td) judge the appropriateness of non-verbal cues in a conversation or video\nrecordings.\tday, as black as soot, as pure as snow; metaphor: The man is a tortoise. He walks so slowly! Sanaipei is a lion. She is very\nbrave;\n\nidioms: A drop in the ocean, add fuel to the\nfire, beat about the bush, the grass is always greener on the\nother side of the fence; proverbs: Prevention is\nbetter than cure; The best things in life are free, An apple never falls far from the tree; If you want to be happy for a year, plant a garden; If you want to be happy for life, plant a\ntree;\t\n \n\n\t\t\tphrasal Verbs: clean up, cut down, die out, dry up, cut down, die out",
                        "speak on topics based on environmental\nconservation or content from other areas in class",
                        "participate in mock interviews in small groups",
                        "recite choral and solo verses related to the\ntheme"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "12.2.1",
                    "substrand_name": "Reading: Intensive Reading",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub Strand, the learner\nshould be able to:",
                        "identify words, phrases, and\nproverbs used in a song or poem",
                        "uses stress and\nrhythm correctly while reading lines\nand words in a poem or song",
                        "respond to a reading text for\ncomprehension",
                        "advocate the\nimportance of correct stress and rhythm in\ncommunication"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "participate in a reader’s theatre and read solo or choral poems, using correct stress",
                        "sing along as a video of poetry\nrecitation or song plays with the lyrics provided, using the correct rhythm",
                        "identify words, phrases, and proverbs used in the song or poem",
                        "make predictions about events in a poem on environmental\nconservation by observing the picture or title",
                        "answer direct and inferential\nquestions from a comprehension passage",
                        "create mental images by viewing pictures or events in a poem or\t1.\tWhy are songs and poems more enjoyable than\nreading a book?\n2.\tHow can we make a poem or song\nmore interesting?\n \n\n\t\t\tsong and comparing them to real- life situations",
                        "infer the meaning of new words and expressions such as fixed\nphrases, proverbs, idioms,\nphrasal verbs and similes from\nthe way they have been used in a text"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "12.3.1",
                    "substrand_name": "Grammar in Use: Question Tags",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub Strand, the learner\nshould be able to:",
                        "identify question tags from a print or digital text for information",
                        "form question tags from verbs to be,\nverbs to have, verbs to do and modals",
                        "use question tags correctly in oral and written texts",
                        "appreciate the\nimportance of well- formed sentences in communication"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "identify the verbs to be, verbs to have, verbs to do and modals",
                        "form question tags using verbs to be, verbs to have, verbs to do and modals",
                        "apply rules when forming\nquestion tags, for example, a positive statement results in a negative tag question and\nvice versa",
                        "search for examples of\nquestion tags on the web, with peers",
                        "practise using question tags in dialogues and\nconversations",
                        "make posters featuring\nquestion tags and display them in class.\t1.\tWhat is a\nquestion tag?\n2.\tHow do we form question tags?"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "12.4.1",
                    "substrand_name": "Writing: Functional Writing",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub\nStrand, the learner should be able to:",
                        "identify all the components of a personal journal",
                        "use the correct format to create a personal\njournal",
                        "judge the correctness, relevance to the topic and the format of a\npersonal journal"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "identify all the components of a personal journal",
                        "read a sample personal journal",
                        "create a personal journal for seven days",
                        "peer-edit the personal journals, different pairs exchange their\njournals for editing",
                        "revise personal journals",
                        "display the personal journals in class.\t1.\tWhy do we keep journals and diaries?\n2.\tHow do you\nrecord important occasions or\ndates in your life?"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                }
            ]
        },
        {
            "strand_number": "13.0",
            "strand_name": "THEME 13.0: MONEY – TRADE",
            "substrands": [
                {
                    "substrand_number": "13.1.1",
                    "substrand_name": "Listening and Speaking: Pronunciation and Intensive Listening",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub Strand, the learner\nshould be able to:",
                        "identify specific sounds, words, phrases, and\nsentences from a text",
                        "listen to a short\ntext and rewrite it accurately",
                        "use expressions such as similes, proverbs, fixed phrases idioms and metaphors in"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "dictate a story featuring\nproverbs and similes, pick them out and list them in pairs",
                        "say the sounds: /ᴧ / as in but, / ʊ / as in put, [ ʊə] as in tour and [ eı] as in gate",
                        "rewrite a short text in his or her own words accurately, read a written version of what they have listened to",
                        "predict the likely outcome of events in a listening\ntext,\t1.\tWhy should we listen carefully?\n2.\tWhat is the function of similes and proverbs in\ncommunication?\n \n\n\t\toral contexts correctly,\nd) advocate the need for attentive\nlistening during oral comprehension",
                        "pick out information such as amounts, dates, time,\nfacts, characters, and the\nsequence of events from an oral text",
                        "use expressions such as\nfixed phrases: at once, no entry, similes such as: sell like hot cakes, as happy as a hippo; metaphors such as - Chebet is a hare.\nShe is so clever.\nproverbs such as A stitch in\ntime saves nine, grow on trees, idioms such as back to square one, to cut corners and phrasal verbs such as count on, give in\nand give back"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "13.2.1",
                    "substrand_name": "Reading: Extensive Reading",
                    "number_of_lessons": 2,
                    "specific_learning_outcomes": [
                        "By the end of the Sub Strand, the learner\nshould be able to:",
                        "select appropriate reading texts from print or digital\ncollections",
                        "read a variety of\nprint or digital texts for enjoyment and general\nunderstanding",
                        "appreciate the importance of\nextensive reading in lifelong learning"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "skim various texts to find out the general idea",
                        "scan a text to find specific details such as key words",
                        "read a variety of texts of about 1251 to 1500 words from\nnewspaper, magazines, grade- appropriate digital/print texts, as well as articles",
                        "collaborate with peers to establish a class library",
                        "read print and non-print\nmaterials (websites and blogs) independently",
                        "read newspapers, magazines poems, and class readers on trade",
                        "read digital versions of\nnewspapers and magazines for information.\t1.\tWhy do we enjoy reading some\nmaterials but not others?\n2.\tHow do you obtain information from a newspaper, book, or magazine quickly?"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "13.3.1",
                    "substrand_name": "Grammar in Use: Word Classes",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub Strand, the learner\nshould be able to:",
                        "identify\nprepositions\ncorrectly in oral and written texts",
                        "use prepositions correctly in varied texts",
                        "judge the\nappropriateness of prepositions used in various texts"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "identify prepositions of time such as since, before, until, about, during, past; directions such as above, across, below,\nafter; agent such as by, and with; instrument such as with and by",
                        "collaborate with peers to create visuals demonstrating the use of various prepositions",
                        "construct sentences on money and trade using prepositions",
                        "create crossword puzzles using prepositions in pairs or small groups",
                        "create visuals to demonstrate the use of various prepositions in sentences,\tWhat words do we use to describe the\nposition of people or objects in relation to others?",
                        "work with peers to create charts or posters showing where\nobjects are, for example, ‘the\npupils are inside the classroom"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                },
                {
                    "substrand_number": "13.4.1",
                    "substrand_name": "Writing: Mechanics of writing",
                    "number_of_lessons": 3,
                    "specific_learning_outcomes": [
                        "By the end of the Sub\nStrand, the learner should be able to:",
                        "recognise affixes used to change the form and meaning of words",
                        "form new words using prefixes and suffixes",
                        "spell words correctly for writing fluency",
                        "determine the correctness and appropriateness of\naffixes used in various texts"
                    ],
                    "suggested_learning_experiences": [
                        "The learner is guided to:",
                        "identify words with prefixes and suffixes and use them to create puzzles and share with peers",
                        "form words using prefixes and affixes",
                        "match words with their appropriate affixes (-un, -cian, sion, - tion)",
                        "use mind maps to generate a list of related words and\nchange their form by adding affixes",
                        "create a crossword puzzle using the words they have generated.\t1.\tWhy is it\ndifficult to spell some words?\n2.\tHow can we become\nbetter at spelling?"
                    ],
                    "key_inquiry_questions": [],
                    "core_competencies": [],
                    "values": [],
                    "pcis": [],
                    "links_to_other_subjects": []
                }
            ]
        }
    ]
}