{
  "grade": 1,
  "subjectName": "Religious Education (CRE/IRE/HRE)",
  "strands": [
    {
      "strandId": "1.0",
      "strandTitle": "Creation",
      "subStrands": [
        {
          "subStrandId": "1.1",
          "subStrandTitle": "Self- Awareness",
          "specificLearningOutcomes": [
            "identity their uniqueness as guided by the word of God",
            "state their gender according to Genesis 1:27",
            "appreciate that God knows them by their names"
          ],
          "suggestedLearningExperiences": [
            "in pairs read Genesis 1:27",
            "say why they are a special creation",
            "sing songs related to their uniqueness",
            "state their gender as guided by Genesis 1:27",
            "draw and colour a picture of a boy and a girl",
            "in turns read Isaiah 43:1",
            "write their names on flashcards and display them in class",
            "sing songs related to their names",
            "watch a clip of a palm of a hand with a name on it",
            "draw the palm of a hand and write their names",
            "Sing the song, ‘I’ am fearfully and wonderfully made’",
            "memorise Isaiah 49:16"
          ],
          "keyInquiryQuestions": ["What makes you a special creation?"]
        },
        {
          "subStrandId": "1.2",
          "subStrandTitle": "My Family",
          "specificLearningOutcomes": [
            "name members of their family",
            "pray with family members to foster unity",
            "identify five items they share at home",
            "appreciate family members by praying with them"
          ],
          "suggestedLearningExperiences": [
            "list names of family members on flashcards",
            "draw and colour family members",
            "demonstrate how they pray at home",
            "list the number of times they pray at home as a family",
            "mention instances they lead prayers at home",
            "in groups or pairs, list items they share at home",
            "colour a picture of a family sharing a meal",
            "sing the song, ’Read your Bible pray every day’",
            "memorise Matthew 7:7"
          ],
          "keyInquiryQuestions": [
            "How do you relate with members of your family?"
          ]
        },
        {
          "subStrandId": "1.3",
          "subStrandTitle": "Creation of Plants and Animals",
          "specificLearningOutcomes": [
            "name plants and animals in the environment",
            "take part in keeping the home environment clean",
            "appreciate God’s creation by caring for plants and animals"
          ],
          "suggestedLearningExperiences": [
            "picture-read Genesis 1:11, 24",
            "name various plants and animals created by God and write them on flashcards",
            "take a nature walk and identify different plants and animals in their environment",
            "draw and colour some plants and animals in the school environment",
            "say how they participate in keeping the home environment clean",
            "model some animals and display their work in class"
          ],
          "keyInquiryQuestions": [
            "Why should you take care of plants and animals?"
          ]
        }
      ]
    },
    {
      "strandId": "2.0",
      "strandTitle": "The Holy Bible",
      "subStrands": [
        {
          "subStrandId": "2.1",
          "subStrandTitle": "The Word of God",
          "specificLearningOutcomes": [
            "identify five ways of handling the Holy Bible",
            "mention the two divisions of the Holy Bible",
            "name the first two books in the New Testament",
            "desire to handle the Holy Bible with respect"
          ],
          "suggestedLearningExperiences": [
            "say how they take care of the Holy Bible",
            "tell why they should respect the Holy Bible",
            "role-play handling the Holy Bible with care and respect",
            "in small groups mention the two divisions of the Holy Bible (Old and New Testament)",
            "name the first two Gospel books (Matthew and Mark)",
            "listen to and sing a song about the Bible",
            "sing a song on ‘read your Bible pray every day’"
          ],
          "keyInquiryQuestions": [
            "Why should you handle the Holy Bible with respect?"
          ]
        },
        {
          "subStrandId": "2.2",
          "subStrandTitle": "Bible Story: Joseph and his brothers",
          "specificLearningOutcomes": [
            "narrate the story of Joseph and his brothers",
            "discuss ways they treat their siblings",
            "identify three values needed for peaceful co-existence",
            "desire to live harmoniously with family members"
          ],
          "suggestedLearningExperiences": [
            "watch a video on Joseph’s coat of many colours in Genesis 37:3-4",
            "draw a coat and colour it",
            "in turns, picture-read Joseph’s dream in Genesis 37:5-8,in groups, picture-read Genesis 37:9-11",
            "role-play the story of Joseph",
            "say why Joseph’s brothers hated him",
            "in groups, share experiences of how they should treat their brothers and sisters",
            "list values needed to live well with others",
            "sing a song about Joseph and his coat of many colours"
          ],
          "keyInquiryQuestions": ["How did Joseph relate with his brothers?"]
        },
        {
          "subStrandId": "2.3",
          "subStrandTitle": "Bible Story: The chariot of fire",
          "specificLearningOutcomes": [
            "retell the story of Elijah and the chariot of fire",
            "list three ways of having a good relationship with God",
            "desire to respect God and their parents"
          ],
          "suggestedLearningExperiences": [
            "picture-read 2 Kings 2:1,11-12",
            "in groups draw and colour the chariot of fire",
            "watch a video clip of Elijah and the Chariot of fire",
            "in pairs, tell their friend three ways of pleasing God",
            "sing a song about Elijah and the Chariot of Fire",
            "write 2 Kings 2:12 on flashcards and display it in the Christian Religious Education learning corner",
            "in groups, tell ways they respect their parents or guardians at home"
          ],
          "keyInquiryQuestions": ["How did Elijah honour God?"]
        }
      ]
    },
    {
      "strandId": "3.0",
      "strandTitle": "The Early Life of Jesus Christ",
      "subStrands": [
        {
          "subStrandId": "3.1",
          "subStrandTitle": "The Birth of Jesus Christ",
          "specificLearningOutcomes": [
            "retell the birth of Jesus Christ",
            "dramatise the birth of Jesus Christ",
            "express the joy of the angels through song and dance",
            "appreciate the birth of Jesus by participating in Christmas celebrations"
          ],
          "suggestedLearningExperiences": [
            "picture-read the birth of Jesus according to Luke 2:4-13 and retell the story",
            "role-play the birth of Jesus Christ",
            "listen and dance to a recorded Christmas carol ‘We wish you a Merry Christmas’",
            "sing a song related to Luke 2:13-14",
            "observe pictures of Jesus Christ’s parents and name each of them as they point at the pictures",
            "observe pictures or watch a video clip of angels worshipping Baby Jesus",
            "sing and dance to the song of the angels (Luke 2:13-14)"
          ],
          "keyInquiryQuestions": [
            "Why do we celebrate the birth of Jesus Christ?"
          ]
        },
        {
          "subStrandId": "3.2",
          "subStrandTitle": "Jesus Christ in the Temple",
          "specificLearningOutcomes": [
            "retell the story of Jesus Christ in the Temple",
            "obey their parents as portrayed by Jesus Christ",
            "take part in Sunday or Sabbath school activities",
            "desire to accompany their parents to church as portrayed by Jesus Christ"
          ],
          "suggestedLearningExperiences": [
            "draw and colour the church",
            "in turns picture read Luke 2: 42-49",
            "observe pictures of Jesus Christ in the temple",
            "sequentially arrange flashcards on the events that took place when Jesus was left in the temple",
            "tell how Jesus Christ obeyed His parents",
            "share experiences of how they obey their parents at home",
            "list activities they engage in at Sunday or Sabbath School"
          ],
          "keyInquiryQuestions": ["Why did Jesus Christ visit the temple?"]
        },
        {
          "subStrandId": "3.3",
          "subStrandTitle": "Baptism of Jesus Christ",
          "specificLearningOutcomes": [
            "name the place where Jesus Christ was baptised",
            "identify the person who baptised Jesus Christ",
            "practise humility in their interaction with others"
          ],
          "suggestedLearningExperiences": [
            "mention occasions, they witnessed people being baptised in their churches",
            "in turns, picture-read Matthew 3:13-15",
            "watch a video clip on the Baptism of Jesus Christ",
            "mention the place where Jesus was baptised",
            "name the person who baptised Jesus Christ",
            "in groups draw and colour Jesus being baptised",
            "tell how Jesus showed humility during His baptism",
            "sing baptismal songs familiar to them"
          ],
          "keyInquiryQuestions": [
            "Why is the baptism of Jesus Christ important to Christians today?"
          ]
        },
        {
          "subStrandId": "3.4",
          "subStrandTitle": "Wedding at Cana of Galilee",
          "specificLearningOutcomes": [
            "retell how Jesus changed water into wine",
            "obey instructions as portrayed in the wedding at Cana",
            "desire to be obedient in their interaction with others"
          ],
          "suggestedLearningExperiences": [
            "in groups, tell a story of a wedding that they attended and what they liked most",
            "picture-read the story of changing water into wine; John 2:1-10",
            "watch a video clip on the miracle of changing water into wine",
            "tell how the servants responded to Jesus’ instructions in John 2:7-9",
            "sing a song related to this miracle",
            "share experiences of how they depend on God to provide for their needs",
            "in groups, role-play how they obey their parents and teachers",
            "draw and colour the six jars of water"
          ],
          "keyInquiryQuestions": ["What happened at Cana of Galilee?"]
        },
        {
          "subStrandId": "3.5",
          "subStrandTitle": "Healing Simon’s mother-in-law",
          "specificLearningOutcomes": [
            "retell the healing of Simon’s mother-in-law",
            "show gratitude to others as portrayed by Simon’s mother- in- law",
            "appreciate Jesus’s power to heal the sick"
          ],
          "suggestedLearningExperiences": [
            "share experiences of how they help learners in need",
            "role-play an instance where they helped a learner in need",
            "picture-read the miracle according to Luke 4:38- 39",
            "arrange pictures based on the miracle sequentially",
            "retell the miracle after watching a video clip",
            "role-play the healing of Simon’s mother-in-law",
            "write a thank you note to parents and others who help them in their daily lives",
            "sing thanksgiving songs to express gratitude to God"
          ],
          "keyInquiryQuestions": [
            "How did Simon’s mother-in-law express gratitude?"
          ]
        }
      ]
    },
    {
      "strandId": "4.0",
      "strandTitle": "Christian Values",
      "subStrands": [
        {
          "subStrandId": "4.1",
          "subStrandTitle": "Sharing",
          "specificLearningOutcomes": [
            "identify items they share at home as a family",
            "practise the value of sharing at home and school",
            "retell the story of the little boy with two fish and five loaves",
            "desire to keep the environment clean and avoid wastage"
          ],
          "suggestedLearningExperiences": [
            "identify items that can be shared at home",
            "in pairs mention items shared at home and school",
            "watch or listen to the miracle in John 6:1-14",
            "role-play the story of the little boy with two fish and five loaves",
            "draw and colour the two fish and five loaves",
            "sing a song on sharing",
            "keep the environment clean (John 6:12-13)"
          ],
          "keyInquiryQuestions": ["Why is it important to share with others?"]
        },
        {
          "subStrandId": "4.2",
          "subStrandTitle": "Obedience",
          "specificLearningOutcomes": [
            "list the importance of obeying parents",
            "practise obedience at home as guided by the scriptures",
            "exercise obedience in day-to-day life"
          ],
          "suggestedLearningExperiences": [
            "in pairs read Ephesians 6:1-3",
            "in groups mention why they should obey their parents",
            "say the benefits of obeying parents",
            "in pairs tell how they obey their parents at home",
            "listen to and sing a song on obedience",
            "memorise Ephesians 6:2-3"
          ],
          "keyInquiryQuestions": ["Why should you obey your parents?"]
        },
        {
          "subStrandId": "4.3",
          "subStrandTitle": "Honesty",
          "specificLearningOutcomes": [
            "state reasons for telling the truth",
            "demonstrate honesty by not stealing other people’s items",
            "practise punctuality at school and home",
            "desire to be truthful in their daily lives"
          ],
          "suggestedLearningExperiences": [
            "game read Ephesians 4:25",
            "in groups say why they should always speak the truth",
            "say why they should not steal or pick items that do not belong to them",
            "role-play situations of honesty while dealing with other people’s items",
            "sing a song on truthfulness",
            "story tell instances they took lost and found items to the teacher",
            "mention reasons for getting home and school on time (punctuality)"
          ],
          "keyInquiryQuestions": ["Why is it bad to lie?"]
        },
        {
          "subStrandId": "4.4",
          "subStrandTitle": "Thankfulness",
          "specificLearningOutcomes": [
            "mention three ways of expressing gratitude to their parents or guardians",
            "practise thankfulness at home as guided by the Bible",
            "desire to be thankful in daily life"
          ],
          "suggestedLearningExperiences": [
            "say why they should thank their parents",
            "in pairs share when to thank parents",
            "role-play how to thank parents",
            "compose and recite a poem on thanking their parents",
            "sing a song about praising God for the gift of parents or guardians",
            "write 1Thessalonians 5:18 on flashcards and recite it",
            "write flashcards on why they should be thankful to their parents or guardians and display the cards in class"
          ],
          "keyInquiryQuestions": [
            "Why should you thank your parents or guardians?"
          ]
        }
      ]
    },
    {
      "strandId": "5.0",
      "strandTitle": "The Church",
      "subStrands": [
        {
          "subStrandId": "5.1",
          "subStrandTitle": "A House of God",
          "specificLearningOutcomes": [
            "recognise the Church as a place of worship and respect it",
            "demonstrate responsibility by serving God in Church",
            "desire to grow in faith by attending Sunday or Sabbath School"
          ],
          "suggestedLearningExperiences": [
            "in pairs mention ways they respect the church as a place of worship",
            "list the benefits of going to church",
            "list the number of times they go to church",
            "role-play activities they do in church (e.g. praying, reading the Bible, singing, dancing)",
            "sing and dance to the song in Psalms 100:4 (I will enter His gates with thanksgiving…)"
          ],
          "keyInquiryQuestions": [
            "Why do you go to Church?",
            "Why should you respect the Church?"
          ]
        },
        {
          "subStrandId": "5.2",
          "subStrandTitle": "A House of Prayer",
          "specificLearningOutcomes": [
            "recite simple thanksgiving prayers",
            "practise saying simple prayers at different times of the day",
            "desire to pray always as taught by Jesus Christ"
          ],
          "suggestedLearningExperiences": [
            "picture-read Mathew 21:13",
            "in groups compose and recite simple prayers",
            "pray for family members",
            "list the number of times they pray at home or in Sunday or /Sabbath School",
            "say simple prayers before and after taking meals and before they leave for home"
          ],
          "keyInquiryQuestions": ["Why is it important to pray always?"]
        }
      ]
    }
  ]
}
