{
  "subject": "Mathematics",
  "grade": "Grade 9",
  "educationLevel": "Junior Secondary",
  "strands": [
    {
      "strandNumber": "1.0",
      "strandName": "NUMBERS",
      "subStrands": [
        {
          "subStrandNumber": "1.1",
          "subStrandName": "INTEGERS",
          "numberOfLessons": 5,
          "specificLearningOutcomes": [
            "perform basic operations on Integers in different situations",
            "work out combined Operations on Integers in different situations",
            "apply Integers to real life situations",
            "use IT or other resources to learn more on integers",
            "appreciate use of integers in real life situations"
          ],
          "suggestedLearningExperiences": [
            "discuss and work out basic operations on integers using number cards and charts. Play games involving numbers and operations. Pick integers and perform all basic operations.",
            "work out combined operations of integers in the correct order",
            "carry out activities such as reading temperature changes in a thermometer and discuss how to record it. Consider temperatures below zero points. They should consider cases of use of integers in real life.",
            "use IT and other resources such as print to carry out operations on integers.",
            "play creative games that involve integers."
          ],
          "keyInquiryQuestions": [
            "How do we carry out operations of integers in real life situations?",
            "How do we apply integers in daily activities?"
          ],
          "coreCompetencies": [
            "Critical thinking and problem solving- interpretation and inference: as learners work out combined operations of integers in the correct order",
            "Learning to learn- organizing own learning; as learners carry out activities such as reading temperature changes in a thermometer and discuss how to record it.",
            "Digital literacy- interacting with technologies; as learners use IT devices to determine temperature."
          ],
          "values": [
            "Respect; as learners work in pairs/groups to carry out activities such as reading temperature changes in a thermometer and discuss how to record it.",
            "Unity; as learners work towards achieving set goals of reading thermometer."
          ],
          "pcis": [
            "Environmental education; as learners read temperature changes in a thermometer that tell about the climate"
          ],
          "linkToOtherSubjects": [
            "Learners discuss in groups using language skills on how to work out combined operations of integers in the correct order."
          ]
        },
        {
          "subStrandNumber": "1.2",
          "subStrandName": "CUBES AND CUBE ROOTS",
          "numberOfLessons": 5,
          "specificLearningOutcomes": [
            "Work out cubes of numbers by multiplication in real life situations",
            "Determine cubes of numbers from mathematical tables in different situations",
            "Determine cube roots of numbers by factor method in different situations",
            "Determine cube roots of numbers from mathematical tables in different situations",
            "Apply cubes and cube roots in real life situations",
            "Work out cubes and cube roots using IT devices"
          ],
          "suggestedLearningExperiences": [
            "use stacks of cubes to demonstrate the concept of cube and cube roots.",
            "demonstrate stacking of cubes.",
            "discuss the volume of a cube and determine both the cube and cube root and relate the two.",
            "read the cube of numbers from mathematical tables and relate to cube roots",
            "use IT devices to determine cube and cube roots of numbers."
          ],
          "keyInquiryQuestions": [
            "How do we work out the cubes of numbers?",
            "How do we work out the cube roots of numbers?",
            "Where do we apply cubes and cube roots in real life situations?"
          ],
          "coreCompetencies": [
            "Communication and collaboration- speaking and listening; as learners work in groups to use stacks of cubes to demonstrate the concept of cube and cube roots.",
            "Imagination and creativity- open mindedness and creativity; as learners determine both the cube and cube root and relate the two."
          ],
          "values": [
            "Respect; as learners appreciate each other's contribution in pairs/groups discussion."
          ],
          "pcis": [],
          "linkToOtherSubjects": [
            "Learners use stacks of cubes to demonstrate the concept of cube and cube roots, relate to objects in the environment.",
            "Learners use new terms in reading measurements of length in cubes as learnt in Languages."
          ]
        },
        {
          "subStrandNumber": "1.3",
          "subStrandName": "INDICES AND LOGARITHMS",
          "numberOfLessons": 6,
          "specificLearningOutcomes": [
            "Express numbers in index form in different situations",
            "Generate the laws of Indices in different situations",
            "Apply the laws of indices in different situations",
            "Relate Powers of 10 to common logarithms in different situations",
            "Use IT to learn more on indices and common logarithms",
            "Appreciate use of indices and logarithms in real life situations"
          ],
          "suggestedLearningExperiences": [
            "discuss indices and identify the base.",
            "show the laws of indices using multiplication and division.",
            "use the laws of indices to work out indices",
            "discuss and relate powers of 10 to common logarithms",
            "use IT to work out common logarithms or use mathematical tables"
          ],
          "keyInquiryQuestions": [
            "How do we express numbers in powers?"
          ],
          "coreCompetencies": [
            "Critical thinking and problem solving; as learners show the laws of indices using multiplication and division.",
            "Self-efficacy; as learners discuss and relate powers of 10 to common logarithms"
          ],
          "values": [
            "Responsibility; as learners take their roles in turns to lead the groups in discussions on indices.",
            "Unity; as learners measure capacity in groups."
          ],
          "pcis": [
            "Learners relate self-awareness to their own ides as they discuss concept of Indices."
          ],
          "linkToOtherSubjects": [
            "Learners express numbers as indices and powers as used in Integrated Science."
          ]
        },
        {
          "subStrandNumber": "1.4",
          "subStrandName": "COMPOUND PROPORTIONS AND RATES OF WORK",
          "numberOfLessons": 12,
          "specificLearningOutcomes": [
            "divide quantities into proportional parts in real life situations",
            "relate different ratios in real life situations",
            "work out compound proportions using ratio method in different situations",
            "calculate rates of work in real life situations",
            "use IT devices to learn more on Compound proportions and rates of work",
            "appreciate use of Compound proportions and rates of work in real life situations"
          ],
          "suggestedLearningExperiences": [
            "discuss and divide quantities into proportional parts and express as a fraction",
            "compare and write different ratios",
            "determine compound proportions using ratios",
            "work out rates of work.",
            "play games on rates of work using IT devices."
          ],
          "keyInquiryQuestions": [
            "What are proportions?",
            "Why do we work fast?"
          ],
          "coreCompetencies": [
            "Citizenship- active community life skills; as learners work in pairs/groups to discuss and divide quantities into proportional parts and express as a fraction.",
            "Critical thinking and problem solving- interpretation and inference; as learners work out rates of work."
          ],
          "values": [
            "Responsibility; as learners commit to working out answers of given tasks on rates.",
            "Respect for self and others; as learners in pairs/groups and work out rates of work."
          ],
          "pcis": [
            "Self-esteem; as learners device personal strategies to estimate products in multiplication."
          ],
          "linkToOtherSubjects": [
            "Agriculture and nutrition helps learners to estimate harvests, seeds or fertilizer required for sowing or application as part of rates of work."
          ]
        }
      ]
    },
    {
      "strandNumber": "2.0",
      "strandName": "ALGEBRA",
      "subStrands": [
        {
          "subStrandNumber": "2.1",
          "subStrandName": "MATRICES",
          "numberOfLessons": 8,
          "specificLearningOutcomes": [
            "identify a matrix in different situations",
            "determine the order of a matrix in different situations",
            "determine the position of items in a matrix in different situations",
            "determine compatibility of matrices in addition and subtraction",
            "carry out addition and subtraction of matrices in real life situations",
            "reflect on the use of matrices in real life situations"
          ],
          "suggestedLearningExperiences": [
            "discuss the use of tables such as football league tables, travel schedules, shopping lists and any other. Count the number of rows and columns in the table, which is a matrix.",
            "arrange items in rows and columns and discuss how to represent a matrix.",
            "organize objects in rows and columns and give the order of the matrix in terms of row and columns (row x column).",
            "discuss and identify the position of each item or element in terms of row and column.",
            "discuss and identify matrices that have equal number of rows and equal number of columns (same order) for compatibility in addition and subtraction.",
            "discuss and note what is represented by the rows and what is represented by the columns from two or more matrices to carry out addition or subtraction."
          ],
          "keyInquiryQuestions": [
            "How do we use matrices in real life situations?"
          ],
          "coreCompetencies": [
            "Communication and collaboration - as learners discuss use of tables to represent matrices.",
            "Learning to learn - as learners arrange items or elements in rows and columns to form matrices."
          ],
          "values": [
            "Integrity - as learners organize objects in rows and columns and give the order of the matrix"
          ],
          "pcis": [
            "Social and economic issues - as learners discuss the use of tables such as football league tables and shopping lists.",
            "Citizenship - as learners discuss how to use travel schedules to different places."
          ],
          "linkToOtherSubjects": [
            "Learners generate tables of results in sports and refer to league schedules and relate this to sporting activities in creative Arts and Sports."
          ]
        },
        {
          "subStrandNumber": "2.2",
          "subStrandName": "EQUATIONS OF A STRAIGHT LINE",
          "numberOfLessons": 15,
          "specificLearningOutcomes": [
            "identify the gradient in real life situations",
            "determine the gradient of a line from two known points",
            "determine the equation of a straight line given two points",
            "determine the equation of a straight line from a known point and a gradient",
            "express the equation of a straight line in the form of 𝑦 = 𝑚𝑥+ 𝑐",
            "interpret the equation 𝑦 = 𝑚𝑥+ 𝑐 in different situations",
            "determine the x and y intercepts of a straight line",
            "recognize the use of equations of straight lines in real life"
          ],
          "suggestedLearningExperiences": [
            "discuss steepness in relation to gradient from the immediate environment.",
            "incline a ladder at different positions on the wall to demonstrate change in steepness of gradient. Discuss and compare the positions that the ladder is steeper.",
            "observe and climb up and down places such as the stairs or hills and relate to gradients.",
            "work out the equation of a straight line given two points or given a point and a gradient.",
            "discuss and rewrite the equation of a straight line as 𝑦 = 𝑚𝑥+ 𝑐. Explain the variables and constants in the equation.",
            "work out the value of x when y is zero and the value of y when is zero.",
            "use IT or other resources to show different hills and mountains and discuss steepness."
          ],
          "keyInquiryQuestions": [
            "How do we use gradient or steepness in our daily activities?",
            "How do we interpret graphs of straight lines?"
          ],
          "coreCompetencies": [
            "Digital literacy - as learners IT or others resources to explore steepness or gradient of places.",
            "Learning to learn - as learners place the ladder at different points on the ground as they discuss and compare steepness."
          ],
          "values": [
            "Integrity - as learners observe gradient/steepness in staircases in buildings, bridges or ramps."
          ],
          "pcis": [
            "Safety - as learners climb up and down places such as the stairs or hills and relate to gradients.",
            "Education for Sustainable Development (ESD) - as learners participate and choose careers in games and sporting activities."
          ],
          "linkToOtherSubjects": [
            "Integrated science helps learners relate use the ladder to make work easier by using different gradients.",
            "Pre-technical Studies as learners discuss and compare the gradients of parallel and perpendicular lines as it is done in technical drawing."
          ]
        },
        {
          "subStrandNumber": "2.3",
          "subStrandName": "LINEAR INEQUALITIES",
          "numberOfLessons": 6,
          "specificLearningOutcomes": [
            "solve linear inequalities in one unknown",
            "represent linear inequalities in one unknown graphically",
            "represent linear inequality in two unknowns graphically",
            "apply linear inequalities to real life situations",
            "reflect on the use of linear inequalities in real life"
          ],
          "suggestedLearningExperiences": [
            "discuss why sometimes resources are shared unequally.",
            "discuss simple inequality statements, form and work out the inequalities in one unknown.",
            "discuss and generate a table of values and draw linear inequalities in one unknown. Indicate and discuss the region that satisfies the inequalities.",
            "discuss and generate a table of values and draw linear inequalities in two unknowns. Indicate and discuss the region that satisfies the inequalities.",
            "discuss and work out linear inequalities that involve real life cases",
            "use IT or other graphing tools to present linear inequalities"
          ],
          "keyInquiryQuestions": [
            "How do we represent linear inequalities in graphs?",
            "How do we use linear inequalities in real life situations?"
          ],
          "coreCompetencies": [
            "Digital literacy - as learners use IT resources to present linear inequalities.",
            "Communication and collaboration - as learners discuss and generate table of values and draw linear inequalities."
          ],
          "values": [
            "Social justice - as learners apply concepts of inequalities and equity in sharing available resources real in life situations."
          ],
          "pcis": [
            "Citizenship - as learners discuss and indicate the regions that satisfy inequalities."
          ],
          "linkToOtherSubjects": [
            "Social studies - as learners discuss inequality statements that may involve distribution of resources."
          ]
        }
      ]
    },
    {
      "strandNumber": "3.0",
      "strandName": "MEASUREMENTS",
      "subStrands": [
        {
          "subStrandNumber": "3.1",
          "subStrandName": "AREA",
          "numberOfLessons": 8,
          "specificLearningOutcomes": [
            "calculate the area of a pentagon and a hexagon in different situations",
            "work out the surface area of triangular and rectangular based prisms",
            "work out the surface area of triangular, rectangular and square based pyramids",
            "calculate the area of a sector and segment of a circle",
            "work out the surface area of a cone in real life situations",
            "calculate the surface area of a sphere in real life situations",
            "recognize the use of area in real life situations"
          ],
          "suggestedLearningExperiences": [
            "discuss the properties of regular polygons and use cut outs to work out the area of pentagons and hexagons.",
            "collect from the environment objects that are spheres, cones/funnels, pyramids, prisms and frustums.",
            "discuss and sketch the nets of the solids.",
            "use models of prisms to work out the surface area of prisms.",
            "open up the net and draw the faces of a pyramid. Use the relevant formulas of area of plane figures to work out the surface area of the pyramid.",
            "draw a circle with a sector, a chord and a segment and discuss the relationship and make cut outs of a sector and a segment. Determine the area of a sector and a segment.",
            "open the cone to form a net and determine the curved surface area of a cone. Work out the surface area of a closed and an open cone.",
            "use relevant formulas to work out the surface area of different sizes of spherical balls.",
            "use IT or other resources to sketch different models and nets."
          ],
          "keyInquiryQuestions": [
            "How do we determine the area of different surfaces?"
          ],
          "coreCompetencies": [
            "Communication and collaboration - as learners work in groups to discuss the properties of regular polygons and use cutouts to work out the area of pentagon and hexagon.",
            "Creativity and imagination - as learners open nets of different models and work out surface area."
          ],
          "values": [
            "Responsibility - as learners take care and work out surface area using models and open nets of different objects."
          ],
          "pcis": [
            "Patriotism - as learners collect objects from the environment, use and dispose of them safely."
          ],
          "linkToOtherSubjects": [
            "Pre-Technical Studies as learners use models and open nets of different objects."
          ]
        },
        {
          "subStrandNumber": "3.2",
          "subStrandName": "VOLUME OF SOLIDS",
          "numberOfLessons": 8,
          "specificLearningOutcomes": [
            "work out the volume of a triangular and rectangular based prisms",
            "calculate the volume of a triangular, rectangular and squares based pyramids",
            "work out the volume of a cone in real life situations",
            "determine the volume of a frustum in real life situations",
            "calculate the volume of a sphere in real life situations",
            "promote use of volume and capacity of different containers in real life situations"
          ],
          "suggestedLearningExperiences": [
            "collect different containers and objects. This may include prisms, pyramids, cones, funnels and balls.",
            "identify and discuss the model of a prism. Using the relevant formulas, determine the volume of a prism.",
            "use relevant formulae to work out the volume of pyramids and cones.",
            "identify and work out the volume of models of a pyramid. Cut the pyramid into two parts to get a frustum and a small pyramid and determine the volume of the frustum using relevant formula.",
            "Play any games involving different sizes of balls and work out volume of a sphere.",
            "use IT or other resources to determine the volumes of solids."
          ],
          "keyInquiryQuestions": [
            "How do we determine the volume of different solids?",
            "How do we use the volume of solids in real life situations?"
          ],
          "coreCompetencies": [
            "Critical thinking and problem solving - as learners identify and work out the volume of a frustum from a pyramid",
            "Creativity and Imagination - as learners identify, discuss and work out volume of solids."
          ],
          "values": [
            "Responsibility - as learners take care of the models of pyramids, cones, and spheres.",
            "Patriotism - as learners collect objects from the environment to determine and discuss models/objects for different volumes of solids."
          ],
          "pcis": [
            "Environmental Education - as learners take care of the environment while collecting the containers and objects.",
            "Safety - as learners collect containers and objects cautiously."
          ],
          "linkToOtherSubjects": [
            "Creative Arts and sports - as learners make models of pyramids, cones/funnels and spheres/balls from available materials."
          ]
        },
        {
          "subStrandNumber": "3.3",
          "subStrandName": "MASS, VOLUME, WEIGHT AND DENSITY",
          "numberOfLessons": 8,
          "specificLearningOutcomes": [
            "convert units of mass from one form to another in different situations",
            "relate mass and weight in real life situations",
            "determine mass, volume and density in different situations",
            "apply density to real life situations",
            "recognize the use of density in daily life"
          ],
          "suggestedLearningExperiences": [
            "discuss different instruments and tools used in weighing materials or objects and relate to consumer awareness and protection.",
            "Collect and weigh different materials or objects and change one unit of mass to another.",
            "discuss the relationship between mass and weight.",
            "carry out activities relating mass and volume to density using containers or different substances.",
            "discuss and find the density of different materials or objects.",
            "work out mass, volume and density using IT or other resources."
          ],
          "keyInquiryQuestions": [
            "How do you weigh materials and objects?"
          ],
          "coreCompetencies": [
            "Communication and collaboration - as learners discuss the relationship between mass and weight.",
            "Creativity and imagination - as learners determine the density of different materials or objects.",
            "Digital literacy - as learners use IT devices to determine the mass, volume and density of different objects."
          ],
          "values": [
            "Integrity - as learners give correct masses and weights of different material and objects.",
            "Responsibility - as learners work and take care of weighing machines and other resources."
          ],
          "pcis": [
            "Education for Sustainable Development (ESD) - Careers in business such as shop keeping.",
            "Self-awareness - as learners weigh themselves for health purposes."
          ],
          "linkToOtherSubjects": [
            "Home Science - as learners weigh different quantities for a variety of recipes.",
            "Integrated science - as learners use machines and tools which involve weighing and balancing."
          ]
        },
        {
          "subStrandNumber": "3.4",
          "subStrandName": "TIME, DISTANCE AND SPEED",
          "numberOfLessons": 10,
          "specificLearningOutcomes": [
            "work out speed in km/h and m/s in real life situations",
            "work out average speed in real life situations",
            "determine velocity in real life situations",
            "work out acceleration in real life situations",
            "identify the longitudes on the globe",
            "relate longitudes to time on the globe",
            "determine local time of places on the earth along different longitudes",
            "appreciate use of time and distance in real life situations"
          ],
          "suggestedLearningExperiences": [
            "engage in activities that will involve measuring distances and time, for example running track events to determine speed.",
            "discuss and relate distance and time.",
            "discuss the difference between velocity and speed.",
            "Discuss and determine acceleration from track events in school or community.",
            "discuss and use maps and models of a globe to work out and relate time of different places on the earth.",
            "use IT devices to watch videos on the globe, longitudes and time zones in different parts of the earth.",
            "use other resources such as maps to locate different places (cities) on the earth and discuss time differences."
          ],
          "keyInquiryQuestions": [
            "How do we observe speed in daily activities?",
            "Why does time vary in different places of the world?"
          ],
          "coreCompetencies": [
            "Self-efficacy - as learners participate in track events to measure speed.",
            "Digital literacy -as learners use IT devices to determine time in different zones in the world.",
            "Citizenship- global citizenship as learners determine local time in different parts of the world."
          ],
          "values": [
            "Integrity- as learners correctly record individual running time during track events and other games.",
            "Respect - as learners adhere to their lanes on track events and other games."
          ],
          "pcis": [
            "Safety - as learners observe safety measures and time during games and sports.",
            "Education for Sustainable Development (ESD) - as learners participate and choose careers in games and sporting activities.",
            "Self-awareness - as learners participate and time themselves in games."
          ],
          "linkToOtherSubjects": [
            "Integrated science - as learners use digital devices to tell time in different zones of the world."
          ]
        },
        {
          "subStrandNumber": "3.5",
          "subStrandName": "MONEY",
          "numberOfLessons": 7,
          "specificLearningOutcomes": [
            "identify currencies that are used in different countries",
            "convert currency from one form to another in real life situations",
            "work out import and export duties charged on goods and services",
            "work out excise duty charged on goods and services",
            "determine value added tax charged on goods and services",
            "appreciate use of money in day to day activities"
          ],
          "suggestedLearningExperiences": [
            "use IT or other resources to obtain and compile a collage of currencies from different countries. For example, currencies of East African Countries, US dollars, Euro, Yen and Sterling pound.",
            "work out currency exchange from Kenya Shillings to any other currency and vice versa.",
            "discuss and determine the export and import duty charges on different goods.",
            "discuss and identify goods that attract excise duty. Determine excise duty.",
            "use receipts from shopping to discuss and work out VAT on goods and services.",
            "identify currency exchange rates from different sources including daily papers, IT devices, financial institutions and relate this to consumer awareness and protection."
          ],
          "keyInquiryQuestions": [
            "Why do we change currencies from one form to another?",
            "What are the types of taxes the government levy on its citizens?"
          ],
          "coreCompetencies": [
            "Global Citizenship - as learners of different currencies of the world.",
            "Digital Literacy - as learners use digital devices to learn on exchange rates for foreign currency."
          ],
          "values": [
            "Integrity - as learners accurately work out currency, import and exchange rates.",
            "Social Cohesion - as learners work and appreciate exchange rates for other countries."
          ],
          "pcis": [
            "Financial Literacy - as learners learn the currencies used in different countries",
            "Education for Sustainable Development (ESD) - as learners choose careers in business, imports and exports."
          ],
          "linkToOtherSubjects": [
            "Pre-technical studies - as learners work out VAT and currency exchange."
          ]
        },
        {
          "subStrandNumber": "3.6",
          "subStrandName": "APPROXIMATIONS AND ERRORS",
          "numberOfLessons": 5,
          "specificLearningOutcomes": [
            "approximate quantities in measurements in different situations",
            "determine errors using estimations and actual measurements of quantities",
            "determine percentage errors using actual measurements of quantities",
            "appreciate approximations and errors in real life situations"
          ],
          "suggestedLearningExperiences": [
            "carryout activities of measurements of different quantities such as length, area, volume, capacity and mass using arbitrary units.",
            "Estimate and measure different quantities using appropriate instruments. compare the estimates and the actual measurements and determine the error.",
            "work out the percentage error from the estimated and the actual measurements",
            "work out errors using IT devices or other resources and relate this to consumer awareness."
          ],
          "keyInquiryQuestions": [
            "How do we estimate measurements of different quantities?"
          ],
          "coreCompetencies": [
            "Creativity and imagination - as learners carry out measurements of different quantities and discuss error.",
            "Digital literacy - as learners use IT devices as they compute errors."
          ],
          "values": [
            "Integrity - as learners measure different quantities and minimize errors.",
            "Responsibility - as learners take care of tools for measuring different quantities."
          ],
          "pcis": [
            "Safety - as learners handle measuring tools with care."
          ],
          "linkToOtherSubjects": [
            "Integrated science - as learners measure different quantities that may involve errors as they carry out experiments."
          ]
        }
      ]
    },
    {
      "strandNumber": "4.0",
      "strandName": "GEOMETRY",
      "subStrands": [
        {
          "subStrandNumber": "4.1",
          "subStrandName": "COORDINATES AND GRAPHS",
          "numberOfLessons": 6,
          "specificLearningOutcomes": [
            "plot out points on a Cartesian plane",
            "draw a straight line graph given an equation",
            "draw parallel lines on the Cartesian plane",
            "relate the gradients of parallel lines",
            "draw perpendicular lines on the Cartesian plane",
            "relate the gradients of perpendicular lines",
            "apply graphs of straight line in real life situation"
          ],
          "suggestedLearningExperiences": [
            "work in groups and locate the point of intersection of the x coordinate and the y- coordinates on a Cartesian plane.",
            "generate a table of values from equation a of a straight line, plot and join the points to form a straight line.",
            "Generate table of values for each of the given equations, plot and join them to form straight lines on the Cartesian plane",
            "work out the gradients of each of the lines and compare them to establish their relationship of parallelism.",
            "Generate table of values for each of the given equations of perpendicular lines, plot and join them to form straight lines on the Cartesian plane",
            "work out the gradients of each of the lines and compare them to establish the relationship of perpendicular lines."
          ],
          "keyInquiryQuestions": [
            "How do we draw graphs of straight lines?",
            "How do we interpret graphs of straight lines?"
          ],
          "coreCompetencies": [
            "Communication and collaboration",
            "Critical thinking and problem solving - as learners generate a table of values."
          ],
          "values": [
            "Responsibility - as learners take care of graphing instruments and other resources."
          ],
          "pcis": [
            "Education for Sustainable Development (ESD) - as learners generate tables of values and draw graphs of straight lines.",
            "Safety - as learners handle graphing instruments with sharp ends."
          ],
          "linkToOtherSubjects": [
            "Integrated Science - as learners plot graphs of straight lines in different quantities."
          ]
        },
        {
          "subStrandNumber": "4.2",
          "subStrandName": "SCALE DRAWING",
          "numberOfLessons": 14,
          "specificLearningOutcomes": [
            "identify compass and true bearings in real life situations",
            "determine the bearing of one point from another in real life situations",
            "locate a point using bearing and distance in real life situations",
            "identify angles of elevation in real life situations",
            "determine angles of elevation in different situations",
            "identify angles of depression in real life situations",
            "determine angles of depression in different situations",
            "apply scale drawing in simple surveying",
            "appreciate the use of scale drawing in real life situations"
          ],
          "suggestedLearningExperiences": [
            "draw and discuss the compass directions and relate to the compass and true North bearings.",
            "discuss and locate places from different points using bearings.",
            "discuss and locate a place using bearing and distance. Sketch and use scale drawing to show the position of places from given points.",
            "carryout different activities involving angles of elevation, for example observing different objects or points that are above. Discuss, sketch and make a scale drawing to determine the angles of elevation.",
            "Carryout different activities involving angles of depression, for example observing different objects or points that are below.",
            "discuss, sketch and make a scale drawing to determine the angles of depression.",
            "discuss and use scale drawing in simple surveying.",
            "observe maps or watch videos on bearings and simple surveying."
          ],
          "keyInquiryQuestions": [
            "How do we use scale drawing in real life?"
          ],
          "coreCompetencies": [
            "Creativity and imagination - as learners sketch and determine angles of elevation and depression",
            "Citizenship - as learners use scale drawing in simple surveying"
          ],
          "values": [
            "Unity - as learners sketch and agree on points in simple surveying.",
            "Social Cohesion - as learners observe maps and watch videos on land surveying."
          ],
          "pcis": [
            "Learners discuss possible Careers in scale drawing and surveying."
          ],
          "linkToOtherSubjects": [
            "Social studies helps learners work in groups to observe maps in surveying in locating bearing."
          ]
        },
        {
          "subStrandNumber": "4.3",
          "subStrandName": "SIMILARITY AND ENLARGEMENT",
          "numberOfLessons": 10,
          "specificLearningOutcomes": [
            "identify similar figures and their properties",
            "draw similar figures in different situations",
            "determine properties of enlargement of different figures",
            "apply properties of enlargement to draw similar objects and their images",
            "determine the linear scale factor of similar figures",
            "promote use of similarity and enlargement in real life situations"
          ],
          "suggestedLearningExperiences": [
            "collect objects and sort according to similarity. Discuss and note down properties of similar objects.",
            "use properties of similar objects to scale-draw similar figures.",
            "discuss and identify properties of enlargement.",
            "use properties of enlargement to represent objects and their images.",
            "determine the linear relationship of similar figures and objects.",
            "enlarge objects and figures using IT devices"
          ],
          "keyInquiryQuestions": [
            "What are similar objects?",
            "How do we use enlargement in real life situations?"
          ],
          "coreCompetencies": [
            "Critical thinking and problem solving - as learners draw similar and enlarged objects and figures.",
            "Digital literacy - as learners learn, use digital devices to enlarge objects and figures."
          ],
          "values": [
            "Responsibility - as learners collect similar objects and take care of them in the learning process.",
            "Social cohesion - as learners work in groups to draw similar objects and figures."
          ],
          "pcis": [
            "Environmental Education -as learners collect similar objects from the environment."
          ],
          "linkToOtherSubjects": [
            "Pre-Technical Studies contribute to learners scale-drawing similar figures and objects."
          ]
        },
        {
          "subStrandNumber": "4.4",
          "subStrandName": "TRIGONOMETRY",
          "numberOfLessons": 8,
          "specificLearningOutcomes": [
            "identify angles and sides of right angled triangles in different situations",
            "identify Sine, Cosine and Tangent ratios from a right angled triangle in different situations",
            "read tables of trigonometric ratios for acute angles",
            "determine trigonometric ratios of acute angles using calculators",
            "apply trigonometric ratios to calculate lengths and angles of right angled triangles in different situations",
            "appreciate use of trigonometric ratios in real life situations"
          ],
          "suggestedLearningExperiences": [
            "draw right angled triangles and recognize angles and sides. Discuss the relationship between angles and sides.",
            "discuss and relate the trigonometric ratios to angles in a right angled triangle.",
            "use trigonometric ratios to determine lengths and angles of right angled triangles",
            "use Mathematical tables or IT devices to find trigonometric ratios of given angles."
          ],
          "keyInquiryQuestions": [
            "What is the relationship between angles and sides in a right angled triangle?"
          ],
          "coreCompetencies": [
            "Critical thinking and problem solving - as learners relate the trigonometric ratios to angles in a right angled triangle.",
            "Digital literacy - as learners use tables or calculators to find trigonometric ratios of given angles."
          ],
          "values": [
            "Responsibility - as learners take care of digital devices, mathematical tables and drawing materials."
          ],
          "pcis": [
            "Safety - As learners plug and use digital devices"
          ],
          "linkToOtherSubjects": [
            "Pre-Technical Studies as learners draw right angled triangles and recognize angles and sides."
          ]
        }
      ]
    },
    {
      "strandNumber": "5.0",
      "strandName": "DATA HANDLING AND PROBABILITY",
      "subStrands": [
        {
          "subStrandNumber": "5.1",
          "subStrandName": "DATA INTERPRETATION (GROUPED DATA)",
          "numberOfLessons": 8,
          "specificLearningOutcomes": [
            "determine appropriate class width for grouping data",
            "draw frequency distribution tables of grouped data",
            "identify the modal class of grouped data",
            "calculate the mean of a grouped data from real life situations",
            "determine the median of a grouped data from real life situations",
            "appreciate data interpretation in real life situations"
          ],
          "suggestedLearningExperiences": [
            "collect data and work out an appropriate class width.",
            "tally the data and represent it in a frequency distribution table.",
            "recognize the modal class from a set of grouped data.",
            "work out the mean from different sets of grouped data.",
            "use the frequencies to determine the median class of grouped data.",
            "work out the median from different sets of grouped data.",
            "use IT or other materials to determine the mean and median of grouped data."
          ],
          "keyInquiryQuestions": [
            "How do we interpret data?",
            "How do we interpret data?"
          ],
          "coreCompetencies": [
            "Learning to learn - as learners collect, organize and interpret data.",
            "Critical thinking and problem solving - as learners discuss and determine the modal class, mean and median of grouped data.",
            "Digital literacy - as learners use IT or other materials to determine the mean and median of grouped data."
          ],
          "values": [
            "Respect - as learners work together in groups to collect data from the immediate environment."
          ],
          "pcis": [
            "Citizenship - as learners collect data that may relate to the population."
          ],
          "linkToOtherSubjects": [
            "Integrated science - as the learners interpret data related to different organisms and materials.",
            "Learners relate analyzing and interpreting data in different social aspects in Social Studies."
          ]
        },
        {
          "subStrandNumber": "5.2",
          "subStrandName": "PROBABILITY",
          "numberOfLessons": 6,
          "specificLearningOutcomes": [
            "perform experiments involving equally and likely outcomes in different situations",
            "determine the range of probability of an event",
            "identify mutually exclusive events in real life situations",
            "perform experiments of single chance involving mutually exclusive events",
            "perform experiments involving independent events in different situations",
            "draw a tree diagram for a single outcome",
            "appreciate the probability of events occurring in real life situations"
          ],
          "suggestedLearningExperiences": [
            "discuss and carry out experiments of events involving equally and likely outcomes.",
            "work out the range of probability of different events.",
            "discuss and carry out experiments involving mutually inclusive events.",
            "discuss and carry out experiments involving independent events.",
            "practice representing probability occurrences in a tree diagram.",
            "use IT or other resources to explore more on probability."
          ],
          "keyInquiryQuestions": [
            "Why is probability important in real life situations?"
          ],
          "coreCompetencies": [
            "Communication and collaboration - as learners discuss and carry out experiments of events involving equally likely outcomes.",
            "Critical thinking and problem solving - as learners carry out experiments involving mutually inclusive events.",
            "Self- efficacy -as learners carry out experiments involving independent events and avoid harmful practices of gambling."
          ],
          "values": [
            "Responsibility - as learners discuss and carry out experiments involving mutually inclusive events",
            "Social cohesion - as learners work in groups and practice representing probability occurrences in a tree diagram."
          ],
          "pcis": [
            "Financial Literacy - as learners carry out experiments involving independent events and avoid harmful practices of gambling using money"
          ],
          "linkToOtherSubjects": [
            "Learners work in groups to explore the weather patterns as they have learnt how it affects Agriculture."
          ]
        }
      ]
    }
  ]
}