{
  "grade": 2,
  "subjectName": "Religious Education (CRE/IRE/HRE)",
  "strands": [
    {
      "strandId": "1.0",
      "strandTitle": "Creation",
      "subStrands": [
        {
          "subStrandId": "1.1",
          "subStrandTitle": "Self- Awareness",
          "specificLearningOutcomes": [
            "state what they like about themselves",
            "list five different chores they do at home",
            "appreciate their physical appearance"
          ],
          "suggestedLearningExperiences": [
            "recite Psalms 139:13",
            "in pairs mention what they like about themselves",
            "draw pictures of what they like about their physical features",
            "in pairs observe and state in front of the class their similarities and differences (Genesis 1:27)",
            "be ordered from the shortest to the tallest and play games that give an advantage to both",
            "in pairs list the chores they do at home",
            "role-play different chores they do at home",
            "sing a song about their physical appearance, ’Mwili wangu ni wa ajabu sana nani aliyeniumba mimi nashangaa…’"
          ],
          "keyInquiryQuestions": ["Why are you a special creation?"]
        },
        {
          "subStrandId": "1.2",
          "subStrandTitle": "My Family",
          "specificLearningOutcomes": [
            "name family members to promote a sense of belonging",
            "state items shared at home to foster family unity",
            "identify four items that should not be shared at home for healthy living",
            "appreciate members of the extended family for harmonious co-existence"
          ],
          "suggestedLearningExperiences": [
            "in turns read Acts 10:2",
            "name members of their extended family",
            "draw and colour members of their extended family",
            "share experiences of how they relate with members of the extended family",
            "mention items they share at home",
            "list items that should not be shared at home",
            "say why they should not share the items listed"
          ],
          "keyInquiryQuestions": ["Why is family unity important?"]
        },
        {
          "subStrandId": "1.3",
          "subStrandTitle": "Creation of the sky, sun, moon, and stars",
          "specificLearningOutcomes": [
            "recognise God as the creator of the sky, sun, moon, and stars",
            "draw the sun, moon, and stars to appreciate God’s creation",
            "respect God as the creator of everything"
          ],
          "suggestedLearningExperiences": [
            "observe pictures of the sun, moon, and stars (Genesis 1:14-19)",
            "observe the sky and tell what they see during the day and at night",
            "draw and colour the sun, moon, and stars",
            "cut and mount pictures of the sun, moon, and stars on a chart",
            "sing a song on creation, ‘Bwana Mungu nashangaa kabisa’",
            "in groups, write the verse in Genesis 1:16 on flashcards and display it in class"
          ],
          "keyInquiryQuestions": ["Why is God’s creation peculiar?"]
        }
      ]
    },
    {
      "strandId": "2.0",
      "strandTitle": "The Holy Bible",
      "subStrands": [
        {
          "subStrandId": "2.1",
          "subStrandTitle": "The Bible as a Guide",
          "specificLearningOutcomes": [
            "list the importance of reading the Bible",
            "state how often they read the Bible",
            "appreciate the Bible as a guide in daily life"
          ],
          "suggestedLearningExperiences": [
            "in groups, list the importance of reading the Bible",
            "list the number of times they read the Bible as a family",
            "watch a video clip of children reading the Bible",
            "in groups sing a song about the Bible, ‘My Bible and I, ooh…’",
            "read and recite Psalms 119:105"
          ],
          "keyInquiryQuestions": ["Why should you read the Bible?"]
        },
        {
          "subStrandId": "2.2",
          "subStrandTitle": "Divisions of the Bible",
          "specificLearningOutcomes": [
            "state the number of books in the Old Testament",
            "identify the first two books in the Old Testament",
            "appreciate the Bible as the word of God by reading it always"
          ],
          "suggestedLearningExperiences": [
            "state the number of books in the Old Testament",
            "use flashcards and write the first two books in the Old Testament",
            "compose songs using different languages on the first two books in the Old Testament",
            "in groups read and sing a common Psalms e.g. Psalms 100:4, ‘I will enter His gates with thanksgiving in my heart”",
            "in pairs play a game on the number of books in the Old Testament"
          ],
          "keyInquiryQuestions": [
            "Why is it important to know the Books of the Bible?"
          ]
        },
        {
          "subStrandId": "2.3",
          "subStrandTitle": "Bible Story: The Call of Samuel",
          "specificLearningOutcomes": [
            "retell the call of Samuel as guided by the scriptures",
            "mention the lesson learnt from the call of Samuel",
            "desire to obey God’s commandments"
          ],
          "suggestedLearningExperiences": [
            "in pairs picture-read 1Samuel 3:3-10",
            "sing a simple song about the call of Samuel, ‘Alisikia sauti ikimwita Samueli Samueli’",
            "watch a video on the call of Samuel",
            "say how they respond to their parents when called",
            "mention the number of times Samuel was called by God",
            "role-play in small groups the call of Samuel",
            "mention the lesson learnt from the call of Samuel",
            "use flashcards and a pocket board to sort and arrange the verse in 1 Samuel 3:10 sequentially"
          ],
          "keyInquiryQuestions": ["How did Samuel respond to the call of God?"]
        },
        {
          "subStrandId": "2.4",
          "subStrandTitle": "Bible Story: Daniel in the den of lions",
          "specificLearningOutcomes": [
            "retell the story of Daniel as guided by the Bible text",
            "list four lessons learnt from the story of Daniel",
            "apply lessons learnt in day-to- day life",
            "desire to depend on God’s protection"
          ],
          "suggestedLearningExperiences": [
            "picture-read the story of Daniel in the den of lions, Daniel 6:6-12, 19-22",
            "watch a video on the story of Daniel in the den of lions",
            "in groups role-play the story of Daniel in the den of lions",
            "mention the number of times Daniel prayed to God",
            "mention lessons learnt from the story of Daniel",
            "share experiences of when they said No! to things that do not please God",
            "in pairs, share instances they pray at home, school, or church",
            "say and write a simple prayer to God for His protection and guidance",
            "sing the song, ‘Trust and obey for there is no other way…’"
          ],
          "keyInquiryQuestions": ["Why was Daniel thrown in the den of lions?"]
        },
        {
          "subStrandId": "2.5",
          "subStrandTitle": "The Bible Story: The Widow of Zarephath",
          "specificLearningOutcomes": [
            "retell the story of the widow of Zarephath",
            "identify lessons learnt from the miracle",
            "desire to depend on God’s provision"
          ],
          "suggestedLearningExperiences": [
            "picture-read 1Kings 17:7-16",
            "watch a video clip on the miracle; 1 Kings 17:7-16",
            "mention in groups two lessons learnt from the miracle",
            "in pairs draw and colour bread",
            "sing a song on trusting God"
          ],
          "keyInquiryQuestions": [
            "Why did Elijah go to Zarephath?",
            "How did the widow get enough flour and oil?"
          ]
        }
      ]
    },
    {
      "strandId": "3.0",
      "strandTitle": "The Early Life of Jesus Christ",
      "subStrands": [
        {
          "subStrandId": "3.1",
          "subStrandTitle": "The Birth of Jesus Christ",
          "specificLearningOutcomes": [
            "relate the joy of the shepherds as guided by the scriptures",
            "describe the dedication of baby Jesus",
            "appreciate the birth of Jesus Christ our Saviour by obeying Him"
          ],
          "suggestedLearningExperiences": [
            "in turns picture-read Luke 2:15-20",
            "watch a video clip about the shepherds",
            "observe pictures of shepherds worshipping baby Jesus",
            "sing songs related to the birth of Jesus Christ",
            "picture-read Luke 2:22-24",
            "draw and colour pictures of a dove and a pigeon (Luke2:24)",
            "in groups, role-play the dedication of baby Jesus (Luke 2:22-24)"
          ],
          "keyInquiryQuestions": [
            "Why is the birth of Jesus Christ important to all humankind?"
          ]
        },
        {
          "subStrandId": "3.2",
          "subStrandTitle": "Kindness of the Wise Men",
          "specificLearningOutcomes": [
            "list three gifts given to baby Jesus by the wise men",
            "demonstrate assertiveness by refusing gifts from strangers",
            "appreciate Jesus Christ as a gift from God"
          ],
          "suggestedLearningExperiences": [
            "in turns, read Matthew 2:11",
            "name gifts that were brought to baby Jesus by the three wise men",
            "draw and colour gifts given to baby Jesus",
            "use flashcards to role-play the exchange of gifts",
            "role-play saying, ‘thank you’ after receiving gifts from friends and family members",
            "avoid receiving gifts from strangers",
            "list in groups the negative results of receiving gifts from strangers",
            "sing a gratitude song about Jesus’ love, ‘Jesus love is very very wonderful…’"
          ],
          "keyInquiryQuestions": ["How did the wise men show kindness?"]
        },
        {
          "subStrandId": "3.3",
          "subStrandTitle": "Jesus calms the Storm",
          "specificLearningOutcomes": [
            "narrate the miracle of calming the storm",
            "list lessons learnt from the miracle of calming the storm",
            "desire to trust God when faced with challenging situations"
          ],
          "suggestedLearningExperiences": [
            "in turns picture-read Matthew 8:23-27",
            "watch a video clip on the miracle of calming the storm",
            "in pairs mention challenges that a person can face, for example, sickness, lack of food, clothes",
            "in groups say what they do when faced with difficulties",
            "tell two lessons learnt from the miracle",
            "draw and colour a boat",
            "in groups sing a song about calming the storm"
          ],
          "keyInquiryQuestions": ["How did Jesus calm the storm?"]
        },
        {
          "subStrandId": "3.4",
          "subStrandTitle": "Miraculous Catch of Fish",
          "specificLearningOutcomes": [
            "retell the story of the miraculous catch of fish",
            "mention three lessons learnt from the miraculous catch of fish",
            "desire to trust in God as portrayed by the fishermen"
          ],
          "suggestedLearningExperiences": [
            "in turns picture-read Luke 5:3-9",
            "watch a video clip on the miraculous catch of fish",
            "list ways Jesus solved the problem of the fishermen",
            "in pairs tell how the fishermen were able to catch a large number of fish",
            "tell how they exercise faith in God",
            "mention three lessons learnt from the miracle",
            "sing the song ‘I will make you fishers of men…”",
            "draw and colour a fish"
          ],
          "keyInquiryQuestions": ["How did Jesus help the fishermen?"]
        },
        {
          "subStrandId": "3.5",
          "subStrandTitle": "Healing the Man with a Withered Hand",
          "specificLearningOutcomes": [
            "retell the healing of the man with a withered hand",
            "mention occasions they prayed to God for healing",
            "desire to show compassion to others"
          ],
          "suggestedLearningExperiences": [
            "in groups picture-read Matthew 12:9- 11,13",
            "in pairs draw a withered hand",
            "watch a video clip on healing the man with a withered hand",
            "role-play how we care for those abled differently",
            "in pairs share experiences on when they prayed to God for healing",
            "write Mathew 12:13 on flashcards and recite it aloud in class"
          ],
          "keyInquiryQuestions": [
            "How was the man with a withered hand healed?"
          ]
        },
        {
          "subStrandId": "3.6",
          "subStrandTitle": "Easter",
          "specificLearningOutcomes": [
            "recognise the death of Jesus as a sign of total love for humankind",
            "list four activities they do in church during Easter celebrations",
            "appreciate Jesus Christ’s death and resurrection as the way to salvation"
          ],
          "suggestedLearningExperiences": [
            "write 1Corinthians 15:3-4 on flashcards and recite the verse in turns",
            "in pairs mention what happened on Good Friday",
            "view a picture of Jesus nailed on the cross",
            "mention activities they do in church during Easter celebrations",
            "mention what took place on Easter Sunday (Mark 16:5-6)",
            "in groups view a picture of the three women who visited an empty grave",
            "draw an empty cross"
          ],
          "keyInquiryQuestions": [
            "Why is Jesus’ death and resurrection important to Christians today?"
          ]
        }
      ]
    },
    {
      "strandId": "4.0",
      "strandTitle": "Christian Values",
      "subStrands": [
        {
          "subStrandId": "4.1",
          "subStrandTitle": "Sharing",
          "specificLearningOutcomes": [
            "identify five items shared at school",
            "demonstrate kindness by sharing items with others",
            "desire to share items to promote harmonious living"
          ],
          "suggestedLearningExperiences": [
            "in pairs list various items that can be shared at school",
            "in groups draw and colour items they share at school",
            "in pairs talk about instances they have shared items with those in need",
            "list the importance of sharing with others",
            "role-play sharing items in class",
            "sing a song on sharing",
            "write Hebrews 13:16 on flashcards and read aloud"
          ],
          "keyInquiryQuestions": ["Why is it important to share with others?"]
        },
        {
          "subStrandId": "4.2",
          "subStrandTitle": "Obedience",
          "specificLearningOutcomes": [
            "list five ways they obey teachers and the children’s government",
            "discuss reasons for obeying teachers and the children’s government",
            "practise obedience in their day-to-day lives"
          ],
          "suggestedLearningExperiences": [
            "write Hebrews 13:17 on flashcards and read aloud",
            "share experiences of how they obey teachers",
            "tell why they should obey teachers and the children’s government",
            "compose a poem on obedience",
            "discuss how disobedience affects them negatively",
            "sing a song on obedience “trust and obey for there’s no other way’’"
          ],
          "keyInquiryQuestions": [
            "Why should you obey teachers and other leaders at school?"
          ]
        },
        {
          "subStrandId": "4.3",
          "subStrandTitle": "Honesty",
          "specificLearningOutcomes": [
            "tell reasons for telling the truth in their interaction with others",
            "demonstrate responsibility by completing their homework on time",
            "practise honesty by taking lost and found items to the teacher or parent",
            "desire to be honest by not copying other pupils’ work"
          ],
          "suggestedLearningExperiences": [
            "read in groups Proverbs 12:17,19",
            "say why they should tell the truth always",
            "in groups tell why they should complete their homework on time",
            "list the negative results of copying other pupils’ work",
            "tell why they should not take other people’s property without permission",
            "role-play taking lost and found items to the teacher",
            "write Proverbs 12:19 on flashcards and read aloud",
            "sing a song on telling the truth"
          ],
          "keyInquiryQuestions": [
            "Why should you tell the truth always?",
            "Why is it wrong to copy other pupils’ work?"
          ]
        },
        {
          "subStrandId": "4.4",
          "subStrandTitle": "Thankfulness",
          "specificLearningOutcomes": [
            "list the importance of thanking others",
            "demonstrate thankfulness in day-to-day life",
            "appreciate God by thanking Him always"
          ],
          "suggestedLearningExperiences": [
            "mention why they should thank other people",
            "role-play situations that require thankfulness",
            "in pairs exchange gifts and practise saying, ‘Thank you’",
            "in groups write 1Thessalonians 5:18 on flashcards and read aloud",
            "compose poems to thank parents for taking good care of them",
            "sing a song on thanksgiving"
          ],
          "keyInquiryQuestions": ["Why should you be thankful?"]
        },
        {
          "subStrandId": "4.5",
          "subStrandTitle": "Forgiveness",
          "specificLearningOutcomes": [
            "practise forgiveness to foster harmonious living",
            "dramatise the story of the prodigal son",
            "desire to forgive others in their day-to-day lives"
          ],
          "suggestedLearningExperiences": [
            "watch a video clip about the prodigal son (Luke 15:11-22",
            "role-play the story of the prodigal son",
            "write Matthew 18:21-22 on flashcards and read aloud",
            "tell a friend how to avoid hurting others",
            "sing a song on forgiveness"
          ],
          "keyInquiryQuestions": ["Why should you forgive others?"]
        },
        {
          "subStrandId": "4.6",
          "subStrandTitle": "Responsibility",
          "specificLearningOutcomes": [
            "mention items they carry to school",
            "take care of the items they use in school",
            "desire to be responsible by taking care of their items"
          ],
          "suggestedLearningExperiences": [
            "read Colossians 3:23",
            "display and count the items they carry to school",
            "in pairs list the use of each item",
            "say and show others how they take care of items they use at school",
            "sing a song about items they carry to school",
            "draw and colour items they carry to school",
            "say why they should not forget school items at home"
          ],
          "keyInquiryQuestions": ["How do you take care of your school items?"]
        },
        {
          "subStrandId": "4.7",
          "subStrandTitle": "Work",
          "specificLearningOutcomes": [
            "mention how they help parents at home",
            "take part in doing simple chores at school and in Church",
            "appreciate work by doing simple chores"
          ],
          "suggestedLearningExperiences": [
            "in pairs say how they help parents at home",
            "list the simple chores they do at home",
            "write a poem on “hard work’’",
            "keep their home, class, and compound clean"
          ],
          "keyInquiryQuestions": ["Why is it important to work?"]
        }
      ]
    },
    {
      "strandId": "5.0",
      "strandTitle": "The Church",
      "subStrands": [
        {
          "subStrandId": "5.1",
          "subStrandTitle": "Prayer",
          "specificLearningOutcomes": [],
          "suggestedLearningExperiences": [],
          "keyInquiryQuestions": []
        },
        {
          "subStrandId": "5.2",
          "subStrandTitle": "The Holy Spirit",
          "specificLearningOutcomes": [],
          "suggestedLearningExperiences": [],
          "keyInquiryQuestions": []
        }
      ]
    }
  ]
}
